{"badges":["TM31","TM5","TM6"],"usefulItems":"muslin or nut milk bag, glass bottle (1 l), refrigerator","id":"r101897","imageLink":"https:\/\/3.bp.blogspot.com\/-DAgeeoneQCw\/XZam3g5iQRI\/AAAAAAAAg2w\/S8V7dTpvIyc9mYxRBGZnTr3660KrEv1CACLcBGAsYHQ\/s1600\/0_-D45H-ehwlGiUE2K.png","title":"Almond Milk","publishedAt":"2016-04-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"1000 g water, cold, plus extra for soaking"},{"content":"200 g almonds, whole"},{"content":"1000 g water, cold"}],"nutrition":{"protein":"24 g","fat":"53 g","uom":"per 1 Total recipe","carbohydrates":"6 g","calories":"2558 kJ \/ 611 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place a bowl on mixing bowl lid and weigh in almonds. Cover with water and set aside in fridge to soak overnight (or for at least 6 hours)."},{"content":"Rinse soaked almonds under running water then drain and place in mixing bowl."},{"content":"Add 1000 g water and blend <b>3 min\/speed 10<b>. Line simmering basket with a muslin cloth, or use a nut milk bag, then slowly pour almond mixture through muslin, collecting milk in a bowl below. Reserve almond pulp in muslin (see tip) then transfer almond milk to a glass bottle (1 l, see tip). Serve or refrigerate until needed (see tip)."}],"hintsAndTricks":["Thanks to Thermomix it’s easier than ever to make your own nut milks. The powerful blending results in richly flavoured milk, in this case almond, although the method works equally well for other nut varieties.","Keep the almond pulp collected in the muslin. It can be used for making cakes, cereals, ice cream or smoothies. Store in the fridge for up to <b>3 days<b> or freeze until needed.","To prepare bottle, thoroughly wash bottle and lid in hot, soapy water. Rinse by pouring over boiling water. Prepare for filling, if needed, by placing on a clean tea towel in a roasting tin and heat in the oven at 100˚C until required.","The almond milk will keep in the fridge for <b>2-3 days.<b> If it separates, shake the bottle to homogenise again.","The recipe can be halved; just shorten the blending time in <b>step 3<b> to <b>1 minute.<b>","The almond milk can be drunk as is or used as a basis for smoothies or with porridge or cereal.","For hazelnut milk, substitute almonds with hazelnuts.","For sweet almond milk, add <b>1 pitted<b> date with the water in <b>step 3.<b>","Instead of dates, agave syrup or sugar can also be used to sweeten the milk."],"basicInfo":["easy","10m","6h 10m","1 total recipe"]}