{"badges":["TM31","TM5","TM6"],"usefulItems":"long sharp knife, pancake pan or frying pan, small ladle, hob","id":"r102011","imageLink":"https:\/\/2.bp.blogspot.com\/-cnKsbYl0LYc\/XZaeN-nceBI\/AAAAAAAAgj4\/61RgsE7EJHoXGsEuECg-a59j9Vb09iIxgCLcBGAsYHQ\/s1600\/0_Ruw_hoFuWA5lmLmy.png","title":"Chestnut Flour Pancakes with Apple Compote","publishedAt":"2016-02-08T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"180 g chestnut flour"},{"content":"60 g caster sugar"},{"content":"3 medium eggs"},{"content":"350 g milk"},{"content":"20 g butter, melted plus more (unmelted) for frying"},{"content":"400 g apples, peeled, cored and cut in eighths"},{"content":"1 vanilla pod, cut in half lengthways"}],"nutrition":{"protein":"7.3 g","fat":"10.5 g","uom":"per 1 portion","carbohydrates":"43.8 g","calories":"1260 kJ \/ 299 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place flour and sugar in mixing bowl then blend <b>10 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add eggs, 200 g milk and melted butter then mix <b>20 sec\/speed 3.5<b>. Scrape down sides and base of mixing bowl with spatula."},{"content":"Add remaining 150 g milk and stir <b>30 sec\/speed 3.5<b>. Transfer to a bowl and set aside. Clean mixing bowl."},{"content":"Place apples in mixing bowl. Using the tip of a knife, scrape out vanilla seeds and place them in mixing bowl, then add pods. Cook <b>25 min\/100°C\/\/speed 1<b>."},{"content":"Heat a knob of butter in a large pancake or frying pan over a medium heat. Pour a small ladle of batter into the centre then spread out thinly. Cook for 1-2 minutes on each side then transfer to a plate. Repeat, adding more butter when necessary until all batter is used."},{"content":"Remove vanilla pod from mixing bowl then mix <b>20 sec\/speed 7<b>."},{"content":"Serve pancakes warm, garnished with compote."}],"hintsAndTricks":["These pancakes, made with chestnut flour, will have a less firm texture than traditional pancakes made with wheat flour, and will be harder to flip. The taste is deliciously nutty and, served with the compote, makes a good alternative to the standard British pancake option."],"basicInfo":["easy","20m","45m","6 portions"]}