{"badges":["TM5","TM6"],"usefulItems":"frying pan, casserole dish (30 x 20 cm), aluminium foil, large jug, bowl, slotted spoon, pastry brush, stove top, oven","id":"r103481","imageLink":"https:\/\/4.bp.blogspot.com\/-O0A7jW0J8E4\/XZQu2-kVPTI\/AAAAAAAAcX0\/38pWDi8eN2sMFPtkd2LClOQrKq_Sfl-LwCLcBGAsYHQ\/s1600\/0_7naVptcW3sAXaGBg.png","title":"Lemon and lamb pie with filo topping","publishedAt":"2016-06-19T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"20 g olive oil, plus extra for browning"},{"content":"1500 g boneless lamb leg, cut into pieces (4 cm)"},{"content":"1 brown onion (approx. 150 g), cut into halves"},{"content":"3 celery stalks, trimmed and cut into halves"},{"content":"450 g water, plus extra if needed"},{"content":"2 tsp Chicken stock paste (see Tips)"},{"content":"1 tsp freshly ground black pepper"},{"content":"1 cinnamon quill"},{"content":"8 sprigs fresh dill leaves"},{"content":"2 tbsp plain flour"},{"content":"80 g freshly squeezed lemon juice (approx. 2 lemons)"},{"content":"2 egg yolks"},{"content":"340 g fresh silverbeet (2 bunches), trimmed and cut into pieces"},{"content":"400 g artichoke hearts, drained and cut into quaters (optional)"},{"content":"100 g butter, cut into pieces"},{"content":"8 sheets filo pastry"}],"nutrition":{"protein":"59.8 g","fat":"51.1 g","uom":"per 1 portion","carbohydrates":"18.6 g","calories":"3298 kJ \/ 785 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 180°C. Place a frying pan over high heat and add extra oil for browning. Add lamb to frying pan in batches and cook for 2-3 minutes until browned on all sides. Transfer browned meat into a casserole dish (30 x 20 cm) and set aside."},{"content":"Place onion and celery into mixing bowl and chop <b>3 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add oil and sauté <b>3 min\/Varoma\/speed 2<b>."},{"content":"Add water, stock paste and pepper and cook <b>5 min\/Varoma\/speed 2<b>. Transfer stock into casserole dish. Add cinnamon quill to casserole dish, then cover with a tight-fitting lid or aluminium foil and bake for 1½ hours (180°C). Clean and dry mixing bowl."},{"content":"Remove casserole dish from oven and, using a slotted spoon, remove meat and transfer into a bowl. Remove and discard cinnamon quill.  Carefully transfer hot stock in casserole dish into a large jug and set aside to cool slightly. Set casserole dish aside."},{"content":"Increase oven temperature to 190°C."},{"content":"Place dill into mixing bowl and chop <b>3 sec\/speed 7<b>."},{"content":"Add flour, lemon juice, egg yolks and 700 g reserved stock (if reserved stock is less than 700 g, add extra water as needed) and cook <b>6 min\/100°C\/speed 2<b>."},{"content":"Transfer reserved cooked meat back into casserole dish. Add silverbeet, artichoke hearts (optional) and stock mixture, then stir to combine. Clean and dry mixing bowl."},{"content":"Place butter into mixing bowl and melt <b>2 min\/100°C\/speed 2<b>. Place 2 sheets of filo pastry onto a clean work surface and brush each sheet with melted butter. Place one sheet over meat mixture in casserole dish, then top with second filo sheet, pressing filo into the sides of the casserole dish to enclose meat mixture."},{"content":"Brush remaining 6 sheets of filo pastry with melted butter. Gently scrunch each sheet into a loose ball and arrange over top of pie. Bake for 25-30 minutes (190°C) or until filo is crisp and golden brown. Serve immediately."}],"hintsAndTricks":["Serve with steamed vegetables or a garden salad.","Please refer to <em>The Basic Cookbook<\/em> or <em>Everyday Cookbook<\/em> for the Chicken stock paste recipe."],"basicInfo":["medium","30m","2h 40m","6 portions"]}