{"badges":["TM5","TM6"],"usefulItems":"ceramic or glass bowl, bowl, jug, large bowl","id":"r103594","imageLink":"https:\/\/4.bp.blogspot.com\/-N6XJqfTxlX4\/XZMurgM96gI\/AAAAAAAAaIc\/giOCNrWhttMxMY_GAAa6LkYIBCH_u-a8QCLcBGAsYHQ\/s1600\/0_OvXZUqaE5DPhsS0l.png","title":"Grain salad lettuce cups (Dani Valent)","publishedAt":"2016-12-28T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"20 g dried shiitake mushrooms"},{"content":"800 g hot water"},{"content":"160 g farro"},{"content":"1 tbsp Vegetable stock paste (see Tips)"},{"content":"1200 g water"},{"content":"140 g puy lentils"},{"content":"100 g white quinoa"},{"content":"10 raw peeled prawns"},{"content":"50 g olive oil"},{"content":"1 tsp sea salt flakes, plus extra to taste"},{"content":"½ tsp  ground black pepper, plus extra to taste"},{"content":"2 kale leaves, stalks removed and leaves cut into thin slices"},{"content":"6 sprigs fresh basil, leaves only, cut into thin strips"},{"content":"2 tsp lemon juice"},{"content":"2 baby cos lettuce, leaves separated"},{"content":"150 g feta cheese, crumbled"}],"nutrition":{"protein":"23.135 g","fat":"16.619 g","uom":"per 1 portion","carbohydrates":"37.482 g","calories":"1716 kJ \/ 408 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place a ceramic or glass bowl onto mixing bowl lid, weigh shiitake mushrooms and hot water into it, then set aside to soak (approx. 30 minutes) while cooking farro."},{"content":"Place farro into mixing bowl and toast <b>5 min\/Varoma\/speed 1<b>. Transfer toasted farro into simmering basket."},{"content":"Place stock paste and 600 g of the water into mixing bowl. Insert simmering basket with farro and cook <b>10 min\/Varoma\/speed 1<b>."},{"content":"Add lentils to simmering basket and cook for a further <b>15 min\/Varoma\/speed 1<b>. Stir contents of simmering basket."},{"content":"Drain reserved mushrooms, reserving soaking liquid. Remove and discard woody stalks from mushrooms, then cut mushroom caps into pieces."},{"content":"Add mushrooms and quinoa to simmering basket and pour soaking liquid over grains in simmering basket and cook <b>17 min\/Varoma\/speed 1<b>."},{"content":"Pour remaining 600 g water over grains in simmering basket, stir grains and cook for a further <b>6 min\/Varoma\/speed 1<b>."},{"content":"Place Varoma dish into position, place prawns into it, secure Varoma lid and steam <b>8 min\/Varoma\/speed 1<b> or until grains and prawns are just cooked. Remove Varoma dish and cut prawns into pieces (approx. 2 cm)."},{"content":"Transfer grains into a large bowl and toss with olive oil, salt, pepper, kale, basil and lemon juice. Set aside to cool slightly (approx. 10 minutes)."},{"content":"Spoon grain salad into 12 baby cos leaves. Top with prawns and crumbled feta, and season with extra salt and pepper before serving."}],"hintsAndTricks":["Please refer to <em>The Basic Cookbook <\/em>or <em>Everyday Cookbook <\/em>for the Vegetable stock paste recipe.","You can substitute mint leaves for basil leaves, if desired.","<b>Vegetarian<b>: omit prawns in step 8 and proceed as per recipe, without using Varoma dish."],"basicInfo":["easy","15m","1h 55m","6 portions"]}