{"badges":["TM5","TM6"],"usefulItems":"baking sheet (approx. 16 in. x 14 in.), parchment paper, aluminum foil, frying pan, plate, paper towels, refrigerator","id":"r105493","imageLink":"https:\/\/2.bp.blogspot.com\/-X0pLXUgpSYU\/XZMv6RcWeJI\/AAAAAAAAaXk\/vpOrvQt5dBYz2amjaFj1R68hhU3xV97UQCLcBGAsYHQ\/s1600\/0_sufXYpM5nSWlLSSl.png","title":"Crab Cakes","publishedAt":"2016-08-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"5 ½ oz bread, in pieces (¾ in.)"},{"content":"1 oz shallots, peeled and halved"},{"content":"5 sprigs fresh parsley, leaves only (approx. 0.2 oz)"},{"content":"1 oz celery stalk, sliced (¼ in.)"},{"content":"2 oz red bell pepper, in pieces (¼ in.)"},{"content":"2 tbsp mayonnaise"},{"content":"2 jumbo eggs"},{"content":"1 tsp Dijon mustard"},{"content":"1 tsp Worcestershire sauce"},{"content":"1 tsp Old Bay Seasoning"},{"content":"¼ tsp salt"},{"content":"1 pinch freshly ground pepper, to taste"},{"content":"16 - 18 oz jumbo lump crab meat"},{"content":"oil, for frying"}],"nutrition":{"protein":"22 g","fat":"10 g","uom":"per 1 piece","carbohydrates":"16 g","calories":"701 kJ \/ 238 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Line a baking sheet (approx. 16 in. x 14 in.) with parchment or foil and set aside."},{"content":"Place bread into mixing bowl and grind <b>30 sec\/speed 9<b>. Transfer to a bowl and set aside."},{"content":"Place shallots, parsley and celery into mixing bowl and chop <b>5 sec\/speed 6<b>."},{"content":"Add red pepper and chop <b>6 sec\/speed 4<b>."},{"content":"Add mayonnaise, eggs, Dijon mustard, Worcestershire sauce, Old Bay Seasoning, salt and pepper and mix <b>8 sec\/speed 3<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add crab meat and 4 tbsp of reserved bread crumbs and mix <b>5 sec\/\/speed <b>."},{"content":"Shape into 6 crab cakes (approx. ½ cup ea.). Place remaining bread crumbs on a plate, lightly coat crab cakes with bread crumbs and transfer to prepared baking sheet. Cover and refrigerate for at least 1 hour."},{"content":"Heat a large frying pan to medium high heat and coat with oil. When oil is hot, place crab cakes in pan and fry until golden brown (approx. 3-5 min. per side). Be careful as oil may splatter. Drain on paper towels and serve immediately."}],"hintsAndTricks":["Crab cakes can be broiled instead of fried. Broil on high 3-4 minutes each side or until golden brown","Serve crab cakes with sweet chili dipping sauce, lemon wedges, or tartar sauce.","Sprinkle crab cakes with fresh cilantro leaves, chopped chives or the green part of scallions, sliced thinly.","If using store-bought bread crumbs or Panko, simply add with the shallots and omit grinding of bread.","Add 1-2 tsp fresh cilantro or dill leaves (5-6 sprigs, leaves only)"],"basicInfo":["easy","30m","1h 35m","6 pieces"]}