{"badges":["TM5","TM6"],"usefulItems":"large bowl, plastic wrap, silicone bread mat, baking tray (30 x 40 cm), baking paper, large saucepan, slotted spoon, wire rack, oven, stove top","id":"r105672","imageLink":"https:\/\/4.bp.blogspot.com\/-xjccUO6BeRw\/XZaqmCjhmaI\/AAAAAAAAhek\/4tDSc7HFroADY0f8Lh7DYHF_QMjV_doGQCLcBGAsYHQ\/s1600\/0_fe0i4aJjd0uhS7A0.png","title":"Pretzels","publishedAt":"2016-09-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"olive oil, for greasing"},{"content":"400 g full cream milk"},{"content":"2 tsp dried instant yeast"},{"content":"600 g baker's flour"},{"content":"2 tsp salt"},{"content":"800 g water"},{"content":"3 tbsp bicarbonate of soda"},{"content":"coarse salt, for sprinkling"},{"content":"sesame seeds, for sprinkling (optional)"}],"nutrition":{"protein":"8.26 g","fat":"3.99 g","uom":"per 1 portion","carbohydrates":"46.3 g","calories":"1092 kJ \/ 260 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Lightly grease a large bowl with oil and set aside."},{"content":"Place milk and yeast into mixing bowl and mix <b>2 min\/37°C\/speed 1<b>."},{"content":"Add flour and salt and knead <b>2 min\/<b>. Transfer dough onto a silicone bread mat or lightly floured work surface and shape into a ball. Place into prepared bowl, cover with plastic wrap and leave to prove in a warm place until doubled in size (approx. 45 minutes). Clean and dry mixing bowl."},{"content":"Preheat oven to 200°C. Line a baking tray (30 x 40 cm) with baking paper and set aside."},{"content":"Transfer dough onto silicone bread mat or lightly floured work surface. Divide dough into 10 equal portions (approx. 100 g each) and roll each portion into a rope (approx. 65 cm long). Shape 1 rope into a U-shape. Cross over the two ends to form an X. Twist the ends once. Take the two ends down through the centre to the bottom of the U-shape and secure (4 cm apart) to form a pretzel shape. Place onto prepared baking tray. Repeat shaping with remaining dough portions."},{"content":"Place water and bicarbonate of soda into a large saucepan and bring to the boil. Carefully drop each pretzel into boiling water and cook for 10 seconds. Using a slotted spoon, transfer pretzels back onto baking tray. Immediately sprinkle pretzels with salt and sesame seeds (optional). Bake for 12 minutes (200°C), or until golden brown. Transfer pretzels onto a wire rack and allow to cool completely before serving."}],"hintsAndTricks":["Serve with freshly made butter from <em>The Basic Cookbook<\/em> or <em>Everyday Cookbook<\/em>, or Obatzter (cheese spread) in this Oktoberfest collection.","You can use 40 g fresh yeast instead of dried yeast."],"basicInfo":["easy","35m","1h 35m","10 portions"]}