{"badges":["TM5","TM6"],"usefulItems":"toothpick, serving bowl, pitcher, medium-size non-stick frying pan","id":"r106928","imageLink":"https:\/\/1.bp.blogspot.com\/-3JD2bd7S6ys\/XZQxiOAuMII\/AAAAAAAAcv8\/UWEBTsbtLVkN-nVYdNHp_65NIdwqsrGyQCLcBGAsYHQ\/s1600\/0_tuIQ4yF0bPXX-Dtk.png","title":"Cranberry and Camembert Stuffed Chicken with Mustard Sauce","publishedAt":"2017-03-17T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Cranberry Camembert Stuffing"},{"content":"1 garlic clove"},{"content":"½ shallot (approx. 2 oz)"},{"content":"1 oz salted butter"},{"content":"2 oz dried cranberries"},{"content":"1 oz raw hazelnuts"},{"content":"2 sprigs fresh flat-leaf parsley, leaves only (approx. 21 leaves)"},{"content":"1 pinch salt"},{"content":"1 pinch ground black pepper"},{"content":"5 oz Camembert cheese, with rind left on and cut into quarters"},{"isHeader":true,"content":"Chicken, Potatoes and Mustard Sauce"},{"content":"1 garlic clove"},{"content":"½ shallot (approx. 2 oz)"},{"content":"10 fresh chives, cut into quarters"},{"content":"1 oz salted butter"},{"content":"17 ½ oz water"},{"content":"1 - 2 tsp chicken stock paste (see Tip)"},{"content":"6 baby gold potatoes, cleaned and cubed (1 in.), (approx. 22.5 oz)"},{"content":"32 oz chicken breasts, boneless and skinless (approx. 3-4 breasts)"},{"content":"7 - 10 oz fresh green beans, trimmed"},{"content":"½ oz dry white wine"},{"content":"2 tbsp all-purpose flour"},{"content":"3 tsp hot English mustard"},{"content":"2 tsp prepared horseradish"},{"content":"2 tsp seeded mustard (whole grain or stone ground)"},{"content":"1 - 2 pinches salt, to taste"}],"nutrition":{"protein":"30 g","fat":"38 g","uom":"per 1 portion","carbohydrates":"50 g","calories":"2724 kJ \/ 651 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Cranberry Camembert Stuffing"},{"content":"Place garlic, shallot and butter into mixing bowl and chop <b>3 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula and sauté <b>2 min\/212°F\/speed 1<b>."},{"content":"Add all remaining stuffing ingredients and chop <b>10 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula and mix a further <b>5 sec\/speed 5<b>. Transfer to a bowl and set aside. Clean mixing bowl."},{"isHeader":true,"content":"Chicken, Potatoes and Mustard Sauce"},{"content":"Place garlic, shallot, chives and butter into mixing bowl and chop <b>3 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula and cook <b>2 min\/212°F\/speed 1<b>."},{"content":"Add water and stock paste. Stir with spatula. Insert simmering basket, and place in potatoes."},{"content":"Place chicken breasts onto a work surface. Slice each breast horizontally, taking care not to cut all the way through. Fill chicken breasts with reserved cranberry stuffing and insert 1 or 2 toothpicks to close the opening and ensure the filling is contained."},{"content":"Place 2 stuffed chicken breasts onto Varoma tray and 1 into Varoma dish. Secure Varoma lid, place Varoma into position and steam <b>10 min\/Varoma\/speed 2<b>."},{"content":"Turn chicken breasts over and swap chicken in Varoma dish to tray and vice versa to ensure even cooking, secure Varoma lid and steam a further <b>10 min\/Varoma\/speed 2<b>. When chicken is cooked remove Varoma and transfer chicken to a plate."},{"content":"Place Varoma dish back into position and weigh in green beans. Secure Varoma lid, cook <b>5 min\/Varoma\/speed 2<b>, or until potatoes and beans are cooked to your liking. Place a medium-size non-stick frying pan over a medium-high heat and add chicken breasts. Gently fry each breast for 2-3 minutes each side or until chicken is golden."},{"content":"Transfer chicken breasts, potatoes and beans to a serving bowl or other large bowl and cover to keep warm. Retain steaming liquid in mixing bowl."},{"content":"Add all remaining ingredients into mixing bowl. Place simmering basket instead of measuring cup onto mixing bowl lid to avoid splashing and cook <b>4 min\/212°F\/speed 3<b>. Transfer mustard sauce into a serving pitcher."},{"content":"Remove toothpicks from chicken breasts, cut each breast in half and serve immediately with potatoes, green beans and mustard sauce."}],"hintsAndTricks":["Please refer to <i>The Basic Cookbook<\/i> for the Chicken Stock Paste recipe.","Ask your butcher to butterfly your chicken breasts to save time, then you only need to fill with stuffing and close with toothpicks.","To serve mashed potatoes: place cooked potato into mixing bowl after removing the mustard sauce. <b>Insert butterfly whisk<b> and mash <b>20-30 sec\/speed 3-4.<b>"],"basicInfo":["advanced","25m","45m","6 portions"]}