{"badges":["TM5","TM6"],"usefulItems":"baking tray (30 x 40 cm), baking tray (20 x 30 cm), baking paper, sealable storage jar or container, aluminium foil, freezer, oven","id":"r106789","imageLink":"https:\/\/1.bp.blogspot.com\/-fCql8z_hHEI\/XZWfObOGI1I\/AAAAAAAAfAs\/0dABA4J9Ih42ueUFqMkf5GpiPuz2DVK5wCLcBGAsYHQ\/s1600\/0_r6zJ0uqChn_7nhfp.png","title":"Banoffee arctic roll","publishedAt":"2016-11-20T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Banana ice cream"},{"content":"5 ripe bananas (approx. 500 g), cut into slices"},{"content":"1 tsp vanilla bean paste"},{"content":"45 g pouring (whipping) cream"},{"isHeader":true,"content":"Caramel sauce"},{"content":"80 g unsalted butter, cut into pieces"},{"content":"110 g double cream"},{"content":"40 g dark brown sugar"},{"content":"40 g caster sugar"},{"content":"40 g pure maple syrup"},{"content":"1 tsp vanilla bean paste"},{"content":"½ tsp fine sea salt"},{"isHeader":true,"content":"Vanilla sponge"},{"content":"butter, for greasing"},{"content":"125 g caster sugar, plus extra for sprinkling"},{"content":"5 eggs, room temperature"},{"content":"1 tsp vanilla bean paste"},{"content":"125 g self-raising flour"},{"content":"icing sugar, for dusting"}],"nutrition":{"protein":"6.08 g","fat":"17.72 g","uom":"per 1 portion","carbohydrates":"50.38 g","calories":"1600 kJ \/ 381 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Banana ice cream"},{"content":"Line a baking tray with baking paper. Place banana slices onto tray in a single layer and place into freezer overnight."},{"content":"Place frozen banana, vanilla and cream into mixing bowl and blend <b>30 sec\/speed 1<b> <b>-10, increasing speed gradually from speed 1 to speed 10<b>."},{"content":"Scrape down sides of mixing bowl with spatula. Blend <b>30 sec\/speed 6<b>, or until thick and creamy."},{"content":"Transfer banana mixture onto a sheet of baking paper. Using the baking paper to help, roll the mixture tightly together into a cylinder approx. 30 cm in length. Twist ends of baking paper (into a Christmas cracker shape) and place into freezer for 2 hours. Clean and dry mixing bowl."},{"isHeader":true,"content":"Caramel sauce"},{"content":"Place all caramel sauce ingredients into mixing bowl and cook <b>10 min\/Varoma\/speed 2<b>, placing simmering basket instead of measuring cup onto mixing bowl lid."},{"content":"Transfer sauce into a sealable container and allow to cool to room temperature (approx. 30 minutes), then place into freezer to set (approx. 40 minutes). Clean and dry mixing bowl."},{"isHeader":true,"content":"Vanilla sponge"},{"content":"Preheat oven to 210°C. Grease and line a baking tray (30 x 40 cm) with baking paper and set aside."},{"content":"Place sugar in mixing bowl and mill <b>10 sec\/speed 9<b>."},{"content":"Scrape down sides of mixing bowl with spatula. <b>Insert<b> <b>butterfly whisk<b>. Add eggs and vanilla and whisk <b>15 min\/speed 4<b>, or until mixture is light and frothy."},{"content":"Add flour and combine <b>50 sec\/\/speed 1<b>. <b>Remove butterfly whisk<b>."},{"content":"Pour mixture onto prepared baking tray. Gently shake tray to ensure mixture spreads evenly across tray (do not spread using a spatula as this may release air in batter). Bake for 10-12 minutes (210°C), or until sponge is golden and starts to shrink away from sides of baking tray."},{"content":"Carefully flip warm sponge onto a work suface, keeping baking paper attached. Roll long edge of sponge towards you while sponge is still warm so it will hold its shape. Set aside to cool (approx. 5-10 minutes)."},{"content":"Place a sheet of baking paper on the work surface and sprinkle with extra sugar. Place rolled sponge onto sugar and unroll. Peel off rolled baking paper. Trim edges of sponge."},{"content":"Spread reserved caramel sauce over sponge. Working quickly, unwrap banana ice cream and place onto caramel sauce. Wrap sponge around ice cream. Trim ends, if required."},{"content":"Use baking paper to tightly wrap artic roll, then wrap in aluminium foil. Place into freezer for a minimum of 30 minutes. Dust with icing sugar before serving."}],"basicInfo":["medium","10m","28h 40m","10 portions"]}