{"badges":["TM5","TM6"],"usefulItems":"bowl, plastic wrap, silicone bread mat, rolling pin, pastry docker, baking paper, 2 baking trays (30 x 40 cm), piping bag with round nozzle (1 cm), refrigerator, oven","id":"r108363","imageLink":"https:\/\/4.bp.blogspot.com\/-e2TJ6LhqMkM\/XZWqKLGWm4I\/AAAAAAAAfT4\/DsJm6HK7BQYzUV5p0CBtTgOGD6IFn-ZXACLcBGAsYHQ\/s1600\/0_ERv6x22DyMct1UgQ.png","title":"Chocolate custard mille feuille","publishedAt":"2016-03-20T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Pastry cream"},{"content":"50 g cornflour"},{"content":"20 g caster sugar"},{"content":"220 g full cream milk"},{"content":"20 g unsalted butter"},{"content":"2 eggs"},{"content":"1 tsp natural vanilla extract"},{"content":"50 g dark chocolate, broken into pieces"},{"isHeader":true,"content":"Puff pastry"},{"content":"250 g plain flour, plus extra for dusting (see Tips)"},{"content":"200 g unsalted butter, chilled, cut into pieces"},{"content":"½ tsp sea salt"},{"content":"2 tsp lemon juice"},{"content":"100 g water, chilled"},{"isHeader":true,"content":"Assembly"},{"content":"icing sugar, for dusting"},{"content":"50 g fresh raspberries, (approx. 12)"}],"nutrition":{"protein":"8.91 g","fat":"35.27 g","uom":"per 1 portion","carbohydrates":"54.33 g","calories":"2390 kJ \/ 569 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Pastry cream"},{"content":"Place cornflour and sugar into mixing bowl and mix <b>3 sec\/speed 5<b>."},{"content":"Add milk, butter, eggs and vanilla into mixing bowl and mix <b>5 sec\/speed 4<b>."},{"content":"Scrape down sides of mixing bowl with spatula and cook <b>10-12 min\/90°C\/speed 3<b>, until custard has thickened. Scrape down sides and bottom of mixing bowl with spatula."},{"content":"Add chocolate and melt <b>1 min\/speed 3<b>. Transfer into a bowl and allow to cool to room temperature (approx. 20 min). Cover with plastic wrap and place into refrigerator to cool completely (approx. 6 hours). Clean and dry mixing bowl."},{"isHeader":true,"content":"Puff pastry"},{"content":"Place all puff pastry ingredients into mixing bowl and knead <b>20-30 sec\/<b>. The butter should still be in small visible chunks within the pastry dough."},{"content":"Transfer dough onto a silicone bread mat or lightly floured work surface and, with floured fingertips, gently shape into a rectangle."},{"content":"With the shorter end of the dough closest to you, roll dough into a long rectangle (approx. 60 x 20 cm), dusting pastry and rolling pin with more flour as needed, and lifting dough off work surface to ensure dough doesn't stick."},{"content":"Once rolled, start folding pastry over, first fold being approximately 10 cm wide until you have 6 folds."},{"content":"Wrap pastry in plastic wrap and place into refrigerator to rest for 30 minutes. Clean and dry mixing bowl."},{"content":"Divide rested pastry into 2 equal portions. On a sheet of baking paper, roll each piece of pastry into a rectangle (approx. 22 x 30 cm). Pierce the pastry with a pastry docker or a fork all over. Cut each sheet of pastry into 10 rectangles (10 x 6 cm)."},{"content":"Place into refrigerator on baking paper to rest for a further 30 minutes."},{"content":"Preheat oven to 185°C. Set aside 2 baking trays (30 x 40 cm)."},{"content":"Transfer pastry rectangles with baking paper onto baking trays and bake for 15-18 minutes (185°C), or until golden. Set aside until cool."},{"isHeader":true,"content":"Assembly"},{"content":"Transfer cooled chocolate custard into a piping bag."},{"content":"Divide pastry rectangles into six portions (3 rectangles in each portion, you will have 2 extra rectangles of pastry). Use half of the chocolate custard and pipe over bottom of the pastry layers, taking care to keep custard within edges of pastry.  Place the second pastry layer over custard. Pipe remaining chocolate custard over second pastry layer. Place final portion of pastry over custard, and press down gently. Place into refrigerator until ready to serve."},{"content":"Dust generously with icing sugar and decorate with raspberries just before serving."}],"hintsAndTricks":["Pastry cream can be made the day before.","Plain flour can be substituted with baker's flour.","Pastry can be made day before, through step 9. Store in refrigerator until ready to use."],"basicInfo":["medium","30m","8h 15m","6 portions"]}