{"badges":["TM5","TM6"],"usefulItems":"springform pan (11 in.), parchment paper, toothpick or skewer, icing spatula, airtight container, piping bag and tips, bowls, oven, refrigerator","id":"r109369","imageLink":"https:\/\/4.bp.blogspot.com\/-N_quU8zbg7k\/XZWrvYI2kqI\/AAAAAAAAfsE\/HWOIdgG7QQ4W87R02m1VZIMrOYKFY5VuACLcBGAsYHQ\/s1600\/0_tH07Nc2XJyWbUWIH.png","title":"Rainbow Cake","publishedAt":"2017-03-17T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Cake Batter"},{"content":"7 ½ oz unsalted butter, room temperature, cut into pieces"},{"content":"14 oz sugar"},{"content":"3 large eggs"},{"content":"12 oz whole milk"},{"content":"13 oz all-purpose flour"},{"content":"1 tbsp baking powder"},{"content":"1 pinch salt"},{"content":"6 gel food coloring, (blue, green, yellow, orange, purple and pink)"},{"isHeader":true,"content":"Frosting"},{"content":"7 oz bakers sugar"},{"content":"35 oz heavy whipping cream"}],"nutrition":{"protein":"10 g","fat":"55 g","uom":"per 1 portion","carbohydrates":"54 g","calories":"3067 kJ \/ 733 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Cake Batter"},{"content":"Preheat oven to 350°F. Grease or line a springform pan (11 in.) with parchment paper and set aside."},{"content":"Place butter and sugar into mixing bowl and mix <b>1 min\/100°F\/speed 3<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add eggs, milk, flour, baking powder and salt and mix <b>1 min\/speed 6<b>. Divide batter evenly into 6 different bowls, add ½ tsp of food coloring in each and mix well with a spoon until desired color is achieved (see Tip). Pour one circle of colored batter into the center of the prepared pan and add remaining batters slowly around each previous color."},{"content":"Bake 40-50 minutes (350°F). Check to see if cake is done by inserting a skewer. Meanwhile clean mixing bowl and make frosting."},{"isHeader":true,"content":"Frosting"},{"content":"Place bakers sugar into mixing bowl and grind <b>15 sec\/speed 10<b>."},{"content":" <b>Insert butterfly whisk,<b> add cream and without setting a time beat, <b>min\/speed 3<b> watching carefully and stopping when the cream is whipped. Chill frosting in refrigerator until ready to decorate. Decorate the entire cake with frosting using an icing spatula or piping bag (see Tip). Store in refrigerator in an airtight container until needed."}],"hintsAndTricks":["Use plain frosting or divide the frosting equally between 6 bowls and add colors to each as with the batter. Place frosting into 6 icing bags and decorate to your liking.","Add less or more drops of food coloring until desired color is achieved for both batter and frosting.","If using piping bags to decorate cake, refrigerate piping bags not in use to keep frosting chilled for easy application."],"basicInfo":["advanced","50m","2h 10m","10 portions"]}