{"badges":["TM5","TM6"],"usefulItems":"large plate, kitchen towel, plastic wrap, ceramic or glass bowl, large sealable container, refrigerator","id":"r112637","imageLink":"https:\/\/3.bp.blogspot.com\/-LJRXXOmcUXU\/XZWfRCtg8xI\/AAAAAAAAfBY\/zHZNN63M_DIWsRHuLLrz9qy6rr-qiWF-ACLcBGAsYHQ\/s1600\/0_rw8ezGK5Pv6iKIOc.png","title":"Buckwheat and date bliss balls","publishedAt":"2016-11-20T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"100 g buckwheat"},{"content":"260 g water"},{"content":"160 g pitted Medjool dates"},{"content":"20 g roasted unsalted peanuts"},{"content":"2 tbsp almond butter (see Tips)"},{"content":"2 tbsp pure maple syrup"},{"content":"30 g raw cacao powder"},{"content":"15 g chia seeds"},{"content":"15 g vanilla protein powder"},{"content":"80 g shredded coconut"}],"nutrition":{"protein":"1.4 g","fat":"3.1 g","uom":"per 1 portions","carbohydrates":"6.8 g","calories":"263 kJ \/ 62 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Insert simmering basket, then weigh buckwheat into it. Remove simmering basket with aid of spatula and rinse buckwheat under running water. Set aside to drain."},{"content":"Place a ceramic or glass bowl onto mixing bowl lid and weigh 100 g of the water into it. Add drained buckwheat to bowl, cover with plastic wrap and leave to soak overnight."},{"content":"Place a separate ceramic or bowl onto mixing bowl lid and weight dates into it. Add remaining 160 g water and set aside to soak for 20 minutes."},{"content":"Place peanuts into mixing bowl and chop <b>4 sec\/speed 9<b>."},{"content":"Drain and rinse buckwheat, then dry using kitchen towel."},{"content":"Drain dates. Add drained dates and buckwheat, almond butter, syrup, cacao powder, chia seeds, protein powder (optional) and 40 g of the shredded coconut and mix <b>15 sec\/speed 6<b>."},{"content":"Scatter remaining 40 g coconut onto a large plate. Using wet hands, divide mixture into 35 balls (approx. 2 teaspoons each) and roll each ball in coconut to coat."},{"content":"Transfer balls into a sealable storage container and place into refrigerator until ready to serve."}],"hintsAndTricks":["You can store balls in a sealable container in refrigerator for up to 3 weeks.","You can find vanilla protein powder in most health food stores and the health food aisle of some supermarkets. To boost the protein content, add more protein powder (to taste).","To make your own almond butter, visit the Official Thermomix Recipe Community (www.recipecommunity.com.au) for recipes."],"basicInfo":["easy","20m","24h 20m","35 pieces"]}