{"badges":["TM31","TM5","TM6"],"usefulItems":"thermal serving bowl or large ceramic bowl, bowl, long sharp knife, small bowl, nut milk bag or 2 muslin cloths, refrigerator","id":"r113084","imageLink":"https:\/\/1.bp.blogspot.com\/-UTtuqdOIaYM\/XZWfdF1TNXI\/AAAAAAAAfE0\/XifZp9bswmE9o35IQ1Ux5nEQEToFdEMsQCLcBGAsYHQ\/s1600\/0_vj08fwZ7O6b2Ol2E.png","title":"Cottage cheese","publishedAt":"2018-09-06T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"2 tbsp filtered water"},{"content":"½ rennet tablet (see Tips)"},{"content":"2000 g full cream milk"},{"content":"1 ml calcium chloride (food grade - 1 ml) (see Tips)"},{"content":"1 sachet mesophilic starter culture (see Tips)"}],"nutrition":{"protein":"68 g","fat":"68 g","uom":"per 1 Complete recipe","carbohydrates":"120 g","calories":"5623.3 kJ \/ 1338.9 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place water and rennet tablet into a bowl to dissolve."},{"content":"Place milk into mixing bowl and heat <b>10 min\/37°C\/speed 1<b>."},{"content":"Mix <b>1 min\/speed 2<b>, adding calcium chloride (see Tips), mesophilic starter culture and rennet mixture through hole in mixing bowl lid."},{"content":"Transfer mixture into a warmed thermal serving bowl or warmed large ceramic bowl (see Tips), cover and set aside for 3 hours."},{"content":"Using a long blade knife, cut curd into cubes (3 cm) and allow to sit undisturbed for 10 minutes."},{"content":"Place curds and whey into mixing bowl and heat <b>30 min\/50°C\/\/speed <b>. Set mixing bowl aside and allow curds to sit for 5 minutes."},{"content":"Line simmering basket with a nut milk bag or 2 layers muslin cloth. Transfer curds and whey into lined simmering basket. Set aside to drain for 30 minutes. Discard whey. Transfer curds into a bowl and break apart with aid of spatula. Place into refrigerator to cool completely, then serve as desired (see Tips)."}],"hintsAndTricks":["Rennet is a complex set of enzymes produced by ruminant mammals and is often used to separate milk into solid curds and liquid whey. You can purchase rennet from cheese making companies, some major kitchenware stores and online.","Calcium chloride and starter cultures can be purchased from cheese making companies, some major kitchenware stores and online. You will need to purchase a medicine dropper (or an infant medicine dropper) to accurately measure 1 ml calcium chloride.","To warm a thermal serving bowl or ceramic bowl, fill with hot water, let stand for a few minutes, then discard water and dry bowl.","Cottage cheese can be stored in the refrigerator, covered, for up to 1 week."],"basicInfo":["easy","10m","4h 30m","1"]}