{"badges":["TM5","TM6"],"usefulItems":"baking tray (30 x 40 cm), baking paper, pastry brush, tea towel, thermal serving bowl or other large bowl, bowl, large bowl, 1 plate, kitchen towel, waffle iron, oven, oven grill","id":"r114543","imageLink":"https:\/\/4.bp.blogspot.com\/-nS8GInphCEs\/XZadiToViOI\/AAAAAAAAgc4\/QGg552JLp-coVnIrPfz-x3ruThL9-EqYQCLcBGAsYHQ\/s1600\/0_DtJtBStDvI2QmcPP.png","title":"Waffles with maple bacon","publishedAt":"2016-10-16T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Maple bacon"},{"content":"400 g streaky bacon"},{"content":"2 tbsp pure maple syrup"},{"isHeader":true,"content":"Waffles"},{"content":"280 g gluten free flour mix (see Tips)"},{"content":"2 tsp gluten free baking powder (see Tips)"},{"content":"½ tsp salt"},{"content":"60 g white sugar"},{"content":"320 g almond milk"},{"content":"100 g vegetable oil"},{"content":"3 eggs, separated"},{"content":"pure maple syrup, to serve"}],"nutrition":{"protein":"22.9 g","fat":"34.7 g","uom":"per 1 portion","carbohydrates":"88.2 g","calories":"3159 kJ \/ 752 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Maple bacon"},{"content":"Preheat oven to 190°C. Line a baking tray (30 x 40 cm) with baking paper."},{"content":"Place bacon rashers in a single layer onto prepared tray and bake for 10 minutes (190°C). Remove tray from oven and brush one side of bacon with syrup."},{"content":"Preheat grill. Grill bacon until crispy or as desired. Transfer into a thermal serving bowl or other large bowl and cover to keep warm."},{"isHeader":true,"content":"Waffles"},{"content":"Place flour mix, baking powder, salt and sugar into mixing bowl and mix <b>5 sec\/speed 8<b>. Transfer into a bowl and set aside."},{"content":"Place milk, oil and egg yolks into mixing bowl and mix <b>8 sec\/speed 4<b>."},{"content":"Add reserved flour mixture and mix <b>8 sec\/speed 8<b>. Transfer batter into a large bowl and set aside. Thoroughly clean and dry mixing bowl."},{"content":" <b>Insert butterfly whisk<b>. Place egg whites into mixing bowl and whip <b>2 min\/speed 3<b> or until stiff peaks form. <b>Remove butterfly whisk<b>. Fold egg whites gently through reserved batter mixture."},{"content":"Preheat waffle iron. Pour batter (approx. 3 tablespoons per waffle) into waffle iron and cook according to manufacturer's instructions or until golden and crispy. Transfer waffle onto a plate and cover with kitchen towel to keep warm. Repeat with remaining batter (to make approx. 10 waffles in total)."},{"content":"Serve waffles warm with Maple bacon and drizzled with extra maple syrup."}],"hintsAndTricks":["Please refer to the Gluten free flour mix recipe on this recipe chip.","To make your own Gluten free baking powder, please refer to the recipe on this recipe chip."],"basicInfo":["easy","40m","1h","4 portions"]}