{"badges":["TM5","TM6"],"usefulItems":"1 plate, baking paper, baking tray (30 x 40 cm), paper towel, bowl, small jug, springform cake tin (22 cm), silicone bread mat, rolling pin, oven, oven grill","id":"r114215","imageLink":"https:\/\/4.bp.blogspot.com\/-GLyPFU9qhME\/XZanHqHUG3I\/AAAAAAAAg6Y\/GtmWMUb8uLgUM5b4EvoDRvJ9ydYjZIEuACLcBGAsYHQ\/s1600\/0_2nlIa4X3tfkOFX33.png","title":"Bacon and cinnamon scrolls with salted maple glaze","publishedAt":"2017-01-22T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Filling"},{"content":"8 bacon rashers, streaky (approx. 240 g)"},{"content":"50 g unsalted butter, chilled and cut into cubes (2 cm)"},{"content":"1 tbsp ground cinnamon"},{"content":"50 g raw sugar"},{"isHeader":true,"content":"Dough"},{"content":"150 g full cream milk"},{"content":"90 g unsalted butter, chilled and cut into cubes (2 cm), plus extra for greasing"},{"content":"300 g plain flour"},{"content":"2 tsp baking powder"},{"content":"50 g raw sugar"},{"content":"1 pinch salt"},{"isHeader":true,"content":"Salted maple glaze"},{"content":"30 g unsalted butter"},{"content":"50 g pure maple syrup"},{"content":"60 g icing sugar"},{"content":"1 tbsp water"},{"content":"¼ tsp sea salt flakes, plus extra for garnishing"}],"nutrition":{"protein":"9.4 g","fat":"20.5 g","uom":"per 1 portions","carbohydrates":"53.2 g","calories":"1813 kJ \/ 431 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Filling"},{"content":"Position oven rack to top shelf in oven. Preheat oven to 190°C (grill setting) and line a baking tray (30 x 40 cm) with baking paper. Line a plate with paper towel and set aside."},{"content":"Place bacon onto prepared baking tray and grill for 5 minutes. Transfer onto lined plate to absorb excess oil. Heat oven to 190°C (oven setting)."},{"content":"Place butter, cinnamon and sugar into mixing bowl and mix <b>15 sec\/speed 4<b>. Transfer into a bowl and set aside. Do not clean mixing bowl."},{"isHeader":true,"content":"Dough"},{"content":"Place a small jug or bowl onto mixing bowl lid and weigh milk into it, then set aside."},{"content":"Grease a round springform cake tin (22 cm) and set aside."},{"content":"Place flour, baking powder and butter into mixing bowl and mix <b>5 sec\/speed 5<b>, until mixture resembles breadcrumbs."},{"content":"Add sugar and salt and knead <b>1 min\/<b>, gradually pouring milk through hole in mixing bowl lid until a soft dough forms."},{"content":"Transfer dough onto a lightly floured silicone bread mat or work surface and roll out into a rectangle (approx. 20 x 35 cm). Sprinkle reserved butter mixture evenly over dough."},{"content":"With the long edge of the pastry closest to you, place bacon pieces vertically over filling, leaving a finger width gap between each piece, allowing bacon to slightly overhang the top edge (so you can see where the pieces are as you roll the scroll)."},{"content":"Rolling up from the long edge, roll dough into a long sausage shape. Cut dough into 8 scrolls, cutting in the gaps between the bacon."},{"content":"Place scrolls into prepared cake tin and bake for 25-30 minutes (190°C), or until golden brown. Clean and dry mixing bowl."},{"isHeader":true,"content":"Salted maple glaze"},{"content":"Place all glaze ingredients into mixing bowl and cook <b>2 min\/60°C\/speed 3<b>, then blend <b>10 sec\/speed 6<b>."},{"content":"Remove scrolls from oven and immediately pour three-quarters of the glaze over scrolls and sprinkle with extra salt flakes. Serve warm with extra glaze."}],"hintsAndTricks":["Cut dough into smaller pieces to make smaller, bite-sized scrolls."],"basicInfo":["medium","35m","1h 5m","8 portions"]}