{"badges":["TM5","TM6"],"usefulItems":"airtight container, cling wrap, parchment paper, rolling pin, wire rack, baking sheets (approx. 16 in. x 14 in.), cookie cutter (2 in.), refrigerator, oven","id":"r117572","imageLink":"https:\/\/4.bp.blogspot.com\/-VU30Bgdghlw\/XZWq14rCq7I\/AAAAAAAAfeI\/YyGPJmMMvVo_whzpwTRn3uhpd-zJxVPhACLcBGAsYHQ\/s1600\/0_WXf3l5oeAfEkIO2K.png","title":"Orange Currant Cookies","publishedAt":"2017-03-17T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"3 oz sugar"},{"content":"1 orange, organic, thin peel only, no pith, plus 1 tbsp juice"},{"content":"7 oz all-purpose flour, plus extra for dust"},{"content":"5 oz unsalted butter, very cold, cut into pieces"},{"content":"3 oz currants"},{"content":"1 egg yolk, from medium egg"},{"content":"all-purpose flour, to dust"}],"nutrition":{"protein":"0.9 g","fat":"4.4 g","uom":"per 1 piece","carbohydrates":"10.6 g","calories":"359 kJ \/ 86 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place sugar and orange peel into mixing bowl and zest <b>10 sec\/speed 10<b>. Scrape down sides and base of mixing bowl with spatula and zest a further <b>5 sec\/speed 8<b>."},{"content":"Add flour and butter and mix <b>Turbo\/1 sec\/4 times<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add currants, egg yolk and orange juice and mix <b>8 sec\/\/speed 4<b>. Tip dough out and bring together into a ball. Wrap in cling wrap and chill in refrigerator for 30 minutes. Meanwhile, preheat oven to 350°F and line two baking sheets with parchment paper."},{"content":"Divide chilled dough in half and roll each piece out on a lightly floured surface to ⅛ in. thickness. Cut out rounds using a fluted cookie cutter (2½ in.) and transfer to baking sheets. Reroll the trimmings and repeat until all dough is used."},{"content":"Bake 10-15 minutes (350°F) until lightly golden. Allow to rest on baking sheets for 5 minutes before transferring to a wire rack to cool completely. Serve or store in an airtight container."}],"basicInfo":["easy","20m","1h","28 pieces"]}