{"badges":["TM5","TM6"],"usefulItems":"parchment paper, airtight container, rolling pin, wire rack, baking sheets (approx. 16 in. x 14 in.), cookie cutter (2 in.), oven","id":"r117575","imageLink":"https:\/\/2.bp.blogspot.com\/-d-J1wBcuyTw\/XZWrFY1jTfI\/AAAAAAAAfh0\/RFCGtNyDAd0-9fiROby-A7OebbnO4VZrACLcBGAsYHQ\/s1600\/0_bmmWwQUx4Kyfh9wl.png","title":"Honey and Oat Grahams","publishedAt":"2017-03-17T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"3 ½ oz whole wheat flour, plus extra to dust"},{"content":"3 ½ oz quick oats"},{"content":"2 tsp light brown sugar"},{"content":"½ tsp fine sea salt"},{"content":"½ tsp baking soda"},{"content":"2 ½ oz unsalted butter, in pieces and frozen"},{"content":"1 tsp lemon juice"},{"content":"1 oz whole milk"},{"content":"3 ½ oz honey"}],"nutrition":{"protein":"0.9 g","fat":"2.8 g","uom":"per 1 piece","carbohydrates":"8 g","calories":"256 kJ \/ 61 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 400°F and line two baking sheets (approx. 16 in. x 14 in.) with parchment."},{"content":"Place flour, oats, sugar, salt and baking soda into mixing bowl and mix <b>10 sec\/speed 5<b>."},{"content":"Add butter and mix <b>5 sec\/speed 5<b>."},{"content":"Add lemon juice, milk and honey and mix <b>10 sec\/speed 6<b>. Tip dough out and bring together. On a generously floured work surface, roll out dough to ¼ in. thickness. Cut out dough with a round cookie cutter (2 in.) and place on prepared baking sheets."},{"content":"Bake for 12-15 minutes (400°F) until golden. Allow to rest on baking sheets for 5 minutes before transferring to a wire rack to cool completely. Serve or store in an airtight container for 3-5 days."}],"hintsAndTricks":["For a sweet version add icing. Use 1 tbsp lemon juice, 7 oz confectioners sugar and 1 oz water. Place all ingredients into mixing bowl and mix <b>15 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula and mix a further <b>5 sec\/speed 4<b>. Use an icing spatula to cover each cookie. Allow to dry on a cooling rack.","Spread cookies with Nutella, peanut butter, jelly, or sliced banana."],"basicInfo":["medium","15m","35m","26 pieces"]}