{"badges":["TM5","TM6"],"usefulItems":"silicone bread mat, plastic wrap, pasta machine, large saucepan, stove top","id":"r118211","imageLink":"https:\/\/3.bp.blogspot.com\/-fg7RFWT__Pw\/XZMy8xaiP9I\/AAAAAAAAarg\/5i6lakc_N2A_U2qZGguOuv9KPcVwK1oegCLcBGAsYHQ\/s1600\/0_RbsmGydEWvT-Sqzy.png","title":"Pasta","publishedAt":"2016-10-16T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"150 g lupin flour"},{"content":"70 g gluten free cornflour, plus extra for dusting"},{"content":"1 ½ tsp xanthan gum"},{"content":"1 pinch ground nutmeg"},{"content":"2 tsp salt"},{"content":"2 eggs"},{"content":"60 g water, plus extra for boiling"}],"nutrition":{"protein":"20.1 g","fat":"5.1 g","uom":"per 1 portion","carbohydrates":"20.1 g","calories":"981 kJ \/ 233 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place lupin, cornflour, xanthan gum, nutmeg and 1 teaspoon of the salt into mixing bowl and mix <b>5 sec\/speed 4<b>."},{"content":"Add eggs and water and knead <b>2 min\/<b>. Transfer dough onto a silicone bread mat or lightly floured work surface and shape into a ball. Wrap dough in silicone bread mat or plastic wrap and set aside for a minimum of 10 minutes."},{"content":"Divide dough into 4 even pieces and use a pasta machine to roll out (see Tips). Cut into required shapes and lengths. Use cornflour to dust dough as necessary if it becomes sticky."},{"content":"Place a large saucepan over high heat. Place water (approx. 3L) and remaining 1 teaspoon salt into saucepan and bring to the boil. Working in batches, add pasta into saucepan and cook for 4-5 minutes, or until al dente. Use simmering basket to drain pasta. Serve immediately with your favourite sauce. "}],"hintsAndTricks":["You can buy lupin flour at specialty food stores, health food stores or online.","If you do not have a pasta machine, pasta can be rolled out thinly and cut by hand.","If using a pasta machine, gluten free pasta should not be rolled any thinner than setting NO. 4 on your pasta machine."],"basicInfo":["easy","30m","50m","4 portions"]}