{"badges":["TM5","TM6"],"usefulItems":"non-stick frying pan, 4 egg rings, thermal serving bowl or other large bowl, stove top","id":"r118151","imageLink":"https:\/\/1.bp.blogspot.com\/-jTC3VMVXGsA\/XZavLoZbiKI\/AAAAAAAAhso\/ClU9S_TXpusYWFiPl_AfC_1AQi8vV9GgACLcBGAsYHQ\/s1600\/0_vRip2gHXWiSF3bxi.png","title":"Wholemeal crumpets","publishedAt":"2017-01-22T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"120 g baker's flour"},{"content":"1 tsp raw sugar"},{"content":"1 tsp dried instant yeast"},{"content":"300 g buttermilk"},{"content":"250 g wholemeal flour"},{"content":"200 g lukewarm water"},{"content":"1 egg"},{"content":"1 pinch salt"},{"content":"butter, for frying"},{"content":"oil, for greasing"}],"nutrition":{"protein":"4 g","fat":"1.9 g","uom":"per 1 portion","carbohydrates":"16.9 g","calories":"442 kJ \/ 105 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place baker's flour, sugar, yeast and buttermilk into mixing bowl and mix <b>5 min\/37°C\/speed 2<b>, or until mixture becomes slightly frothy."},{"content":"Add wholemeal flour, water, egg and salt and mix <b>5 sec\/speed 7<b>."},{"content":"Scrape down sides of mixing bowl with spatula and mix <b>3 min\/37°C\/speed 1<b>. Allow mixture to prove (in mixing bowl or another bowl) for 1 hour."},{"content":"Place a frying pan over medium-high heat and add butter. Grease 4 egg rings with oil and place into frying pan for 1 minute to warm. Fill each egg ring three-quarters full with batter. Reduce heat to medium and cook for 5 minutes, or until surface is dry to the touch (see Tips). Remove rings with tongs, then flip crumpet over and cook for a further 3 minutes (adjust heat as necessary to ensure cooking is slow and even). Transfer into a thermal serving bowl or other large bowl and cover to keep warm. Working in batches, add more butter to pan, re-grease egg rings and repeat with remaining batter (makes 16 crumpets total)."},{"content":"Serve warm with your choice of topping, or allow to cool and toast before serving."}],"hintsAndTricks":["Serve with <em>Green fig and lime marmalade<\/em> (refer to the recipe on this recipe chip).","Buttermilk can be replaced with full cream milk in this recipe.","Homemade crumpets have fewer holes than commercial crumpets. Poke extra holes in crumpet with a skewer, if desired.","Once cool, crumpets can be layered between baking paper and stored in the freezer for 1 month."],"basicInfo":["easy","40m","1h 40m","16 portions"]}