{"badges":["TM5","TM6"],"usefulItems":"nut milk bag or muslin cloth, small bowl , large bowl, baking tray (30 x 40 cm), plastic wrap, nut milk bag or muslin cloth, sealable container, serving platter, paper towel, refrigerator","id":"r119243","imageLink":"https:\/\/3.bp.blogspot.com\/-Rjl8k1eyeaE\/XZMvHOxwDyI\/AAAAAAAAaNw\/-2aBeABQXMsZ-nTKKbIMu-G_RnBVhYpNACLcBGAsYHQ\/s1600\/0_ZAYyJlvUzB7k4wCp.png","title":"Ruby kingfish with citrus yoghurt dressing","publishedAt":"2017-01-22T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Cure"},{"content":"150 g rock salt"},{"content":"50 g white sugar"},{"content":"1 tsp Sichuan peppercorns (see Tips)"},{"content":"1 tsp fennel seeds"},{"content":"2 limes, zest only, no white pith"},{"content":"1 ruby grapefruit, juice and zest, no white pith"},{"content":"600 g fresh boneless, skinless kingfish fillets"},{"isHeader":true,"content":"Citrus yoghurt"},{"content":"300 g Greek yoghurt"},{"content":"20 g lime juice (approx. 1 lime)"},{"isHeader":true,"content":"Dressing"},{"content":"30 g white wine vinegar"},{"content":"60 g extra virgin olive oil"},{"isHeader":true,"content":"Assembly"},{"content":"½ ruby grapefruit, peeled and segmented"},{"content":"3 radishes, cut into thin slices"},{"content":"micro herbs, for garnishing"}],"nutrition":{"protein":"17.7 g","fat":"12.1 g","uom":"per 1 portions","carbohydrates":"11 g","calories":"955 kJ \/ 227 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Cure"},{"content":"Place salt, sugar, peppercorns, fennel seeds, lime and grapefruit zest into mixing bowl and mill <b>8 sec\/speed 8<b>, or until a fine salt forms."},{"content":"Add half of the grapefruit juice and blend <b>10 sec\/speed 3<b>."},{"content":"Place a 40 cm piece of plastic wrap onto a large baking tray (30 x 40 cm), then spread half of the cure over plastic wrap. Place fish fillets onto cure and top with remaining cure. Tightly wrap fillets in the plastic wrap and place into refrigerator for 45 minutes-2 hours. Clean and dry mixing bowl."},{"content":"Once fillets have cured (they will appear opaque and feel firm to the touch), rinse under cold water and pat dry with paper towel. Transfer into a sealable container and place into refrigerator."},{"isHeader":true,"content":"Citrus yoghurt"},{"content":"Line simmering basket with a nut milk bag or 2 layers of muslin cloth and set over a large jug or bowl, then place onto mixing bowl lid and weigh yoghurt into simmering basket. Place into refrigerator to drain for a minimum of 2 hours. Yoghurt will have a soft, yet dense texture (yoghurt can be gently squeezed through nut milk bag or muslin to save time)."},{"content":"Transfer yoghurt into a small bowl and stir in lime juice and remaining grapefruit juice. Cover with plastic wrap and place into refrigerator until ready to use."},{"isHeader":true,"content":"Dressing"},{"content":"Place vinegar and oil into mixing bowl and mix <b>20 sec\/speed 8<b>."},{"isHeader":true,"content":"Assembly"},{"content":"Cut fish fillets into thin slices, arrange on a serving platter and drizzle with dressing. Place spoonfuls of Citrus yoghurt over fish. Arrange grapefruit segments on platter and garnish with radishes and micro herbs before serving."}],"hintsAndTricks":["You can replace the Sichuan peppercorns with black peppercorns.","You can replace the ruby grapefruit with blood oranges or oranges.","Curing times will vary depending on the size and thickness of your kingfish fillets. If you are unable to find kingfish, substitute with other white fish, such as trevally or dory.","Cured fillets will last in a sealable container in the refrigerator for up to 1 day."],"basicInfo":["easy","30m","2h 30m","8 portions"]}