{"badges":["TM5","TM6"],"usefulItems":"bowl, springform cake tin (20 cm), baking paper, serving plates, serving platter, piping bag (thin nozzle), refrigerator, oven","id":"r120332","imageLink":"https:\/\/3.bp.blogspot.com\/-oIzAI2ue5lM\/XZWqyyB4AoI\/AAAAAAAAfdg\/V4lg0KlrrnoVoRk3uCf8WoPYKVsIUs1XwCLcBGAsYHQ\/s1600\/0_VJEmfZ5XzDL5tIpi.png","title":"Citrus and spice spider web cheesecake","publishedAt":"2016-10-16T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Cheesecake"},{"content":"150 g pumpkin, peeled and cut into pieces (3-4 cm)"},{"content":"70 g water"},{"content":"60 g unsalted butter, cut into pieces, plus extra for greasing"},{"content":"1 orange, zest (no white pith) and juice"},{"content":"150 g Granita biscuits"},{"content":"300 g cream cheese, softened"},{"content":"70 g caster sugar"},{"content":"2 eggs"},{"content":"1 tsp ground cinnamon"},{"content":"1 pinch grated nutmeg"},{"content":"1 tsp natural vanilla extract"},{"isHeader":true,"content":"Spider web"},{"content":"50 g dark chocolate, broken into pieces"}],"nutrition":{"protein":"7.5 g","fat":"26.7 g","uom":"per 1 portion","carbohydrates":"26.4 g","calories":"1567 kJ \/ 373 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Cheesecake"},{"content":"Place pumpkin and water into mixing bowl and cook <b>10 min\/100°C\/speed 2<b>."},{"content":"Scrape down sides of mixing bowl with spatula, then blend <b>10 sec\/speed 4<b>, or until smooth. Transfer into a bowl and set aside. Clean and dry mixing bowl."},{"content":"Grease and line a springform cake tin (20 cm) with baking paper and set aside."},{"content":"Place orange zest into mixing bowl and grate <b>10 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add biscuits and mill <b>10 sec\/speed 7<b>. Transfer into a bowl and set aside."},{"content":"Place butter into mixing bowl and melt <b>2 min\/50°C\/speed 2<b>."},{"content":"Add reserved biscuit mixture and mix <b>10 sec\/speed 2<b>. Transfer into prepared cake tin and press evenly into base. Place into refrigerator to set (approx. 10 minutes). Clean and dry mixing bowl."},{"content":"Preheat oven to 160°C."},{"content":"Place cream cheese and sugar into mixing bowl and mix <b>10 sec\/speed 3<b>. Scrape down sides and bottom of mixing bowl with spatula."},{"content":"Add eggs, orange juice, reserved pumpkin purée, cinnamon, nutmeg and vanilla and mix <b>1 min\/speed 4<b>, or until well combined. Transfer into cake tin and bake for 35-40 minutes (160°C), until firm but with a slight wobble in the centre. Turn off oven and open door to let cheesecake cool (approx. 1 hour). Place into refrigerator for a minimum of 4 hours. Clean and dry mixing bowl."},{"isHeader":true,"content":"Spider web"},{"content":"Place chocolate into mixing bowl and grate <b>5 sec\/speed 10<b>."},{"content":"Scrape down sides of mixing bowl with spatula then melt <b>1 min 30 sec\/50°C\/speed 1<b>. Transfer melted chocolate into a piping bag with a thin nozzle. Remove cake from tin and transfer onto a serving plate. Decorate cake with chocolate into a spider web pattern. Place into refrigerator until ready to serve."}],"basicInfo":["medium","15m","6h 10m","8 portions"]}