{"badges":["TM5","TM6"],"usefulItems":"bowl, ceramic or glass bowl, fine mesh sieve, paper towel, ceramic baking dish (12 cm)","id":"r121077","imageLink":"https:\/\/4.bp.blogspot.com\/-FsP2JbjIT2Q\/XZMyZmRPoDI\/AAAAAAAAakY\/ZmZp69lyeMU9qE7gvACporS2oE2rT08-QCLcBGAsYHQ\/s1600\/0_C8dIgODMYyMLKYId.png","title":"Pittu","publishedAt":"2016-07-17T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"120 g shredded coconut"},{"content":"500 g water, plus extra for soaking"},{"content":"250 g basmati rice"},{"content":"butter, for greasing"},{"content":"½ - 1 tsp salt"}],"nutrition":{"protein":"5.9 g","fat":"20.9 g","uom":"per 1 portions","carbohydrates":"51.6 g","calories":"1798 kJ \/ 428 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place coconut into mixing bowl and chop <b>5 sec\/speed 5<b>. Transfer into a bowl and cover with water. Set aside to soak for 2 hours. While coconut soaks, continue with step 2."},{"content":"Place a ceramic or glass bowl onto mixing bowl lid and weigh rice into it. Cover with water and set aside to soak for 2 hours (see Tips)."},{"content":"Using a fine mesh sieve, drain coconut and discard water. Transfer coconut into a bowl and set aside. Using simmering basket, drain rice and pat dry with paper towel."},{"content":"Grease a small ceramic baking dish (12 cm) with butter and set aside. Place rice into mixing bowl and mill <b>20 sec\/speed 10<b>, or until a fine powder consistency."},{"content":"Scrape down sides and bottom of mixing bowl with spatula, then roast <b>5 min\/Varoma\/speed 2<b>. Transfer into a bowl and set aside to cool (approx. 30 minutes). Clean and dry mixing bowl."},{"content":"Place reserved rice flour, salt and 250 g of the coconut (see Tips) into mixing bowl and mix <b>20 sec\/speed 6<b>, slowly adding 3 tablespoons of water as needed through hole in mixing bowl lid, until mixture forms small clumps and resembles coarse breadcrumbs. Transfer mixture into prepared ramekin, pushing down gently (do not compress mixture too much as it will become too compact and steam will not circulate)."},{"content":"Place 500 g water into mixing bowl and place Varoma dish into position, then place ramekin into it. Secure Varoma lid and steam <b>15 min\/Varoma\/speed 2<b>, or until tender. Serve pittu warm with your favourite Sri Lankan dishes. "}],"hintsAndTricks":["The rice needs to be soaked for a minimum of 1 hour; a longer soaking time yields a softer flour.","To save time, use store-bought rice flour and omit steps 2-4 (continue to drain coconut) and proceed as per recipe.","Use leftover coconut in curries or add to muesli or oatmeal.","You can cut pittu into diamond shapes to serve smaller portions or when plating for dinner parties."],"basicInfo":["easy","10m","3h","4 portions"]}