{"badges":["TM5","TM6"],"usefulItems":"12-hole muffin tray, 12 cupcake liners, wooden skewer, wire rack, piping bag with round nozzle (1 cm), oven","id":"r122155","imageLink":"https:\/\/3.bp.blogspot.com\/-EcUV7c83zpg\/XZWr53fX-YI\/AAAAAAAAfuw\/-yJeBOrdMmUP8ecoE6ZGjW433NjwcfX9QCLcBGAsYHQ\/s1600\/0_yYCuhKF_Q7PtGjUD.png","title":"Banana cupcakes with peanut butter frosting","publishedAt":"2017-04-02T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Banana cupcakes"},{"content":"60 g raw almonds"},{"content":"170 g ripe banana, broken into pieces"},{"content":"2 eggs"},{"content":"70 g freshly squeezed orange juice (see Tips)"},{"content":"80 g pure maple syrup (see Tips)"},{"content":"120 g extra virgin olive oil"},{"content":"190 g wholemeal self-raising flour"},{"content":"¼ tsp baking powder"},{"content":"½ tsp ground cinnamon"},{"isHeader":true,"content":"Peanut butter frosting"},{"content":"250 g cream cheese, cut into pieces (3-4 cm) and softened"},{"content":"90 g smooth peanut butter"},{"content":"1 ½ tbsp pure maple syrup (see Tips)"},{"content":"banana chips, for decorating (optional)"}],"nutrition":{"protein":"7.7 g","fat":"25.3 g","uom":"per 1 portion","carbohydrates":"20.6 g","calories":"1438 kJ \/ 342 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Banana cupcakes"},{"content":"Preheat oven to 160°C. Line a 12-hole muffin tray with paper cases and set aside."},{"content":"Place almonds into mixing bowl and mill <b>15 sec\/speed 9<b>, or until finely ground. Scrape down sides of mixing bowl with spatula."},{"content":"Add banana and mash <b>10 sec\/speed 4<b>."},{"content":"Add eggs, juice, syrup and oil and mix <b>10 sec\/speed 3<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add flour, baking powder and cinnamon and mix <b>8 sec\/speed 4<b>, or until combined."},{"content":"Divide mixture between paper cases and bake for 20-25 minutes (160°C), or until a skewer inserted into the centre of the cupcakes comes out clean. Allow to cool in tin for 5 minutes, then transfer onto a wire rack to cool completely. Clean and dry mixing bowl."},{"isHeader":true,"content":"Peanut butter frosting"},{"content":" <b>Insert butterfly whisk<b>. Place cream cheese and peanut butter into mixing bowl and mix <b>10 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add syrup and mix <b>10 sec\/speed 3<b>, or until well combined and smooth. <b>Remove butterfly whisk. <b> "},{"content":"Transfer icing into a piping bag with a round nozzle (see Tips). Pipe icing onto cooled cupcakes and decorate with banana chips (optional) before serving."}],"hintsAndTricks":["If you have no oranges on hand, you can use milk or almond milk instead of orange juice.","If you prefer, you can replace the maple syrup with brown sugar, Rapadura sugar (Panela) or coconut sugar. You can also replace the extra virgin olive oil with coconut oil.","<b>For the icing, you may need a fraction more or less syrup depending on the sweetness of your peanut butter. It’s preferable to use a brand of peanut butter with no added salt or sugar (or, better still, make your own). If your peanut butter does have added sugar, you might like to cut the syrup quantity by half. To make a thinner frosting, add 1-2 tbsp of milk when adding syrup in frosting.","If you prefer, you can spread the icing over the cupcakes with a small spatula, instead of piping it."],"basicInfo":["easy","15m","1h","12 portions"]}