{"badges":["TM5","TM6"],"usefulItems":"sealable storage jar or container, large bowl, silicone bread mat, plastic wrap, 2 baking trays (30 x 40 cm), refrigerator, oven","id":"r123160","imageLink":"https:\/\/4.bp.blogspot.com\/-3KCZesqtqbI\/XZWrGZD6isI\/AAAAAAAAfiE\/cW9vDSkO24YfurDcHMUb4vZU7gcFAYFDwCLcBGAsYHQ\/s1600\/0_c7kWuKNkZ1XBDqK4.png","title":"Strawberry chocolate calzones","publishedAt":"2017-04-02T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Hazelnut chocolate spread"},{"content":"150 g raw hazelnuts, skins on"},{"content":"40 g raw cacao powder"},{"content":"100 g pure maple syrup"},{"content":"100 g milk"},{"isHeader":true,"content":"Calzones"},{"content":"60 g olive oil, plus extra for greasing (see Tips)"},{"content":"200 g lukewarm water"},{"content":"1 tsp sugar"},{"content":"1 tsp dried instant yeast"},{"content":"150 g plain flour, plus extra for dusting"},{"content":"150 g wholemeal plain flour"},{"content":"1 tsp salt"},{"content":"16 - 24 strawberries (approx. 250 g), hulled and cut into slices"}],"nutrition":{"protein":"8.6 g","fat":"20.8 g","uom":"per 1 portions","carbohydrates":"37 g","calories":"1592 kJ \/ 379 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Hazelnut chocolate spread"},{"content":"Place hazelnuts into mixing bowl and mill <b>35 sec\/speed 9<b> or until finely ground. Scrape down sides of mixing bowl with spatula."},{"content":"Add all remaining hazelnut chocolate spread ingredients and blend <b>30 sec\/speed 4<b>."},{"content":"Scrape down sides of mixing bowl with spatula and blend <b>1 min\/speed 6<b> or until smooth. Transfer into a sealable jar or container and place into refrigerator until ready to use (spread will thicken slightly in refrigerator). Clean and dry mixing bowl."},{"isHeader":true,"content":"Calzones"},{"content":"Lightly grease a large bowl and set aside."},{"content":"Place water, sugar and yeast into mixing bowl and mix <b>20 sec\/speed 2<b>."},{"content":"Add flours, oil and salt and knead <b>2 min\/<b>. Transfer dough onto a lightly floured work surface or silicone bread mat and knead until dough is smooth and no longer sticky. Transfer into prepared bowl, cover with plastic wrap and set aside in a warm place to prove for 1 hour or until doubled in size."},{"content":"Preheat oven to 200°C. Lightly flour 2 large baking trays (30 x 40 cm) and set aside."},{"content":"Transfer dough onto a floured work surface or silicone bread mat and divide into 8 equal portions (approx. 60 g each). Roll each portion into an oval shape (approx. 16 x 13 cm). Spread 3 teaspoons of the reserved Hazelnut chocolate spread over half of each oval (to 1 cm from edge). Top with strawberry slices (approx. 2-3 strawberries per calzone). Fold over other half of calzone and press edges together, then twist edges to seal. Carefully transfer calzones onto prepared baking trays. Bake for 15 minutes (200°C), or until golden. Serve immediately."}],"hintsAndTricks":["You can use homemade <em>Hazelnut chocolate<\/em> <em>spread<\/em> (see pg. 184) or store-bought for this recipe. Homemade spread is the much healthier option, as commercial spreads tend to contain mainly sugar and refined vegetable oil.","I recommend using a lighter-flavoured extra virgin olive oil as it's much milder."],"basicInfo":["easy","35m","1h 55m","8 portions"]}