{"badges":["TM5","TM6"],"usefulItems":"bowl, large bowl, baking tray (30 x 40 cm), baking paper, large plate, oven","id":"r124902","imageLink":"https:\/\/1.bp.blogspot.com\/-Wr8FdeRsNko\/XZMy6Z-rS6I\/AAAAAAAAarA\/355HIDenBmIEG2aqyMlWLkmahJbGc7YrwCLcBGAsYHQ\/s1600\/0_QbZYiEHCLsCbdo84.png","title":"Baked rice croquettes","publishedAt":"2016-10-16T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"30 g Parmesan cheese, crust removed and cut into pieces (3 cm)"},{"content":"30 g eschalots"},{"content":"2 garlic cloves"},{"content":"30 g extra virgin olive oil, plus extra for drizzling"},{"content":"400 g arborio rice"},{"content":"800 g water"},{"content":"2 tsp salt, plus extra to season"},{"content":"½ tsp freshly ground black pepper, plus extra to season"},{"content":"1 tsp saffron"},{"content":"3 eggs"},{"content":"100 - 150 g breadcrumbs"},{"content":"50 g prosciutto, sliced and cut into pieces (1-2 cm)"},{"content":"100 g Emmental cheese, cut into cubes (1 cm) (see Tips)"}],"nutrition":{"protein":"24.2 g","fat":"21.1 g","uom":"per 1 portion","carbohydrates":"83.5 g","calories":"2643 kJ \/ 629 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place Parmesan cheese into mixing bowl and grate <b>5 sec\/speed 9<b>. Transfer into a bowl and set aside. Clean and dry mixing bowl."},{"content":"Place eschalots and garlic into mixing bowl and chop <b>5 sec\/speed 5<b>."},{"content":"Scrape down sides of mixing bowl with spatula. Add oil and cook <b>3 min\/Varoma\/speed 1<b>."},{"content":"Add rice and cook <b>3 min\/Varoma\/\/speed 1<b>, <b>without measuring cup<b>."},{"content":"Add water,  salt, pepper and saffron and mix with aid of spatula. Cook <b>14 min\/100°C\/\/speed 1<b>, placing simmering basket instead of measuring cup onto mixing bowl lid."},{"content":"Add reserved Parmesan cheese and mix with aid of spatula. Spread rice into a large shallow bowl and allow to cool (approx. 15 minutes)."},{"content":"Preheat oven to 180°C. Line a baking tray (30 x 40 cm) with baking paper and set aside."},{"content":"Crack eggs into a bowl and beat lightly with a fork, then set aside. Place a bowl onto mixing bowl lid and weigh breadcrumbs into it. Spread breadcrumbs onto a plate and season with salt and pepper, then set aside."},{"content":"Using damp hands, place 1 tablespoon of cooled risotto into the palm of your hand. Top with a small amount of prosciutto and a cube of cheese, then press risotto around them to enclose and form a ball. Flatten ball slightly and shape into a thick cylinder. Repeat with remaining risotto, prosciutto and cheese to make approx. 34 croquettes in total."},{"content":"Dip croquettes into egg wash, then transfer onto plate with breadcrumbs and coat completely. Place coated croquettes onto prepared baking tray and drizzle with extra oil. Bake for 10 minutes (180°C), then carefully turn croquettes over and cook for a further 10 minutes (180°C), until golden. Serve warm."}],"hintsAndTricks":["Emmental is a yellow Swiss cheese with a nutty flavour. You can find it at cheese stores, some delicatessens and some major supermarkets. You can replace Emmental with Swiss cheese or Gruyère."],"basicInfo":["medium","30m","1h 30m","5 portions"]}