{"badges":["TM5","TM6"],"usefulItems":"baking tray, greaseproof paper, lollipop sticks, refrigerator","id":"r124139","imageLink":"https:\/\/3.bp.blogspot.com\/-iSbCo4Lsu4k\/XZWd1t4nTJI\/AAAAAAAAeqw\/9p9UUpUx0eARy8p50DHyjBQBcz15oT7pgCLcBGAsYHQ\/s1600\/0_LcVSaoFw3eRpUjcm.png","title":"Chocolate Coated Banana Sticks","publishedAt":"2016-07-04T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"10 bananas, (small) ripe, peeled"},{"content":"1 Tbsp pistachio nuts, unsalted"},{"content":"1 Tbsp desiccated coconut"},{"content":"5 fresh raspberries"},{"content":"250 g white chocolate, small pieces or callets"},{"content":"180 g dark chocolate, 70% cocoa, small pieces or callets"}],"nutrition":{"protein":"2.5 g","fat":"8.6 g","uom":"per 1 piece","carbohydrates":"19.8 g","calories":"696 kJ \/ 166 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Line a baking tray with greaseproof paper then set aside."},{"content":"Cut bananas in half and push lollipop sticks halfway into each piece."},{"content":"Place pistachios in mixing bowl and chop <b>4 sec\/speed 7<b>. Transfer to a small bowl and set aside."},{"content":"Place coconut in a small bowl, then cut raspberries in small pieces and set aside in another bowl."},{"content":"Rinse and dry mixing bowl to remove any nuts then place white chocolate in mixing bowl. Grate <b>5 sec\/speed 8<b>. Scrape down sides of mixing bowl with spatula then melt <b>2 min\/50°C\/speed 0.5<b>. Scrape down sides of mixing bowl with spatula then melt again <b>1 min\/50°C\/speed 0.5<b>."},{"content":"Coat half the banana sticks in white chocolate by holding each one over mixing bowl and spooning chocolate onto it. Place chocolate covered bananas onto prepared tray then sprinkle with some of the reserved chopped pistachios, coconut and raspberries, as desired. Scrape any remaining white chocolate out of mixing bowl and discard."},{"content":"Place dark chocolate in mixing bowl and grate <b>5 sec\/speed 8<b>. Scrape down sides of mixing bowl with spatula then melt <b>2 min\/50°C\/speed 0.5<b>. Scrape down sides of mixing bowl with spatula then melt again <b>1 min\/50°C\/speed 0.5<b>."},{"content":"Coat remaining banana sticks with dark chocolate by holding each one over mixing bowl and spooning chocolate onto it. Place chocolate covered bananas onto prepared tray then sprinkle with remaining chopped pistachios, coconut and raspberries."},{"content":"Place in fridge for at least 20 minutes to set, then serve when desired."}],"basicInfo":["easy","30m","1h","20 pieces"]}