{"badges":["TM5","TM6"],"usefulItems":"thermal serving bowl or other large bowl, jug, serving bowls","id":"r124891","imageLink":"https:\/\/4.bp.blogspot.com\/-NDfsnOhlhIs\/XZMyj5mrsZI\/AAAAAAAAamg\/kBPfgLGk1Vs_HkUVtbRc4dAXYk7TObYqwCLcBGAsYHQ\/s1600\/0_H1vXz-SU9ipWtcYW.png","title":"Asparagus and pipis (clams) risotto","publishedAt":"2016-10-16T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"10 sprigs fresh flat-leaf parsley, leaves only"},{"content":"1000 g water"},{"content":"1000 g pipis (clams), purged (see Tips)"},{"content":"250 g green asparagus, trimmed (approx. 2 bunches)"},{"content":"40 g brown onion"},{"content":"30 g extra virgin olive oil"},{"content":"320 g arborio rice"},{"content":"100 g dry white wine"},{"content":"1 - 2 tsp salt, to taste"},{"content":"¼ tsp freshly ground black pepper, to taste"},{"content":"lemon juice, to serve (optional)"}],"nutrition":{"protein":"46.5 g","fat":"13.7 g","uom":"per 1 portion","carbohydrates":"76.4 g","calories":"2629 kJ \/ 626 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place parsley into mixing bowl and chop <b>3 sec\/speed 8<b>. Transfer into a thermal serving bowl or other large bowl and set aside."},{"content":"Place 500 g of the water into the mixing bowl. Place Varoma dish into position and weigh pipis (clams) into it. Place Varoma tray into position and weigh asparagus onto it. Secure Varoma lid and cook <b>10 min\/Varoma\/speed 1<b>. Set Varoma aside, then strain cooking liquid into a jug and set aside. Clean and dry mixing bowl."},{"content":"Place onion into mixing bowl and chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add oil and cook <b>3 min\/Varoma\/speed 1<b>."},{"content":"Add rice and cook <b>3 min\/Varoma\/\/speed 1<b> <b>,<b> <b>without measuring cup<b>."},{"content":"Add wine and deglaze <b>1 min\/100°C\/\/speed 1<b> <b>,<b> <b>without measuring cup<b>."},{"content":"Add 200 g of the reserved cooking liquid, salt, pepper and remaining 500 g water. Mix with aid of spatula, then cook <b>14 min\/100°C\/\/speed 1<b>, placing simmering basket instead of measuring cup onto mixing bowl lid."},{"content":"Remove pipis (clams) from shells and place into thermal serving bowl with parsley, setting aside a couple of shells to use for garnishing. Cut asparagus tips from stalks, then cut stalks into rounds (approx. 1 cm). Place tips and stalks into the bowl with pipis (clams) and cover to keep warm."},{"content":"Transfer risotto into bowl with asparagus and pipis (clams) and stir with aid of spatula until well combined. Cover and allow risotto to rest for 1 minute, then garnish with reserved shells then transfer into serving bowls and serve with a squeeze of lemon juice (optional)."}],"hintsAndTricks":["Pipis (clams) need to be purged of sand and grit before cooking. To purge them, place pipis (clams) into a large steel or ceramic bowl and completely cover with cold water. Add 2 teaspoons of salt and allow to soak for 30 minutes to 1 hour, then drain. Be sure to check with your fishmonger when purchasing, as they may have been purged already.","You can replace the salt with Vegetable stock paste in this recipe. Please refer to <em>The Basic Cookbook<\/em> or <em>Everyday Cookbook<\/em> for the Vegetable stock paste recipe.<em><br><\/em>"],"basicInfo":["easy","15m","1h 30m","4 portions"]}