{"badges":["TM5","TM6"],"usefulItems":"pie dish (22 cm), silicone bread mat, baking paper, rolling pin, pie weights, rice or dried beans, baking tray (30 x 40 cm), oven, refrigerator","id":"r125879","imageLink":"https:\/\/2.bp.blogspot.com\/-hsdSnc1Ru7c\/XZWqTYrgDBI\/AAAAAAAAfV8\/dKnYg0bUACw7B7wJIax02J1da-gUKb78ACLcBGAsYHQ\/s1600\/0_IRGCoXKL3k1COz1p.png","title":"Gluten-free goodness pastry","publishedAt":"2017-04-02T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"130 g butter, chilled and cut into pieces (3 cm), plus extra for greasing"},{"content":"2 tbsp millet flour"},{"content":"150 g potato flour, plus extra for dusting"},{"content":"90 g brown rice flour"},{"content":"2 tbsp white chia seeds"},{"content":"1 egg"},{"content":"1 ½ tbsp cold water"}],"nutrition":{"protein":"31.2 g","fat":"130.1 g","uom":"per 1 total recipe","carbohydrates":"94.7 g","calories":"7116 kJ \/ 1694 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 160°C. Grease a pie dish (22 cm) or loose-bottom tart tin (22 cm) and set aside."},{"content":"Place flours, chia seeds and butter into mixing bowl and mill <b>10 sec\/speed 6<b>, until mixture resembles breadcrumbs."},{"content":"Add egg and water and knead <b>15 sec\/<b>, until mixture just comes together."},{"content":"Transfer pastry onto a silicone bread mat or lightly floured work surface. Gently knead into a ball (the dough will be soft, but there is no need to add additional flour). Flatten into a thick disc, wrap in baking paper and place into refrigerator for 15-20 minutes."},{"content":"Transfer pastry onto a lightly floured silicone bread mat or piece of lightly floured baking paper. Using a rolling pin, roll out pastry (2-3 mm thickness). Drape pastry over rolling pin, gently removing baking paper and ease pastry into dish. Gently press pastry into sides and press to repair any splits in pastry. Trim overhanging edges with a knife. Place dish into refrigerator for 10 minutes to firm."},{"content":"Line pastry with baking paper and fill with pie weights, rice or dried beans. Place dish onto a baking tray and bake for 10-15 minutes (160°C). Remove baking paper and weights. Bake for a further 10 minutes(160°C) or until lightly golden. Set aside to cool completely, and fill as needed."}],"hintsAndTricks":["To make your own millet flour, place 250 g millet into mixing bowl and mill <b>2 min\/speed 10<b>. Use as needed.","This should be a soft pastry.","Take care not to overcook as pastry will dry and split.","Pie dish can be substituted for 6-8 smaller individual tart tins."],"basicInfo":["medium","20m","1h","1 total recipe"]}