{"badges":["TM5","TM6"],"usefulItems":"kitchen string","id":"r126936","imageLink":"https:\/\/3.bp.blogspot.com\/-GfqlVfyoNbA\/XZQHE4EVSAI\/AAAAAAAAcFA\/isT0yhVmle8ikX5yTsLtS5jY2QWsCuJQACLcBGAsYHQ\/s1600\/0_cUROUtwkoQHLyKZ1.png","title":"Chicken casserole with saffron and orange","publishedAt":"2017-08-08T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"1 orange, preferably organic, zest and juice only"},{"content":"1 tsp ground coriander"},{"content":"1 pinch freshly ground black pepper"},{"content":"1 pinch ground ginger"},{"content":"650 g chicken (1 whole chicken, see tip)"},{"content":"200 g courgettes, cut into slices"},{"content":"1 tsp fine salt"},{"content":"150 g onions, cut into pieces"},{"content":"1 garlic clove"},{"content":"30 g extra virgin olive oil"},{"content":"100 g dry white wine"},{"content":"1 sachet saffron powder"},{"content":"200 g chicken stock"}],"nutrition":{"protein":"52 g","fat":"42.5 g","uom":"per 1 portion","carbohydrates":"17.3 g","calories":"2899 kJ \/ 693 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place orange zest, coriander, pepper and ginger into mixing bowl and chop <b>10 sec\/speed 8<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add orange juice and emulsify <b>5 sec\/speed 6<b>."},{"content":"Place the chicken in a container and baste with the prepared marinade. Leave in the refrigerator for 30 minutes. Turn once."},{"content":"Arrange the courgettes in the Varoma tray and season with salt. Set Varoma aside."},{"content":"Place onion and garlic into mixing bowl and chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add the olive oil and sauté <b>3 min\/120°C\/speed 1<b>."},{"content":"Tie chicken tightly with kitchen string. Place tied chicken above the mixing knife, add any remaining marinade, white wine, saffron dissolved in a little stock, salt and chicken stock. Cook <b>20 min\/Varoma\/speed <b>."},{"content":"Turn the chicken. Place the Varoma into position with the courgettes and continue to cook <b>15 min\/Varoma\/speed <b>."},{"content":"Set Varoma aside and keep warm. Remove the meat from the mixing bowl and keep warm (see tip). Reduce the sauce <b>10 min\/Varoma\/speed 1<b> without measuring cup."},{"content":"Cut the meat into portions and serve with steamed courgettes and the sauce."}],"hintsAndTricks":["The recipe is suitable for a chicken or cockerel of 650-800 g. It is also possible to cook chicken pieces in the mixing bowl instead of a whole chicken.","If preferred, cook other vegetables in the Varoma dish and tray while the chicken is cooking (potatoes, pumpkin, broccoli etc.). To add a Middle-Eastern touch, garnish with dried fruit (pine nuts, pistachios and almonds). Serve with basmati or pilaf rice.","For a crispy version of the chicken, broil in a hot oven under the grill while you finish cooking the sauce."],"basicInfo":["medium","10m","1h 35m","2 portions"]}