{"badges":["TM5","TM6"],"usefulItems":"baking paper, serving plate","id":"r126924","imageLink":"https:\/\/1.bp.blogspot.com\/-p58DxOeMMVI\/XZQFxayp-FI\/AAAAAAAAb2k\/nAOEVDbqoq0SSTHLCVJIAyFFItihJD2OACLcBGAsYHQ\/s1600\/0_AiGnaKXLTYKWdzEs.png","title":"Chicken breast with mushroom sauce and potatoes","publishedAt":"2017-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"500 g water"},{"content":"2 tsp fine salt"},{"content":"300 g potatoes, peeled and cut into pieces (3-4 cm)"},{"content":"2 chicken breast fillets, skinned (150-200 g each), cut into strips (1 cm)"},{"content":"½ lemon, preferably organic, grated zest and juice only"},{"content":"1 pinch freshly ground black pepper, plus extra to taste"},{"content":"50 g shallots"},{"content":"30 g extra virgin olive oil"},{"content":"150 g button mushrooms, sliced"},{"content":"30 g dry white wine"},{"content":"100 g soy cream"},{"content":"1 - 2 pinches ground nutmeg"}],"nutrition":{"protein":"53 g","fat":"30 g","uom":"per 1 portion","carbohydrates":"33 g","calories":"2535 kJ \/ 606 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place water and 1 teaspoon salt in the mixing bowl, place Varoma dish into position and arrange the potatoes inside. Insert tray and cover with a sheet of baking paper. Make sure that you do not cover the front slots. Arrange the slices of chicken inside."},{"content":"Season the chicken fillets with lemon juice, ½ teaspoon of salt and pepper, close the Varoma and steam <b>20 min\/Varoma\/speed 1<b>. Carefully remove Varoma lid and check that the chicken fillets and potatoes are cooked. If necessary, close the Varoma and extend the cooking time <b>10 min\/Varoma\/speed 1<b>."},{"content":" <b>Carefully<b> remove Varoma lid, turn upside-down and place Varoma dish on top. Set aside the chicken fillets and potatoes and keep warm. Empty and dry the mixing bowl."},{"content":"Place shallot into mixing bowl and chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add olive oil and sauté <b>2 min\/120°C\/speed 1<b>."},{"content":"Add 75 g mushrooms, white wine, soy cream and with the simmering basket in place of the measuring cup cook <b>5 min\/100°C\/speed 2<b>."},{"content":"Add remaining mushrooms, 1 heaped teaspoon grated lemon zest, nutmeg, ½ teaspoon of salt and pepper to taste and cook: <b>5 min\/Varoma\/\/speed 1<b>."},{"content":"Arrange the potatoes and chicken on a serving platter, add the mushroom sauce and serve."}],"basicInfo":["medium","15m","1h","2 portions"]}