{"badges":["TM5","TM6"],"usefulItems":"rectangular baking dish (32 cm x 20 cm x 5 cm), baking paper, rolling pin, bowl, cling film, silicone mat, refrigerator, oven","id":"r127596","imageLink":"https:\/\/2.bp.blogspot.com\/-nRd9whwbKzM\/XZWq7k-gWOI\/AAAAAAAAffk\/5aoRvwZJ3joBJAkA7uXT28sFPooCu3dewCLcBGAsYHQ\/s1600\/0_Yi7KjO3PvuTJ23fM.png","title":"Apple crumble meringue slice","publishedAt":"2017-08-08T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Shortcrust pastry"},{"content":"200 g unsalted butter, chilled and cut into pieces, plus extra for greasing"},{"content":"400 g plain flour"},{"content":"4 egg yolks"},{"content":"1 tsp baking powder"},{"content":"1 tsp natural vanilla extract"},{"content":"50 g icing sugar"},{"isHeader":true,"content":"Apple mixture"},{"content":"1500 g apples, peeled, cores removed and cut into quarters (approx. 1800 g before preparation)"},{"content":"½ tsp ground cinnamon, plus extra for dusting"},{"content":"40 g sugar"},{"isHeader":true,"content":"Meringue filling"},{"content":"4 egg whites"},{"content":"150 g icing sugar"}],"nutrition":{"protein":"6 g","fat":"17 g","uom":"per 1 portion","carbohydrates":"70 g","calories":"1940 kJ \/ 461 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Shortcrust pastry"},{"content":"Place butter, flour, egg yolks, baking powder, vanilla extract and icing sugar into mixing bowl and mix <b>30 sec\/speed 5<b>."},{"content":"Transfer dough onto a silicone mat or floured work surface and work into a ball. Divide pastry into 2 balls, the first ball weighing 500 g and any remaining dough forming the second. Wrap both balls of pastry in cling film, then place into the refrigerator for 30 minutes to rest."},{"content":"Preheat oven to 180°C. Grease and line a baking dish (32 x 20 x 5 cm) with baking paper and set aside."},{"content":"Roll out the first 500 g ball of pastry onto a silicone mat or floured work surface to cover the baking dish. Place pastry into the base of baking dish and prick all over with a fork. Bake pastry for 8 minutes (180°C), then set aside to cool. Clean and dry mixing bowl."},{"isHeader":true,"content":"Apple mixture"},{"content":"Place ½ of the apples into mixing bowl and chop <b>5 sec\/speed 5<b>. Transfer into a bowl and set aside."},{"content":"Place remaining apples into mixing bowl and chop <b>5 sec\/speed 5<b>."},{"content":"Add reserved chopped apples, cinnamon and sugar and cook <b>20 min\/80°C\/speed 2<b>. Drain apples through simmering basket and discard juice. Transfer apple mixture into a bowl and set aside. Thoroughly clean and dry mixing bowl."},{"isHeader":true,"content":"Meringue filling"},{"content":" <b>Insert butterfly whisk.<b> Place egg whites into mixing bowl and whip <b>4 min\/37°C\/speed 3.5<b>."},{"content":"With butterfly whisk still in place, mix <b>4 min 30 sec\/speed 3<b>, slowly adding icing sugar through hole in mixing bowl lid, 1 spoon at a time, until just combined."},{"content":"To assemble, transfer apple mixture over cooked pastry base and dust with extra cinnamon."},{"content":"Top with meringue mixture, spreading evenly over slice. Crumble remaining shortcrust pastry ball into pieces and sprinkle over the top of meringue. Bake for 20-25 minutes (180°C), or until lightly golden brown. Remove from oven and allow to cool completely."},{"content":"Once cooled, cut into pieces and serve."}],"hintsAndTricks":["Serve Apple crumble meringue slice with vanilla ice cream on the side."],"basicInfo":["medium","20m","2h","10 portions"]}