{"badges":["TM5","TM6"],"usefulItems":"tea towel, baking paper, baking tray, pastry brush, large bowl, bowl, non-stick frying pan, oven","id":"r129358","imageLink":"https:\/\/1.bp.blogspot.com\/-KU8Mj-uh24M\/XZQHqmtqt0I\/AAAAAAAAcKw\/OOQMrBTjAUABDUXJG9EDPeMgWsxuairwwCLcBGAsYHQ\/s1600\/0_ol6EFNsGOGGtoqnF.png","title":"Indian-style chicken burger","publishedAt":"2017-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Burger buns"},{"content":"50 g water"},{"content":"10 g fresh yeast"},{"content":"50 g milk"},{"content":"15 g sugar"},{"content":"250 g plain flour, plus extra for dusting"},{"content":"10 g curry powder"},{"content":"2 eggs"},{"content":"1 pinch fine salt"},{"content":"40 g butter, soft"},{"content":"1 tsp sesame seeds"},{"content":"1 tsp cumin seed"},{"isHeader":true,"content":"Chicken burgers"},{"content":"30 g cashew nuts, unsalted"},{"content":"400 g chicken breast fillets, skinless, cut into pieces (3 cm)"},{"content":"1 egg"},{"content":"1 tbsp curry powder"},{"content":"5 pinches fine salt, to taste"},{"content":"5 pinches freshly ground black pepper, to taste"},{"content":"50 g plain flour"},{"content":"1 garlic clove"},{"content":"10 sprigs fresh coriander"},{"content":"10 fresh mint leaves"},{"content":"80 g plain yoghurt"},{"content":"60 g cream cheese"},{"content":"20 g oil, for frying"},{"content":"200 g cucumber, thinly sliced (approx. ½ cucumber)"},{"content":"80 g red peppers, cut into thin strips"}],"nutrition":{"protein":"16.5 g","fat":"16.9 g","uom":"per 1 piece","carbohydrates":"39 g","calories":"1562 kJ \/ 373 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Burger buns"},{"content":"Place water, yeast, milk, sugar, flour, curry powder and 1 egg into mixing bowl and knead <b>5 min\/<b>."},{"content":"Add salt and butter and knead <b>2 min\/<b>. Transfer dough onto a previously floured work surface. Pull edges of dough towards the centre 3-4 times, roll it into a ball, place it in a large bowl, cover with a kitchen towel and allow to rise for 1-2 hours in a warm place until doubled in volume. Clean the mixing bowl."},{"content":"At the end of first proving, transfer dough to floured work surface and knock it back firmly with your hands to let the gas escape. Divide dough into 8 pieces, shape into balls and lay them out on a baking tray lined with baking paper, making sure there is approximately 5 cm between each one. Cover with a kitchen towel and allow to rise again for 1 hour."},{"content":"Preheat the oven to 210°C."},{"content":"At the end of the second proving, break remaining egg into a bowl and beat it with a fork. Brush buns with egg using a pastry brush. Sprinkle buns with sesame and cumin seeds and bake for 20-25 minutes (210°C). Take buns out of oven and allow to cool."},{"isHeader":true,"content":"Chicken burgers"},{"content":"Place cashew nuts into mixing bowl and chop <b>5 sec\/speed 5<b>."},{"content":"Add chicken breasts, egg, curry powder, 2 pinches of salt and 2 pinches of pepper and chop <b>30 sec\/speed 6<b>. With floured hands, divide mixture into 8 and shape into 8 chicken patties. Set aside."},{"content":"Place garlic, 4 sprigs of coriander and mint into mixing bowl and blend <b>5 sec\/speed 7<b>."},{"content":"Add yoghurt, cream cheese, remaining salt and pepper and blend <b>30 sec\/speed 5<b>."},{"content":"Heat oil in a non-stick frying pan and fry chicken burgers for a few minutes on each side until golden. Meanwhile, cut the buns in half."},{"content":"Spread yoghurt sauce on bottom half of bun, fill with a layer of cucumber, a chicken burger, then another layer of cucumber. Finally add peppers and remaining coriander. Put top half of bun on burgers and serve hot."}],"basicInfo":["medium","30m","4h","8 pieces"]}