{"badges":["TM5","TM6"],"usefulItems":"disposable gloves, deep frying pan, paper towels, hob","id":"r129422","imageLink":"https:\/\/4.bp.blogspot.com\/-gJ1kGeEDR50\/XZMuPbAb-4I\/AAAAAAAAaC8\/cyec9dOmrZM9kzRL_zeOit1Udr_zntZBACLcBGAsYHQ\/s1600\/0_EG_onp2DVNkiOYx_.png","title":"Breaded Cheese-Stuffed Jalapenos","publishedAt":"2017-09-11T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"12 fresh jalapeño chillies (8-10 cm), charred and peeled"},{"content":"100 g hard goat's cheese, cut in pieces"},{"content":"50 g cream cheese"},{"content":"2 large eggs, separated"},{"content":"1 pinch fine sea salt"},{"content":"300 g vegetable oil"}],"nutrition":{"protein":"4 g","fat":"8.5 g","uom":"per 1 piece","carbohydrates":"0.1 g","calories":"386 kJ \/ 92 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"With disposable gloves make a cut down the length of the jalapeño chillies and gently remove seeds, taking care not to break them. Set aside."},{"content":"Place goat's cheese in mixing bowl and chop <b>8 sec\/speed 6<b>."},{"content":"Add cream cheese and mix <b>10 sec\/speed 6<b>. Fill jalapeño chillies with cheese mixture. Close up the filled chillies, then set aside. Wash and dry mixing bowl."},{"content":" <b>Insert butterfly whisk.<b> Place egg whites and salt in mixing bowl then whisk <b>2 min\/speed 3.5<b>. Meanwhile, heat oil in a deep frying pan."},{"content":"Without measuring cup, mix <b>30 sec\/speed 3<b>, while adding egg yolks, one by one, through hole in mixing bowl lid. Transfer to a bowl, then dip each filled chilli in the mixture."},{"content":"Fry chillies in the hot oil until golden brown (approx. 5 minutes). Transfer to paper towels to drain, then serve warm."}],"hintsAndTricks":["A blowtorch can be used to char the jalapeños. Or, carefully char jalapeños over a naked flame on hob, using metal tongs, turning gradually. Once completely charred, place in a sealable food bag to steam. The skin can then be removed more easily.","Batter with breadcrumbs before frying."],"basicInfo":["medium","20m","30m","12 pieces"]}