{"badges":["TM5","TM6"],"usefulItems":"baking tray and baking paper, fine sieve, serving bowl, oven","id":"r130007","imageLink":"https:\/\/2.bp.blogspot.com\/-OIkHl5YVnmM\/XZMurVf5iQI\/AAAAAAAAaIY\/A2S4Nf9bm2kr5Zj1ujpIexHZgFXku97NwCLcBGAsYHQ\/s1600\/0_Ou80JCsSyzvcwj3R.png","title":"Quinoa Salad with Butternut Squash, Spinach and Pomegranate","publishedAt":"2017-01-02T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"400 g butternut squash, peeled, cut in pieces (5 cm)"},{"content":"3 Tbsp olive oil"},{"content":"1 ½ Tbsp honey"},{"content":"1 ½ tsp fine sea salt"},{"content":"30 g almonds"},{"content":"200 g quinoa"},{"content":"400 g water"},{"content":"2 pinches ground black pepper"},{"content":"50 g fresh baby spinach"},{"content":"30 g walnut oil"},{"content":"15 g lemon juice"},{"content":"2 spring onions, cut in pieces (3 cm)"},{"content":"2 sprigs fresh mint, leaves only"},{"content":"1 pomegranate, seeds only"}],"nutrition":{"protein":"6.4 g","fat":"24 g","uom":"per 1 portion","carbohydrates":"28.7 g","calories":"1489 kJ \/ 356 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 180°C and line a large baking tray with baking paper."},{"content":"Place butternut squash in mixing bowl and chop <b>5 sec\/speed 4.5<b>. Scrape down sides of mixing bowl with spatula then chop again <b>3 sec\/speed 4.5<b>. Spread out over prepared baking tray, drizzle with oil and 1 Tbsp honey then scatter 1 tsp salt over the top. Roast for 20-25 minutes (180°C) until golden brown. Meanwhile, rinse and dry mixing bowl and continue with recipe."},{"content":"Place almonds in mixing bowl and chop <b>1 min\/speed 6<b>. Transfer to a bowl and set aside."},{"content":"Place another bowl on mixing bowl lid and weigh in quinoa then rinse using a fine sieve."},{"content":"Place rinsed quinoa, water, ½ tsp salt and pepper in mixing bowl then cook <b>15 min\/100°C\/\/speed 1<b>. Meanwhile wash baby spinach and spin dry, then set aside."},{"content":"Transfer cooked quinoa to a large serving bowl and stir with spatula to separate grains. Leave to stand for 10 minutes. Meanwhile, prepare dressing."},{"content":"Place walnut oil, lemon juice, spring onions, mint and ½ Tbsp honey in mixing bowl then mix <b>5 sec\/speed 4.5<b>. Scrape down sides of mixing bowl with spatula then mix again <b>5 sec\/speed 4.5<b>. Pour dressing over quinoa and mix well."},{"content":"Stir in baby spinach, pomegranate seeds and chopped almonds. Season to taste then arrange roasted squash on top and serve."}],"hintsAndTricks":["Use other varieties of squash for different flavours, textures and colours."],"basicInfo":["easy","25m","45m","4 portions"]}