{"badges":["TM5","TM6"],"usefulItems":"baking paper, 3 sandwich cake tins (Ø 18 cm), cooling rack, wooden skewer, baking tray, icing bag and nozzle, oven","id":"r131080","imageLink":"https:\/\/4.bp.blogspot.com\/-VXg-jwXhLQ4\/XZWfEWm8p4I\/AAAAAAAAe-Q\/Yh2FX5JEIG4Ljly42-UZpRIsg6ZB6tdHACLcBGAsYHQ\/s1600\/0_n5nQ79qOnuZ89Jtc.png","title":"Tropical Fruit Orange Cake","publishedAt":"2016-08-22T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Orange Cakes"},{"content":"225 g butter, unsalted, softened, cut in pieces, plus extra for greasing"},{"content":"200 g caster sugar"},{"content":"1 tsp natural vanilla extract"},{"content":"1 tbsp orange peel, grated"},{"content":"4 eggs (53-63 g each)"},{"content":"225 g self-raising flour"},{"content":"1 pinch salt"},{"isHeader":true,"content":"Meringue Kisses"},{"content":"100 g caster sugar"},{"content":"2 egg whites"},{"content":"1 tsp"},{"isHeader":true,"content":"Mango Sauce"},{"content":"30 g caster sugar"},{"content":"100 g ripe mango, cut in pieces"},{"content":"30 g orange juice, freshly squeezed"},{"isHeader":true,"content":"Cream Cheese Filling and Topping"},{"content":"200 g caster sugar"},{"content":"100 g cream cheese"},{"content":"100 g butter, unsalted, softened, cut in pieces"},{"content":"1 tbsp orange peel, grated"},{"content":"1 kiwifruit, cut in slices, to serve"},{"content":"1 plum, cut in slices, to serve"}],"nutrition":{"protein":"6 g","fat":"28 g","uom":"per 1 slice","carbohydrates":"61 g","calories":"2172 kJ \/ 519 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Orange Cakes"},{"content":"Preheat oven to 180°C. Put an ovenproof-dish with water in the base of the oven, for example a loaf tin half filled with water. Grease 3 sandwich cake tins (Ø 18 cm), line the bases with baking paper and set aside."},{"content":"Place sugar, butter, vanilla extract and grated orange peel in mixing bowl then mix <b>1 min\/speed 4<b>."},{"content":" <b>Insert butterfly whisk<b> and whisk <b>2 min\/speed 4<b>."},{"content":"Add eggs, 40 g flour and salt then whisk <b>3 min\/speed 4<b>. Scrape down sides of mixing bowl using spatula."},{"content":"Add remaining 185 g flour and whisk <b>30 sec\/speed 4<b>. Divide cake batter between 3 prepared sandwich cake tins (approx. 240 g per tin, see tip). Place the 3 cake tins in the oven, 2 on the top rack and 1 on the middle rack and bake immediately for 18-20 minutes (180°C) until a wooden skewer inserted in centre comes out clean. About halfway through baking, rotate the cake from the middle rack to the top rack and move one from the top to the middle. Allow cakes to cool, approx. 5 minutes before removing from cake tins. Allow cakes to cool completely on a wire rack before filling. Meanwhile clean mixing bowl and butterfly whisk thoroughly, then continue with recipe."},{"isHeader":true,"content":"Meringue Kisses"},{"content":"Lower oven temperature to 100°C. Line a baking tray with baking paper and set aside."},{"content":"Place sugar in mixing bowl and grind <b>15 sec\/speed 10<b>. Transfer to a bowl and set aside."},{"content":" <b>Insert butterfly whisk<b>. Place egg whites in mixing bowl and whisk <b>2 min\/speed 3<b> or until stiff."},{"content":"Whisk again <b>1 min 30 sec\/speed 3<b>, while slowly adding reserved grated sugar through hole in mixing bowl lid. <b>Remove butterfly whisk<b>."},{"content":"Fit an icing bag with a small nozzle, or a large star nozzle and paint two stripes of orange food colouring on the inside of the icing bag."},{"content":"Spoon whisked egg whites into prepared icing bag then pipe small kisses on prepared baking tray and bake for 40 minutes (100°C). Allow kisses to cool completely. Meanwhile clean mixing bowl and continue with recipe."},{"isHeader":true,"content":"Mango Sauce"},{"content":"Place sugar, mango and orange juice then blend <b>1 min\/speed 10<b>. Transfer to a bowl and set aside."},{"isHeader":true,"content":"Cream Cheese Filling and Topping"},{"content":"Without cleaning mixing bowl <b>insert butterfly whisk<b>. Place sugar, cream cheese, butter and grated orange peel then mix <b>2 min\/speed 4<b>."},{"content":"Add ½ of the reserved mango sauce and mix <b>20 sec\/speed 4<b>."},{"content":"To assemble the cake, check that each cake layer is level. If it is not, use a bread knife to level the top. Place one orange cake onto a serving plate, spoon ⅓ of the filling onto the cake layer and carefully level off. Repeat with the second cake and filling then add the third cake. Spoon the remaining topping onto the cake surface."},{"content":"Just before serving, drizzle the reserved mango sauce over the cream cheese topping. Arrange the baked meringue kisses on top. Arrange the kiwi and plum slices around the base of the cake and serve."}],"hintsAndTricks":["To make the cake using one tin, choose a high cake tin (Ø 18 cm) and bake for 30-35 minutes in a preheated oven (180ºC). Allow cake to cool approx. 10 minutes before removing from cake tin. Allow cake to cool completely on a wire rack before slicing in three horizontally for filling.","The orange cake can be made in advance: to prevent the cake from drying out, store it in a container in the refrigerator. Orange cake will keep for 2-3 days in the refrigerator or up to 1 month in the freezer.","You can use the Thermomix scales to measure out the 240 g cake batter for each cake tin. Turn scales on, then lift mixing bowl out and pour some of the cake batter out. When you return the mixing bowl to the base, it will show a minus figure indicating the weight removed (- 240 g).","Make the meringue kisses in advance, and store in an airtight container for up to 5 days.","For a Strawberry Orange cake, replace the mango, nectarine and kiwifruit with fresh strawberries. Replace the mango in the mango sauce with strawberries.","A tropical mango cocktail would be a good partner for this cake."],"basicInfo":["advanced","40m","2h 40m","12 slices"]}