{"badges":["TM5","TM6"],"usefulItems":"jug, frying pan, baking tray, baking paper, oven, hob","id":"r131939","imageLink":"https:\/\/2.bp.blogspot.com\/-mIfnMlYUNhk\/XZVQohkGCNI\/AAAAAAAAdDw\/KOVQHdsYDQAAInTiwGEkMv7QpTfKYJgIQCLcBGAsYHQ\/s1600\/0_T4f3QVT9FOn7s7eN.png","title":"Lemon and Herb Salmon Burgers with Parmesan Courgettes","publishedAt":"2016-09-26T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Parmesan Courgettes"},{"content":"60 g Parmesan cheese, cut in pieces (2 cm)"},{"content":"60 g white bread, cut in pieces"},{"content":"1 medium egg"},{"content":"1 tsp fine sea salt"},{"content":"500 g courgettes, cut in batons (5 cm x 1 cm)"},{"isHeader":true,"content":"Mayonnaise"},{"content":"150 g sunflower oil"},{"content":"1 medium egg"},{"content":"2 pinches ground black pepper"},{"content":"½ tsp fine sea salt"},{"content":"1 tsp vinegar"},{"content":"2 tsp Dijon mustard"},{"isHeader":true,"content":"Salmon Burgers"},{"content":"60 g shallots, halved"},{"content":"5 g fresh dill leaves"},{"content":"1 Tbsp fresh tarragon, cut in pieces"},{"content":"400 g fresh salmon fillets, skinless, cut in pieces"},{"content":"80 g frozen green peas"},{"content":"1 Tbsp grated lemon zest"},{"content":"½ tsp fine sea salt"},{"isHeader":true,"content":"Serving"},{"content":"2 Tbsp olive oil"},{"content":"4 burger buns"},{"content":"160 g cherry tomatoes, halved"},{"content":"8 green lettuce leaves, for serving"}],"nutrition":{"protein":"40 g","fat":"68 g","uom":"per 1 portion","carbohydrates":"53 g","calories":"4110 kJ \/ 982 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Parmesan Courgettes"},{"content":"Preheat oven to 180°C and line a baking tray with baking paper."},{"content":"Place Parmesan and bread in mixing bowl then grate <b>10 sec\/speed 10<b>. Transfer to a bowl and set aside."},{"content":"In a bowl, lightly whisk egg and salt. Dip courgette batons into whisked egg, then roll in the breadcrumb mixture and place on prepared tray. Bake for 25 minutes (180°C). Meanwhile, continue with recipe."},{"isHeader":true,"content":"Mayonnaise"},{"content":"Without cleaning mixing bowl, place a jug on mixing bowl lid, weigh in oil and set aside."},{"content":"Place egg, pepper, salt, vinegar and mustard in mixing bowl. Mix <b>1 min 30 sec\/speed 4<b> while very slowly pouring reserved oil onto mixing bowl lid, letting it drizzle around measuring cup in a thin stream onto rotating blades to create an emulsion. Transfer mayonnaise to a serving bowl and set aside."},{"isHeader":true,"content":"Salmon Burgers"},{"content":"Place shallots, dill and tarragon in mixing bowl then chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Chop again <b>5 sec\/speed 5<b> then scrape down sides of mixing bowl with spatula."},{"content":"Add salmon, peas, lemon zest and salt then chop <b>10 sec\/speed 8<b>. Transfer mixture to a bowl, divide into 8 and shape into burgers (approx. Ø 5 cm)."},{"isHeader":true,"content":"Serving"},{"content":"Heat a frying pan with oil over a medium-high heat. Fry burgers for 5-6 minutes on each side or until golden brown on the outside and cooked through. Slice buns in half and lightly toast in hot pan. Place two salmon burgers between 2 bun halves and top with tomatoes, lettuce and reserved mayonnaise. Serve immediately with Parmesan courgettes."}],"hintsAndTricks":["This is a great example of all the elements of a meal being made in your Thermomix: the burgers, mayonnaise and courgette coating – you can even make the burger buns if you have time!","Fresh mayonnaise is simple to make in the Thermomix. Make double the quantity and store in the fridge for up to <b>3 days.<b>","The salmon burgers can be made with any firm-fleshed fish, such as haddock, pollock, trout or tuna.","For a more satisfying burger bun, use toasted ciabatta or focaccia bread.","Add <b>5 g<b> extra dill to the mayonnaise to flavour it."],"basicInfo":["easy","20m","30m","4 portions"]}