{"badges":["TM5","TM6"],"usefulItems":"jug, meat mallet or rolling pin, toothpick, air-tight container, refrigerator","id":"r131699","imageLink":"https:\/\/1.bp.blogspot.com\/-haCFUmj0KXw\/XZQHbajP1QI\/AAAAAAAAcIQ\/7z_oM62Rru0kmz-jGRL7xiI44bKgm_9mgCLcBGAsYHQ\/s1600\/0_jDv7m7bKv4rTnP2-.png","title":"Chicken involtini with sun-dried tomato pesto","publishedAt":"2017-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Sun-dried tomato pesto"},{"content":"70 g olive oil"},{"content":"40 g Parmesan cheese, cut into pieces (3 cm)"},{"content":"1 garlic clove"},{"content":"160 g cashew nuts, raw, unsalted"},{"content":"100 g sun-dried tomatoes"},{"isHeader":true,"content":"Chicken involtini"},{"content":"70 g mozzarella, cut into pieces (4 cm)"},{"content":"2 garlic cloves"},{"content":"2 sprigs flat-leaf parsley, fresh, leaves only, plus extra to garnish"},{"content":"2 eggs"},{"content":"1 pinch fine salt, to taste"},{"content":"1 pinch freshly ground black pepper, to taste"},{"content":"70 g breadcrumbs"},{"content":"540 g chicken breast fillets, cut into 15 strips lengthwise (approx. 2,5 cm)"},{"content":"30 fresh spinach leaves, stalks removed"},{"isHeader":true,"content":"Sauce"},{"content":"1 garlic clove"},{"content":"½ onion (approx. 75 g)"},{"content":"50 g olive oil"},{"content":"650 - 700 g tomato passata"}],"nutrition":{"protein":"40 g","fat":"47.1 g","uom":"per 1 portion","carbohydrates":"27.1 g","calories":"2950 kJ \/ 702 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Sun-dried tomato pesto"},{"content":"Place a jug onto mixing bowl lid, then weigh olive oil into it. Set jug aside until required."},{"content":"Place Parmesan and garlic into mixing bowl and grate <b>10 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add cashew nuts or pine nuts and sun-dried tomatoes and chop <b>3 sec\/speed 5<b>, or until a chunky consistency is achieved. Scrape down sides of mixing bowl with spatula."},{"content":"Mix <b>30 sec\/speed 4<b>, slowly pouring oil onto mixing bowl lid, letting it drizzle into mixing bowl. Transfer pesto into a sealable storage container and refrigerate until ready to use. Clean and dry mixing bowl."},{"isHeader":true,"content":"Chicken involtini"},{"content":"Place mozzarella into mixing bowl and grate <b>5 sec\/speed 7<b>. Transfer into a bowl and set aside."},{"content":"Place garlic and parsley into mixing bowl and chop <b>3 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add eggs, fine salt, pepper, breadcrumbs and 4 tbsp of the reserved sun-dried tomato pesto and combine <b>30 sec\/speed 5<b>."},{"content":"Using a meat mallet or rolling pin, pound chicken breast strips to tenderise and flatten. Distribute breadcrumb mixture evenly over chicken strips, then top each strip with two spinach leaves and a sprinkle of reserved mozzarella."},{"content":"Roll chicken strips up to enclose filling and secure ends with toothpicks. Clean and dry mixing bowl."},{"content":"Arrange chicken involtini in the simmering basket and Varoma dish, then set simmering basket and Varoma aside until ready to cook."},{"isHeader":true,"content":"Sauce"},{"content":"Place garlic and onion into mixing bowl and chop <b>3 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add olive oil and sauté <b>3 min\/Varoma\/speed 1<b>."},{"content":"Add tomato passata and 1 tbsp of the reserved sun-dried tomato pesto to mixing bowl. Insert simmering basket with involtini, then place Varoma dish with remaining involtini into position. Steam <b>20-25 min\/Varoma\/speed 2<b>, or until chicken is cooked through."},{"content":"Once cooked, set Varoma aside and remove simmering basket with aid of spatula. Place sauce onto plates or into serving dish, top with chicken involtini and serve immediately garnished with fresh parsley."}],"hintsAndTricks":["Vegetables of choice can be steamed on the Varoma tray at the same time as the chicken involtini if desired. This may affect the cooking time for the chicken so check your chicken is cooked through and extend cooking time accordingly if required.","To store leftover sun-dried tomato pesto, transfer into an airtight container, then top with a thin layer of olive oil until pesto is covered. Place into the refrigerator to store until use."],"basicInfo":["medium","25m","50m","5 portions"]}