{"badges":["TM5","TM6"],"usefulItems":"sealable sterilised jar","id":"r135863","imageLink":"https:\/\/3.bp.blogspot.com\/-wXKDy8-L95A\/XZaq3eGHpAI\/AAAAAAAAhh4\/rLHAfyB_f5UbxWZJ5zICJbnYeuGvy7gYwCLcBGAsYHQ\/s1600\/0_qvOvyWB_jB0By8M_.png","title":"Chaat masala","publishedAt":"2017-07-03T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"1 tbsp cumin seeds"},{"content":"3 tsp coriander seeds"},{"content":"20 g black peppercorns"},{"content":"1 ½ tbsp dried mango powder (see Tips)"},{"content":"3 tsp black salt flakes (see Tips)"},{"content":"¼ tsp asafoetida (see Tips)"},{"content":"¾ tsp ground ginger"},{"content":"½ tsp Kashmiri chilli powder"},{"content":"¾ tsp dried chopped mint"}],"nutrition":{"protein":"5.8 g","fat":"8.6 g","uom":"per 1 total recipe","carbohydrates":"16.5 g","calories":"788 kJ \/ 187 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place cumin and coriander seeds into mixing bowl and roast <b>2 min\/Varoma\/speed 2<b>. Allow to cool in mixing bowl for 5 minutes."},{"content":"Add all remaining ingredients and mill <b>1 min\/speed 10<b>. Transfer into a sealable sterilised container and store in a dark place until ready to use (see Tips)."}],"hintsAndTricks":["You can find dried mango powder and asafoetida at Indian food stores or online.","Black salt flakes are sea salt flakes combined with volcanic charcoal, and add a hint of bitterness to the dish. You can find them at gourmet food stores or online. <br>","Asafoetida comes from the root of a perennial Indian herb. It has a strong odour, but the aroma softens as it cooks, and it tastes similar to onion and garlic, enhancing the savoury flavour of the dish. It helps reduce flatulence and constipation, and reduce the growth of microflora in the gut. A little goes a long way, so you only need to use a small amount.","Chaat Masala can be sprinkled over green salads, fruit salads and added to raita for an extra burst of flavour. Sprinkle a few pinches of Chaat Masala over cooked dishes, allow to sit for 2-3 minutes, then serve. Adding the spice just before serving brings out the flavours of the dish.","Store Chaat masala in a sealable storage container in a cool, dark place for up to 6 months."],"basicInfo":["easy","5m","10m","1 total recipe"]}