{"badges":["TM5","TM6"],"usefulItems":"ice cream scoop, bowl, baking tray (30 x 40 cm), aluminium foil, oven grill","id":"r136204","imageLink":"https:\/\/2.bp.blogspot.com\/-fakEOhoj1mo\/XZVRkGj_tFI\/AAAAAAAAdQM\/6ew9mYRmr3A14cMAiuq60uLo8bGGJ_U4gCLcBGAsYHQ\/s1600\/0_rP2AcEUpA6dRVhDd.png","title":"Baingan ka bharta","publishedAt":"2017-07-03T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"2 eggplants (approx. 350 g each)"},{"content":"4 garlic cloves"},{"content":"14 sprigs fresh coriander, leaves and stalks, plus extra leaves for garnishing"},{"content":"2 brown onions, cut into halves"},{"content":"1 cm piece fresh ginger, peeled"},{"content":"1 fresh long green chilli, trimmed and cut into halves"},{"content":"40 g ghee (see Tips)"},{"content":"1 tsp cumin seeds"},{"content":"3 tomatoes, cut into pieces (1 cm)"},{"content":"1 tbsp ground coriander"},{"content":"1 tsp ground turmeric"},{"content":"¼ - ½ tsp salt, to taste"}],"nutrition":{"protein":"5 g","fat":"9.2 g","uom":"per 1 portions","carbohydrates":"11.5 g","calories":"691 kJ \/ 164 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven grill. Line a baking tray (30 x 40 cm) with aluminium foil and set aside. Cut a 4 cm vertical slit into each eggplant and place 1 garlic clove into centre of each slit, then place onto prepared baking tray. Grill eggplants, turning carefully using tongs, until completely blackened and soft (approx. 5-8 minutes). Transfer into a bowl and allow to cool (approx. 30 minutes). Cut eggplants into halves and set garlic aside. Scoop eggplant flesh into a separate bowl and set aside. Discard skins."},{"content":"Place fresh coriander leaves and stalks into mixing bowl and chop <b>3 sec\/speed 7<b>. Transfer into a separate bowl and set aside."},{"content":"Place onion, ginger, chilli, remaining raw garlic and reserved roasted garlic into mixing bowl and chop <b>5 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add ghee and cumin seeds and sauté <b>7 min\/Varoma\/speed 1<b>."},{"content":"Add tomatoes, ground coriander, turmeric and salt and cook <b>3 min\/Varoma\/\/speed 1<b>."},{"content":"Add reserved eggplant flesh and cook <b>12 min\/Varoma\/\/speed 2<b>."},{"content":"Add reserved chopped coriander and stir through using spatula. Transfer into a serving dish and garnish with extra coriander leaves before serving."}],"hintsAndTricks":["You can also grill the eggplant on the barbecue.","To make your own ghee, please refer to the recipe on this recipe chip.","Serve with naan or rice of choice.","This recipe was contributed by MasterChef 2016 contestant Nidhi Mahajan (who is also a Thermomix Consultant!)."],"basicInfo":["easy","30m","1h 20m","4 portions"]}