{"badges":["TM5","TM6"],"usefulItems":"bowl, silicone bread mat, plastic wrap, 2 baking trays (30 x 40 cm), baking paper, round cookie cutter (10 cm), round cookie cutter (3.5 cm), rolling pin, straw, pastry brush, oven","id":"r140207","imageLink":"https:\/\/2.bp.blogspot.com\/-qrM265-s_1U\/XZQHBtEsA_I\/AAAAAAAAcEY\/K9SZLN10VwwzauWIP_Zv9hwK__VYhV1BQCLcBGAsYHQ\/s1600\/0_bRKmXmJg8EK1wPYx.png","title":"Little piggy faces","publishedAt":"2017-10-16T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Dough"},{"content":"100 g unsalted butter, cut into pieces"},{"content":"600 g plain flour, plus extra for dusting"},{"content":"100 g full cream milk"},{"content":"150 g natural yoghurt"},{"content":"50 g pouring (whipping) cream"},{"content":"2 tsp dried instant yeast"},{"content":"1 tsp sugar"},{"content":"1 egg"},{"content":"1 tsp salt"},{"isHeader":true,"content":"Pork filling"},{"content":"500 g pork fillet, cut into cubes (3 cm), slightly frozen"},{"content":"¼ tsp ground ginger"},{"content":"¼ tsp ground coriander"},{"content":"¼ tsp salt"},{"content":"½ tsp  ground black pepper"},{"content":"1 tsp sesame oil"},{"content":"2 tbsp cornflour"},{"content":"1 tbsp soy sauce"},{"content":"1 egg yolk"},{"isHeader":true,"content":"Assembly"},{"content":"1 egg white, for brushing"},{"content":"40 currants, flattened to make eyes"},{"content":"1 egg yolk, for egg wash"},{"content":"2 tsp pouring (whipping) cream, for egg wash"}],"nutrition":{"protein":"12.3 g","fat":"8.4 g","uom":"per 1 portion","carbohydrates":"29.4 g","calories":"1032 kJ \/ 245 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Dough"},{"content":"Place butter and 150 g of the flour into mixing bowl and mix <b>3 sec\/speed 6<b>. Transfer into a bowl and set aside."},{"content":"Place milk, yoghurt, cream, yeast, sugar, egg, salt and remaining 450 g flour into mixing bowl and mix <b>40 sec\/speed 4<b> <b>.<b> "},{"content":"Add reserved butter mixture and knead <b>1 min 30 sec\/<b>. Transfer into a bowl, cover with plastic wrap or wrap in a silicone bread mat and set aside to prove for 1 hour 30 minutes, until doubled in size. Clean and dry mixing bowl."},{"isHeader":true,"content":"Pork filling"},{"content":"Place 250 g of the pork into mixing bowl and mince <b>Turbo\/1 sec\/4-6 times<b>. Transfer into a bowl and set aside."},{"content":"Place remaining pork into mixing bowl and mince <b>Turbo\/1 sec\/4-6 times<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add reserved pork mince, ground ginger, ground coriander, salt, pepper, sesame oil, cornflour, soy sauce and egg yolk and combine <b>Turbo\/1 sec\/2 times<b>. Set aside."},{"isHeader":true,"content":"Assembly"},{"content":"Line 2 baking trays (30 x 40 cm) with baking paper and set aside."},{"content":"Divide dough into 2 equal portions. Roll out each portion of the dough (3 mm thickness). Using round cookie cutters (10 cm and 3.5 cm), cut out a total of 18 large circles (10 cm) and 27 small circles (3.5 cm). Re-roll left over dough and cut out as needed."},{"content":"Place 2-3 teaspoons of the reserved pork filling into the centre of each of the large circles, then bring edges together to enclose filling and seal bun. Place seam side down onto prepared baking trays."},{"content":"Using the end of a plastic straw, cut out two holes in each of the 18 smaller circles (to form pigs' snouts). Discard dough in straw. Brush faces with egg white and attach a nose to the front of each bun."},{"content":"Cut remaining 9 small circles into quarters (to make pigs' ears). Brush tops of buns with a little more egg white and attach 2 ears onto the top of each bun, pressing down firmly to secure. Push 2 currants into buns (to make pigs' eyes) above the snout."},{"content":"Place egg yolk and cream into a bowl and beat, then brush egg wash all over buns."},{"content":"Place buns into a cold oven and bake for 20-22 minutes (180°C) until golden brown. Set aside to cool slightly before serving."}],"basicInfo":["medium","40m","2h 30m","18 portions"]}