{"badges":["TM5","TM6"],"usefulItems":"metal bowl, piping bag and plain nozzle, dessert glasses, refrigerator","id":"r146792","imageLink":"https:\/\/4.bp.blogspot.com\/-KNcw0PRy1bA\/XZWfJC2Qy4I\/AAAAAAAAe_c\/_Z8O1uzQa0gmybRwLgBnEse-6oh2y-eNwCLcBGAsYHQ\/s1600\/0_p1Y5izJBPpDaqAJ8.png","title":"Piped Raspberry Mousse","publishedAt":"2017-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"2 gelatine leaves"},{"content":"250 g raspberry purée"},{"content":"10 g lemon juice"},{"content":"10 g Kirsch or cherry brandy"},{"content":"100 g sugar"},{"content":"60 g egg whites, from medium eggs"},{"content":"1 pinch fine sea salt"},{"content":"250 g whipping cream"}],"nutrition":{"protein":"4.5 g","fat":"25.3 g","uom":"per 1 portions","carbohydrates":"30.3 g","calories":"1586 kJ \/ 381 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Soak gelatine leaves in a bowl of cold water. Meanwhile, place raspberry purée, lemon juice and Kirsch in mixing bowl then heat <b>5 min\/90°C\/speed 2<b>."},{"content":"Squeeze out gelatine leaves, add to mixing bowl then mix <b>20 sec\/speed 1<b>. Transfer to a large metal bowl then refrigerate. Clean mixing bowl."},{"content":"Place a small bowl on mixing bowl lid then weigh in 100 g sugar. Remove bowl from lid."},{"content":" <b>Insert butterfly whisk.<b> Place egg whites and salt in mixing bowl then, without measuring cup, whisk <b>9 min\/70°C\/speed 3<b>. With 5 minutes remaining, slowly add reserved sugar. Transfer to a bowl and set aside. Clean mixing bowl and butterfly whisk."},{"content":" <b>Insert butterfly whisk.<b> Place cream in mixing bowl and whip <b>speed 3<b> until lightly whipped, watching carefully to avoid over-whipping."},{"content":"Place chilled raspberry mixture over a bowl of ice until it starts to thicken (see tip). Fold through meringue and whipped cream. Pipe into glasses and refrigerate until ready to decorate and serve."}],"hintsAndTricks":["To make your own raspberry purée, blend <b>350 g<b> fresh raspberries <b>30 sec\/speed 9<b>, then pass through a fine sieve to remove seeds.","Using a metal bowl allows you to chill the raspberry mixture faster.","A good sign of a mixture thickening is that it leaves a trail that holds it's shape momentarily when you drizzle it back into the bowl from a spoon."],"basicInfo":["medium","20m","1h","4 portions"]}