{"badges":["TM5","TM6"],"usefulItems":"brownie tins (32 cm x 18 cm), baking paper, skewer, wire rack, oven","id":"r148588","imageLink":"https:\/\/2.bp.blogspot.com\/-hLEauklIEbM\/XZWp4TPS2GI\/AAAAAAAAfQY\/3lIafF2cqvcuKUfUcgASgJspdYKS0_GvgCLcBGAsYHQ\/s1600\/0_7xwQQDmsPvYIdhQQ.png","title":"Orange Sponge","publishedAt":"2017-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"600 g water"},{"content":"60 g orange zest (thin peelings of skin from approx. 5 oranges)"},{"content":"190 g whole milk"},{"content":"175 g olive oil"},{"content":"60 g orange juice"},{"content":"250 g caster sugar"},{"content":"125 g eggs, (approx. 3 medium)"},{"content":"250 g plain flour"},{"content":"4 tsp baking powder"}],"nutrition":{"protein":"53 g","fat":"196 g","uom":"per 1 Total recipe","carbohydrates":"470 g","calories":"16282 kJ \/ 3890 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place 200 g water in mixing bowl then heat <b>3 min\/100°C\/speed 1<b>. Add orange zest and boil <b>2 min\/100°C\/speed 1<b>. Drain and refresh zest in cold water."},{"content":"Place 200 g water in mixing bowl then heat <b>3 min\/100°C\/speed 1<b>. Add softened orange zest and boil <b>2 min\/100°C\/speed 1<b>. Drain and refresh zest in cold water."},{"content":"Place 200 g water in mixing bowl then heat <b>3 min\/100°C\/speed 1<b>. Add softened orange zest and boil <b>2 min\/100°C\/speed 1<b>. Drain and refresh zest in cold water."},{"content":"Preheat oven to 180°C and line 2 brownie tins (32 cm x 18 cm) with baking paper."},{"content":"Place milk, olive oil, orange juice and softened orange zest in mixing bowl then mix <b>1 min\/speed 6<b>. Transfer to a bowl and set aside. Rinse mixing bowl."},{"content":" <b>Insert butterfly whisk.<b> Place eggs and sugar in mixing bowl then whisk <b>6 min\/37°C\/speed 4<b>. Whisk again <b>6 min\/speed 4<b> to form a sabayon."},{"content":"Add reserved orange mixture and mix <b>15 sec\/speed 1<b>."},{"content":"Add flour and baking powder then mix <b>4 sec\/speed 3<b>. <b>Remove butterfly whisk<b> then finish mixing by hand with spatula. Transfer to prepared tins and bake for 15 minutes (180°C) until a skewer inserted in centre comes out clean. Allow to cool in tins for 10 minutes before removing to a wire rack to cool completely."},{"content":"Use as specified in your recipe."}],"hintsAndTricks":["Boiling and refreshing the orange zest <b>3 times<b> removes the bitterness and softens it.","This cake mixture can be made the day before and stored in a covered bowl in the fridge, then transferred to a suitable tin and baked. This resting period will give a more intense orange flavour to the sponge.","Whole pasteurised egg (in cartons) can be substituted for individual eggs.","To make an orange roulade, transfer the sponge mixture to a swiss roll tin lined with silicone paper, bake for <b>10 minutes<b> (180°C), turn out onto silicone paper lightly dusted with caster sugar. Leave to cool then spread the surface of the sponge with marmalade lightly warmed in the microwave. Cover with lightly whipped cream flavoured with finely grated orange zest and orange juice, reduced in a saucepan to a syrup. Add orange syrup to lightly whipped cream when it is cold. Lightly roll the sponge into a swiss roll.","This sponge has a good flavour and texture combination making it suitable to line metal rings prior to filling with chocolate mousse.","Cook the sponge in a tin suitable for how you intend to use it. A large spring form tin for a base to a mousse cake; brownie tins as a base to individual cakes (for either squares or circles cut using a pastry cutter)."],"basicInfo":["easy","15m","2h","1"]}