{"badges":["TM31","TM5","TM6"],"usefulItems":"baking paper, jug, plate, thermal serving bowl or other large bowl","id":"r150469","imageLink":"https:\/\/3.bp.blogspot.com\/-3PC4QHvz0Uo\/XZVPLGlVNxI\/AAAAAAAAc10\/o-cQVxu4YtI7yiiQP5b54ufvvndPxOX8QCLcBGAsYHQ\/s1600\/0_1k_axzSbcmve9KAc.png","title":"Cauliflower 'fried' rice","publishedAt":"2018-04-02T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"4 eggs"},{"content":"500 g water"},{"content":"2 ½ cm piece fresh ginger, peeled"},{"content":"2 garlic cloves"},{"content":"180 g brown onion, cut into quarters"},{"content":"12 sprigs fresh coriander, stalks and leaves, cut into thirds"},{"content":"100 g red capsicum, cut into pieces (2-3 cm)"},{"content":"2 tbsp coconut oil"},{"content":"100 g fresh shiitake mushrooms, cut into halves"},{"content":"400 g cauliflower, cut into florets (approx. 3 cm)"},{"content":"200 g Brussels sprouts"},{"content":"2 tbsp tamari"},{"content":"1 tbsp Shaoxing wine (Chinese cooking wine)"},{"content":"50 g fresh bean sprouts, plus extra for garnishing"},{"content":"salt, to taste"},{"content":"2 tbsp roasted unsalted cashew nuts"},{"content":"2 spring onions\/shallots, trimmed and cut into slices (optional)"}],"nutrition":{"protein":"16 g","fat":"17 g","uom":"per 1 portion","carbohydrates":"9.3 g","calories":"1128 kJ \/ 268 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Line Varoma tray with a piece of wet, well-wrung baking paper. Make sure paper goes all the way to the edges to prevent the egg mixture from spilling. Crack eggs into a jug and beat lightly with a fork. Pour into lined Varoma tray."},{"content":"Place water into mixing bowl, place Varoma into position, secure Varoma lid and steam <b>10-12 min\/Varoma\/speed 2<b> or until eggs are cooked to your liking."},{"content":"Remove cooked egg, cut into strips and transfer onto a plate. Discard water and dry mixing bowl."},{"content":"Place ginger, garlic, onion, coriander and capsicum into mixing bowl and chop <b>4 sec\/speed 5<b>."},{"content":"Add 1 tablespoon of the coconut oil, then mushrooms and cook <b>10 min\/100°C\/\/speed 1<b>. Transfer into a thermal serving bowl or other large bowl and cover to keep warm. Clean and dry mixing bowl."},{"content":"Place remaining 1 tablespoon oil into mixing bowl and heat <b>2 min\/100°C\/speed 1<b>."},{"content":"Add cauliflower and Brussels sprouts into mixing bowl and chop <b>2-3 sec\/speed 5<b> or until evenly chopped."},{"content":"Add cooked egg and cook <b>6-9 min\/100°C\/\/speed 1<b> or until cooked to your liking. Transfer into thermal serving bowl or other large bowl. Add tamari, Shaoxing wine and bean sprouts and gently stir to combine with aid of spatula."},{"content":"Season with salt, then garnish with cashews, spring onions\/shallots (optional) and extra bean sprouts before serving."}],"hintsAndTricks":["Shaoxing wine (also known as Chinese cooking wine) can be found in the international aisle of most major supermarkets and at Asian food stores."],"basicInfo":["easy","10m","45m","4 portions"]}