{"badges":["TM31","TM5","TM6"],"usefulItems":"serving bowl, refrigerator","id":"r150505","imageLink":"https:\/\/1.bp.blogspot.com\/-8ylO4wL_orE\/XZadWfoXV-I\/AAAAAAAAga4\/PvDdl_0zE7gei73Kd5rfKGn0czX8nrgWACLcBGAsYHQ\/s1600\/0_9YSK5elwHeg4ZMRK.png","title":"Hommus dip","publishedAt":"2018-04-02T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"3 garlic cloves"},{"content":"2 tbsp olive oil, plus extra to serve"},{"content":"800 g canned chickpeas, rinsed and drained (approx. 500 g after draining)"},{"content":"60 g lemon juice"},{"content":"2 tbsp tahini"},{"content":"sea salt, to taste"},{"content":"zaatar, for sprinkling (optional - see Tips)"}],"nutrition":{"protein":"2.4 g","fat":"4.6 g","uom":"per 1 portion","carbohydrates":"4.1 g","calories":"299 kJ \/ 71 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place garlic into mixing bowl and chop <b>5 sec\/speed 8<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add oil and cook <b>1 min\/Varoma\/speed 1<b>."},{"content":"Add chickpeas and lemon juice and mix <b>30 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add tahini and salt and blend <b>10 sec\/speed 5<b>, until smooth. Transfer into a serving bowl and sprinkle with za'atar (optional) and extra oil (optional) before serving."}],"hintsAndTricks":["<b>Roasted onion hommus<b>: Replace 400 g chickpeas with 250 g sautéed or roasted onion. Proceed as per recipe. Reserve 2 tablespoons roasted onion for garnishing, if desired.","<b>Spinach and lemon hommus<b>: Replace 400 g chickpeas with 300 g chopped fresh baby spinach leaves and an extra 20 g lemon juice. Proceed as per recipe.","<b>Butternut pumpkin hommus<b>: Replace 400 g chickpeas with 350 g roasted butternut pumpkin, ¼ teaspoon ground cinnamon and ¼ teaspoon ground cumin. Proceed as per recipe.","For an extra flavour boost, try sprinkling hommus with some <i>Za'atar seasoning<\/i> (please refer to the recipe on this recipe chip).","You can store this dip in the refrigerator for up to 3 days."],"basicInfo":["easy","5m","5m","17 portions"]}