{"badges":["TM31","TM5","TM6"],"usefulItems":"plate, bowl, pastry brush, large bowl","id":"r150486","imageLink":"https:\/\/2.bp.blogspot.com\/-uDblr5fDNCw\/XZQHO1UKUDI\/AAAAAAAAcG0\/sYdfxiq3mZkrDH4DtumMptosx9OCli2fwCLcBGAsYHQ\/s1600\/0_fVBh_BVmJI8UE1vE.png","title":"Lamb cutlets with pumpkin and pistachio salad","publishedAt":"2018-04-02T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"50 g shelled unsalted pistachio nuts"},{"content":"1 garlic clove"},{"content":"12 fresh mint leaves"},{"content":"200 g natural yoghurt"},{"content":"¼ tsp ground cumin, plus extra for sprinkling"},{"content":"¼ tsp ground smoked paprika, plus extra for sprinkling"},{"content":"2 pinches salt, plus extra for sprinkling"},{"content":"2 pinches ground black pepper, plus extra for sprinkling"},{"content":"500 g water"},{"content":"400 g pumpkin, peeled and cut into cubes (2 cm)"},{"content":"1 tbsp oil"},{"content":"8 lamb cutlets, trimmed (see Tip)"},{"content":"60 g fresh baby spinach leaves"},{"content":"1 tbsp baby pickled capers"},{"content":"12 cherry tomatoes, cut into halves"},{"content":"1 avocado, flesh only, cut into pieces"}],"nutrition":{"protein":"20.6 g","fat":"29.7 g","uom":"per 1 portion","carbohydrates":"10 g","calories":"1697 kJ \/ 404 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place pistachios into mixing bowl and chop <b>5 sec\/speed 6<b>. Transfer onto a plate and set aside."},{"content":"Place garlic and mint into mixing bowl and chop <b>5 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add yoghurt, cumin, paprika, salt and pepper and mix <b>10 sec\/speed 4<b>. Transfer into a bowl and set aside. Rinse mixing bowl."},{"content":"Place water into mixing bowl. Place Varoma dish into position and weigh pumpkin into it. Add 2 teaspoons of the oil to pumpkin and toss to coat."},{"content":"Place lamb onto Varoma tray and brush with remaining 2 teaspoons oil. Sprinkle with extra cumin, paprika, salt and pepper to season. Insert Varoma tray with seasoned lamb, secure Varoma lid and steam <b>8 min\/Varoma\/speed 1<b>."},{"content":"Stir pumpkin and turn lamb cutlets to ensure even cooking. Secure Varoma lid and steam <b>6-8 min\/Varoma\/speed 1<b> or until lamb is cooked to your liking. Remove Varoma and set aside to cool for approx. 3-5 minutes. Dip 1 side of each cutlet into the reserved yoghurt dressing, then into the reserved chopped pistachios and transfer onto a plate."},{"content":"Place spinach, capers, tomatoes, avocado and steamed pumpkin into a large bowl and toss to combine. Sprinkle with remaining chopped pistachios, then serve with lamb cutlets and remaining yoghurt dressing."}],"hintsAndTricks":["You can trim the cutlets yourself, but most butchers will do it for you."],"basicInfo":["easy","20m","40m","4 portions"]}