{"badges":["TM5","TM6"],"usefulItems":"baking paper, cling film, large bowl, refrigerator","id":"r150915","imageLink":"https:\/\/1.bp.blogspot.com\/-0B6cpaaiE2w\/XZVQna1K4YI\/AAAAAAAAdDg\/plvvE9bnXGMFxXvIhb6RU53bJgHVwmbAQCLcBGAsYHQ\/s1600\/0_SmCqirUWaoMdFfJn.png","title":"Pike Perch Fillets with Fresh Corn Polenta","publishedAt":"2017-06-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"400 g pike-perch fillets, skin on (4 fillets, 1 cm thick)"},{"content":"1 ½ Tbsp fish sauce"},{"content":"2 tsp toasted sesame oil"},{"content":"7 - 8 sprigs fresh dill, leaves only"},{"content":"1 orange, zest and juice"},{"content":"500 g water"},{"content":"600 - 700 g fresh sweetcorn kernels (from 5-6 corn cobs)"},{"content":"2 tsp salt"},{"content":"400 g mixed vegetables, sliced (5 mm) or bite-size pieces (e.g. carrots, broccoli, cauliflower)"},{"content":"40 g butter"}],"nutrition":{"protein":"26 g","fat":"12 g","uom":"per 1 portion","carbohydrates":"29 g","calories":"1461 kJ \/ 350 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place fish fillets in a large bowl and set aside. Place fish sauce, sesame oil and dill in mixing bowl and mix <b>5 sec\/speed 5<b>. Pour over fish fillets and turn gently to coat. Cover bowl and allow to marinate in fridge for 30 minutes. Meanwhile, clean and dry mixing bowl, then proceed with recipe."},{"content":"Place 1 strip of orange zest (1 cm x 5 cm) and water in mixing bowl and blend <b>5 sec\/speed 8<b>. Insert simmering basket, add sweetcorn kernels, orange juice and 1 tsp salt."},{"content":"Set Varoma dish in position and add vegetables to it. Close Varoma and steam <b>15 min\/Varoma\/speed 1<b>. Meanwhile, line Varoma tray with baking paper."},{"content":"Arrange drained marinated fish fillets on prepared Varoma tray. Remove Varoma, insert Varoma tray and set Varoma back in position. Steam <b>11-13 min\/Varoma\/speed 1<b>, extending steaming time as needed, depending on thickness of fish fillets. Remove Varoma and set aside."},{"content":"Remove simmering basket with aid of spatula, empty mixing bowl and transfer steamed sweetcorn to mixing bowl. Add ½ tsp salt and 20 g butter and blend <b>30 sec\/speed 6<b> to make sweetcorn polenta. Transfer steamed vegetables to a serving bowl and season with ½ tsp salt and 20 g butter. Serve sweetcorn polenta with fish fillets and steamed vegetables."}],"hintsAndTricks":["<i>Polenta is now widely known outside of Italy, but have you ever tried polenta made with fresh corn? The fresh, sweet taste of corn with a zesty orange flavour is a surprising yet pleasing complement to the marinated fish. If fresh corn is not in season, use frozen or tinned sweetcorn. As for the fish, any white freshwater fish will give great results in this recipe.<\/i>","If you’re in a hurry, omit marinating the fish: place fish and marinade ingredients directly on the Varoma tray lined with baking paper.<br>- To cut the kernels off a fresh corn cob, use a sharp knife to slice from top to bottom, avoiding the cob itself as much as possible.","Use any type of freshwater fish with firm white flesh. Adjust steaming time in <b>step 4<b> according to the texture and thickness of the fish fillets."],"basicInfo":["easy","45m","1h 5m","4 portions"]}