{"badges":["TM5","TM6"],"usefulItems":"freezer","id":"r150927","imageLink":"https:\/\/1.bp.blogspot.com\/-MYDaZUJGQS4\/XZaqFLVRD4I\/AAAAAAAAhY4\/uojmQMdBtd4TNvI21em8lCWG4sr9oL3fwCLcBGAsYHQ\/s1600\/0_MoRf_tsjNADpGve9.png","title":"Pearl Rice Meatballs","publishedAt":"2017-06-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"200 g white glutinous rice"},{"content":"water, plus extra for soaking"},{"content":"350 g pork belly meat, boneless, skinless, cut in pieces (5 cm) (see variation)"},{"content":"3 - 4 fresh shiitake mushrooms (approx. 50 g)"},{"content":"25 g carrot"},{"content":"20 g fresh water chestnuts, skinned, halved"},{"content":"5 - 10 g fresh root ginger, peeled, cut in round slices (2 mm)"},{"content":"20 g spring onions, cut in pieces (2 cm)"},{"content":"2 pinches ground white pepper"},{"content":"½ tsp salt"},{"content":"½ tsp sugar"},{"content":"1 tsp cornflour"},{"content":"20 g soy sauce"},{"content":"600 g water"}],"nutrition":{"protein":"3 g","fat":"2 g","uom":"per 1 piece","carbohydrates":"6 g","calories":"225 kJ \/ 54 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place a bowl on mixing bowl lid, weigh glutinous rice into it, cover rice with water and set aside to soak. Set a plate on mixing bowl lid and weigh pork belly meat onto it, then place in freezer. Allow rice to soak at room temperature and pork to freeze for 1 hour."},{"content":"Place semi-frozen pork in mixing bowl and chop <b>25 sec\/speed 6<b>."},{"content":"Add shiitake mushrooms, carrot, water chestnuts, ginger, spring onions, white pepper, salt, sugar, cornflour and soy sauce and chop <b>10 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Knead <b>1 min\/<b>. Transfer mixture to a plate. Using spatula, divide into 4 equal parts, then from each part shape 8 small balls (approx. Ø 3 cm). Strain soaked rice through simmering basket then roll balls in the soaked rice, to cover all over with rice. Arrange 14 balls in Varoma dish, insert Varoma tray and arrange 18 balls on it."},{"content":"Place water in mixing bowl. Set Varoma in position and steam <b>30 min\/Varoma\/speed 1<b>. Serve hot."}],"hintsAndTricks":["<i>Delight your family and friends with these tasty and easy meatballs. The rice curls away from them as they steam, giving them a lovely texture. Serve them as  a light main dish for the family or with drinks at a party.<\/i>","You can replace pork belly with pork mince, provided the pork mince is fatty <b>(30% fat),<b> as pork fat is necessary to give the meatballs their smooth and soft texture. If using pork mince, omit freezing in <b>step 1<b> and omit <b>step 2.<b><br>- Replace fresh water chestnuts with tinned water chestnuts, drained before using.","If using dried mushrooms, cover them with hot water and soak for <b>30 minutes<b> in <b>step 1,<b> then drain and set aside for <b>step 3.<b><br>- Pearl rice meatballs are usually served without a dip. However, Thai sweet and sour sauce can be served as a dip for this dish, if desired.<br>- You can find glutinous rice in Asian supermarkets, or replace it with any other sticky rice, such as sushi rice."],"basicInfo":["medium","30m","2h","32 pieces"]}