{"badges":["TM5","TM6"],"usefulItems":"4 serving bowls, small bowl , jug, large frying pan, large bowl, stove top","id":"r150240","imageLink":"https:\/\/3.bp.blogspot.com\/-5w9wVNnggvg\/XZae_8JOdmI\/AAAAAAAAgqI\/c3vx9fqWFHcFPSH2_WohGGkD75lyJeACwCLcBGAsYHQ\/s1600\/0_fb7LwfFMvj9gq9La.png","title":"'Eat the rainbow' breakfast bowl","publishedAt":"2017-06-11T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Dressing"},{"content":"60 g tahini"},{"content":"2 garlic cloves"},{"content":"2 tbsp lemon juice"},{"content":"3 sprigs fresh mint, leaves only"},{"content":"3 sprigs fresh flat-leaf parsley, leaves only"},{"content":"2 tsp honey (optional)"},{"content":"¼ tsp salt"},{"content":"100 g extra virgin olive oil"},{"isHeader":true,"content":"Bowl"},{"content":"400 g cauliflower, cut into florets"},{"content":"500 g water"},{"content":"2 - 3 carrots (approx. 130 g), cut into thin noodles (see Tips)"},{"content":"1 bunch asparagus, ends trimmed"},{"content":"1 - 2 tsp ghee, for frying (optional)"},{"content":"8 slices haloumi (optional)"},{"content":"4 - 8 eggs, shells thoroughly washed"},{"content":"2 sprigs fresh flat-leaf parsley, cut into pieces"},{"content":"2 sprigs fresh mint, cut into pieces"},{"content":"salt, to taste"},{"content":"ground black pepper, to taste"},{"content":"3 tbsp sesame seeds (see Tips)"},{"content":"1 - 2 avocados, flesh only, cut into thin slices"},{"content":"sauerkraut (or other fermented veggies, such as the Fermented beetroot and apple salsa)"}],"nutrition":{"protein":"38.3 g","fat":"78.7 g","uom":"per 1 portion","carbohydrates":"13.6 g","calories":"3925 kJ \/ 934 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Dressing"},{"content":"Place all dressing ingredients into mixing bowl and blend <b>1 min\/speed 9<b>. Transfer into a jug and set aside. Do not clean mixing bowl."},{"isHeader":true,"content":"Bowl"},{"content":"Place cauliflower into mixing bowl and chop <b>5 sec\/\/speed 5<b>. Transfer into simmering basket and set aside."},{"content":"Place water into mixing bowl. Insert simmering basket with cauliflower rice into mixing bowl. Place Varoma dish into position and weigh carrots into it. Insert Varoma tray and place asparagus onto it. Secure Varoma lid and steam <b>12 min\/Varoma\/speed 2<b>. Meanwhile, place a non-stick frying pan over high heat and add ghee (optional) and haloumi (optional) and fry until haloumi is golden brown on both sides. Transfer onto a plate and set aside."},{"content":"Remove Varoma tray and set aside. Add eggs to Varoma dish with carrot noodles. Re-insert Varoma tray with asparagus. Secure Varoma lid and steam <b>6-8 min\/Varoma\/speed 2<b>, until eggs are cooked to your liking. Carefully remove eggs and run under cold water until cool enough to touch."},{"content":"Remove simmering basket with aid of spatula and transfer cauliflower rice into into a large bowl. Add parsley, mint and half of the reserved dressing and stir to combine. Season with salt and pepper to taste."},{"content":"Place sesame seeds into a small bowl. Peel eggs and roll in sesame seeds to coat completely. Divide cauliflower rice, carrot noodles, asparagus, avocado and haloumi (optional) between bowls. Cut eggs into halves and add 1-2 eggs to each serving bowl. Add 1-2 tablespoons sauerkraut to each bowl, sprinkle with any remaining sesame seeds and serve with remaining dressing on the side."}],"hintsAndTricks":["For more flavour, gently toast your sesame seeds while eggs are steaming.","We used a spiraliser to cut our carrots.","You can use store-bought sauerkraut or refer to the Fermented beetroot and apple salsa in this collection.","Store any leftovers of each ingredient in separate sealable containers in the refrigerator for up to 2 days. Combine elements just before serving. You can enjoy this dish warm or cold.","You can substitute the asparagus with broccolini."],"basicInfo":["easy","40m","40m","4 portions"]}