{"badges":["TM5","TM6"],"usefulItems":"meat mallet or rolling pin, cling film, pastry brush, baking paper, gravy boat, cocktail stick","id":"r150898","imageLink":"https:\/\/3.bp.blogspot.com\/-1mcokIsHIdg\/XZQwC3pZ40I\/AAAAAAAAciM\/vt8dDmTFVVMkAfW7lpu5tovXng2lsYFRACLcBGAsYHQ\/s1600\/0_RVOv-oCFVhHpeFDy.png","title":"Chicken Involtini with Apples, Sweet Potatoes and Curry Sauce","publishedAt":"2017-06-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"60 g Gouda, cut in pieces"},{"content":"60 g bacon lardons"},{"content":"800 - 850 g chicken breasts, skinless"},{"content":"3 Tbsp soy sauce"},{"content":"1 tsp meat extract (e.g. Bovril, Maggi)"},{"content":"40 g olive oil"},{"content":"280 - 300 g onions, quartered"},{"content":"2 - 3 garlic cloves, to taste"},{"content":"1 pinch salt"},{"content":"400 g sweet potatoes, peeled, cut in thick slices (4 cm)"},{"content":"500 g apples (e.g. Granny Smith, Golden Delicious), cored, quartered"},{"content":"180 g cooking apples (e.g. Bramley), peeled, cored, quartered"},{"content":"1 tsp vinegar, preferably cider or rice vinegar"},{"content":"1 heaped tsp curry powder, hot or mild, adjust to taste"},{"content":"200 g water"}],"nutrition":{"protein":"59 g","fat":"22 g","uom":"per 1 portion","carbohydrates":"50 g","calories":"2745 kJ \/ 656 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place Gouda cheese in mixing bowl and grate <b>4 sec\/speed 5<b>. Transfer to a bowl and set aside."},{"content":"Place bacon in mixing bowl and sauté <b>6 min\/120°C\/\/speed 1<b>. Meanwhile, slice each chicken breast open with a sharp knife, cutting parallel to the work surface and opening each like a book. Pound lightly with a rolling pin wrapped with cling film to make them thinner."},{"content":"In a small bowl, using a pastry brush, stir together soy sauce, beef extract and 1 Tbsp olive oil. Place each chicken fillet, cut side up, on a piece of baking paper (30 cm x 40 cm) and brush centre with soy sauce mixture. Set remaining soy sauce mixture aside."},{"content":"Transfer bacon to a bowl and set aside to cool. Place onions, garlic, salt and 30 g olive oil in mixing bowl. Chop <b>3 sec\/speed 5<b>, then sauté <b>6 min\/120°C\/speed 1<b>."},{"content":"Add reserved grated cheese to cooled bacon, stir with spatula to combine and distribute along the middle of each chicken breast. Roll up chicken, wrapping them tightly with baking paper. To make sure a few holes in the Varoma dish remain unobstructed, place butterfly whisk flat in Varoma dish and arrange parcels on top. Add sweet potatoes around parcels, insert Varoma tray and add Granny Smith apple pieces on it. Set Varoma aside. Add cooking apples, vinegar, curry powder, water and remaining soy sauce mixture to mixing bowl. Set Varoma in position and cook <b>35 min\/Varoma\/speed 1<b>. Remove Varoma and set Varoma tray aside. Using a cocktail stick, prick chicken rolls to check whether juices run clear, indicating they are cooked through. If juices are pink, add 50 g water to mixing bowl, set Varoma in position and cook for a further <b>5 min\/Varoma\/speed 1<b>."},{"content":"Remove Varoma and transfer apple wedges and sweet potatoes to a serving dish. Unwrap chicken rolls, cut in 2 cm slices and transfer to serving dish. Transfer curry sauce to a gravy boat. Serve chicken, sweet potatoes and apple wedges hot with curry sauce."}],"hintsAndTricks":["If cooking apples are not very tart, add optional vinegar.<br>- The apples for steaming can be left unpeeled if desired.","<i>The sweet and spicy flavour combinations in this main course dish make it a treat for a weeknight or a special occasion. Steamed apples and sweet potatoes accompany the cheese and bacon-filled chicken roll, and the apple flavour is echoed in the curry sauce. Beef extract gives colour and umami flavour to the juicy, tender meat, and if you wish, you can add even more colour by browning the meat rolls briefly in a hot pan before serving.<\/i>","In <b>step 7,<b> instead of further steaming, pan-fry the chicken rolls to complete cooking if they appear underdone, or just to add browning."],"basicInfo":["medium","40m","1h 25m","4 portions"]}