{"badges":["TM5","TM6"],"usefulItems":"large salad bowl","id":"r150823","imageLink":"https:\/\/4.bp.blogspot.com\/-nRvsDDMUFd0\/XZMueNM_WNI\/AAAAAAAAaFs\/oA1La-HUolgPwGjmw-0riNxL9bs2Kqb2QCLcBGAsYHQ\/s1600\/0_IwIl4DKq0xWza5x4.png","title":"Salmon, Quinoa, Feta and Mixed Vegetable Salad","publishedAt":"2017-06-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"½ lemon, zest only"},{"content":"10 - 12 sprigs fresh mixed herbs (e.g. parsley, basil, chives), leaves only"},{"content":"1 garlic clove"},{"content":"½ fresh chilli"},{"content":"60 g olive oil"},{"content":"1200 g water"},{"content":"1 ½ tsp fine sea salt"},{"content":"100 g quinoa"},{"content":"600 g fresh salmon fillet, skinless (2 cm thick)"},{"content":"160 g peppers, cut in pieces"},{"content":"50 g red onions, cut in pieces"},{"content":"120 g cucumber, cut in pieces"},{"content":"150 g feta cheese, cut in pieces"},{"content":"1 tsp Dijon mustard"},{"content":"1 Tbsp white wine vinegar"},{"content":"2 pinches ground black pepper"},{"content":"300 g plum tomatoes, cut in pieces (2 cm)"},{"content":"1 avocado (150-200 g), sliced"},{"content":"100 g kale, thinly sliced"},{"content":"1 Tbsp pumpkin seeds              (optional)"},{"content":"2 Tbsp dried cranberries              (optional)"}],"nutrition":{"protein":"29 g","fat":"37 g","uom":"per 1 portion","carbohydrates":"19 g","calories":"2238 kJ \/ 534 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place lemon zest and 2-3 sprigs fresh mixed herb leaves in mixing bowl then chop <b>7 sec\/speed 9<b>. Transfer to a bowl and set aside."},{"content":"Place garlic, chilli and 30 g oil in mixing bowl, chop <b>3 sec\/speed 7<b>, then, without measuring cup, sauté <b>2 min\/120°C\/speed 1<b>. Transfer to bowl containing lemon-parsley mixture and set aside."},{"content":"Without rinsing, place water and 1 tsp salt in mixing bowl. Insert simmering basket, add quinoa and stir using spatula. Set Varoma dish and tray into position. Place salmon fillets on Varoma tray. Sprinkle fillets with reserved lemon-parsley-garlic mixture, cover Varoma and cook <b>20 min\/Varoma\/speed 1<b>. Carefully open Varoma to check that salmon is cooked. If necessary, cook a further <b>2-5 min\/Varoma\/speed 1<b>. Set Varoma aside uncovered and allow salmon to cool. Remove simmering basket with aid of spatula, transfer quinoa to a large salad bowl and allow to cool. Clean and dry mixing bowl."},{"content":"Place peppers, onions, cucumber, 100 g feta cheese, remaining fresh herbs, Dijon mustard, vinegar, remaining 30 g oil, ½ tsp salt and ground black pepper in mixing bowl and chop <b>5 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add tomatoes and avocado and mix <b>10 sec\/\/speed 2<b>. Transfer to salad bowl containing cooked quinoa. Using spatula, break steamed salmon into chunks, then add to salad. Add sliced kale and gently toss to combine. Sprinkle with pumpkin seeds (if using), dried cranberries (if using) and remaining 50 g feta. Serve cold."}],"hintsAndTricks":["Quinoa is another fantastic source of protein. Try this dish with healthy omega-3 rich salmon, or our <i>Goat’s Cheese and Caramelised Onion Quinoa Tart<\/i> on Cookidoo for a vegetarian option."],"basicInfo":["medium","30m","50m","6 portions"]}