{"badges":["TM31","TM5","TM6"],"usefulItems":"baking tray, glass jar with airtight lid, oven, refrigerator","id":"r151930","imageLink":"https:\/\/1.bp.blogspot.com\/-OaDi9wLbGGg\/XZWYiVGkBpI\/AAAAAAAAd_o\/G092H4xKP8kFT-bnii83G83M6LyRm105wCLcBGAsYHQ\/s1600\/0_CtwgnZz7-YGxNESG.png","title":"Chocolate Hazelnut Spread","publishedAt":"2018-04-10T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"60 g hazelnuts"},{"content":"60 g sugar"},{"content":"1 tsp vanilla sugar, homemade"},{"content":"10 - 20 g cocoa powder, to taste"},{"content":"90 g milk"},{"content":"170 g milk chocolate, small pieces or callets"},{"content":"60 g groundnut oil (see tip) (optional)"}],"nutrition":{"protein":"32 g","fat":"158 g","uom":"per 1 Total recipe","carbohydrates":"167 g","calories":"9214 kJ \/ 2201 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 160°C. Roast hazelnuts on a baking tray for 10 minutes then set aside and leave to cool slightly."},{"content":"Place sugar and vanilla sugar in mixing bowl then grind <b>20 sec\/speed 10<b>."},{"content":"Add reserved roasted hazelnuts and cocoa powder then grind <b>20 sec\/speed 10<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add milk and heat <b>4 min\/100°C\/speed 4<b>, then blend <b>2 min\/speed 10<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add chocolate and oil (if using) then melt <b>3 min\/50°C\/speed 3<b>."},{"content":"Transfer to a glass jar with airtight lid (see tip), leaving approx. 5 mm. Make sure that the rim of the jar is clean and close immediately. Leave to cool then serve or refrigerate until needed (see tip)."}],"hintsAndTricks":["The oil can be omitted for a more intensely flavoured spread, but the texture will not be as velvety smooth.","To prepare jar, place <b>500 g<b> water in mixing bowl. Plaece jar and lid upside down in the centre of the Varoma and steam <b>20 min\/Varoma\/speed 1<b>.<b>  Leave to drain - do not dry or touch the inside surfaces. Alternatively, thoroughly wash jar and lid in hot, soapy water. Rinse by pouring over boiling water. Prepare for filling, if needed, by placing on a clean tea towel in a roasting tin and heating in the oven at 100˚C until required.","Store hazelnut spread in the fridge for up to <b>1 week,<b> or for a few days at room temperature.","A rich and indulgent family favourite, this homemade version means you know exactly what it contains. Made using milk or dark chocolate, the capability of Thermomix means you are heating and blending all in the same bowl.","Substitute vanilla sugar with <b>½ tsp<b> natural vanilla extract, adding it in <b>step 5.<b>","Substitute some milk chocolate with dark chocolate, as desired."],"basicInfo":["easy","10m","45m","1 jar"]}