{"badges":["TM5","TM6"],"usefulItems":"meat mallet, plastic wrap, pastry brush, baking paper, toothpick, bowl, small bowl, serving dish, serving jug","id":"r156325","imageLink":"https:\/\/2.bp.blogspot.com\/-MJ-2J81CPIY\/XZQvl-rvGsI\/AAAAAAAAcdk\/2BhYM0RFTOMh0nrC1jwuP83zx6TpebadgCLcBGAsYHQ\/s1600\/0_J0Mm4lShPSwXtsyc.png","title":"Chicken rolls with apples, sweet potatoes and curry sauce","publishedAt":"2017-05-08T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"60 g Gouda cheese, cut into pieces"},{"content":"60 g bacon, cut into cubes (1 cm)"},{"content":"800 - 850 g skinless chicken breast fillets each sliced open horizontally"},{"content":"2 tbsp soy sauce"},{"content":"1 tsp Meat stock paste (refer to the recipe in The Basic Cookbook)"},{"content":"40 g olive oil"},{"content":"280 - 300 g brown onions, cut into quarters"},{"content":"2 - 3 garlic cloves, to taste"},{"content":"1 pinch salt"},{"content":"400 g sweet potatoes, peeled and cut into thick slices (4 cm)"},{"content":"500 g apples (e.g. Granny Smith, Golden Delicious), cored and cut into quarters"},{"content":"180 g cooking apples, peeled, cored and cut into quarters"},{"content":"1 tsp apple cider vinegar"},{"content":"1 heaped tsp curry powder, hot or mild, adjust to taste"},{"content":"200 g water"}],"nutrition":{"protein":"59 g","fat":"22 g","uom":"per 1 portion","carbohydrates":"50 g","calories":"2745 kJ \/ 656 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place cheese into mixing bowl and grate <b>4 sec\/speed 5<b>. Transfer into a bowl and set aside."},{"content":"Place bacon into mixing bowl and sauté <b>6 min\/120°C\/\/speed 1<b>. Meanwhile, pound chicken fillets lightly with a meat mallet wrapped with plastic wrap to flatten."},{"content":"In a small bowl, using a pastry brush, stir together soy sauce, stock paste and 1 tbsp (10 g) of the oil. Place each chicken fillet, cut side up, onto a piece of baking paper (30 cm x 40 cm) and brush centre with soy sauce mixture. Set remaining soy sauce mixture aside."},{"content":"Transfer bacon into a bowl and set aside to cool. Place onions, garlic, salt and 30 g oil into mixing bowl. Chop <b>3 sec\/speed 5<b>, then sauté <b>6 min\/120°C\/speed 1<b>."},{"content":"Add reserved grated cheese to cooled bacon cubes, stir using spatula to combine and distribute along the middle of each chicken fillet. Place each fillet onto a piece of baking paper and roll fillets tightly in baking paper and close securely. To make sure a few holes in the Varoma dish remain unobstructed, place butterfly whisk flat into Varoma dish and arrange parcels on top. Add sweet potatoes around parcels, insert Varoma tray and add apple slices (eg Granny Smith) onto it. Set Varoma aside."},{"content":"Add cooking apples, vinegar, curry powder, water and remaining soy sauce mixture into mixing bowl. Place Varoma into position, secure Varoma lid and cook <b>35 min\/Varoma\/speed 1<b>."},{"content":"Remove Varoma and set Varoma tray aside. Using a toothpick, prick chicken rolls to check whether juices run clear, indicating they are cooked through. If juices are pink, add 50 g water into mixing bowl, place Varoma in position, secure Varoma lid and cook for a further <b>5 min\/Varoma\/speed 1<b>."},{"content":"Remove Varoma and transfer apple wedges and sweet potatoes onto a serving dish. Unwrap chicken rolls, cut in 2 cm slices and transfer onto serving dish. Transfer curry sauce from mixing bowl into a serving jug. Serve chicken, sweet potatoes and apple wedges hot with the curry sauce."}],"hintsAndTricks":["The sweet and spicy flavour combinations in this main course dish make it a treat for a weeknight or a special occasion. Steamed apples and sweet potatoes accompany the cheese and bacon-filled chicken roll, and the apple flavour is echoed in the curry sauce. Beef extract gives colour and umami flavour to the juicy, tender meat, and if you wish, you can add even more colour by browning the rolls briefly in a hot pan before serving.","If the cooking apple is not very tart, add the optional vinegar.<br>- The apples for steaming can be left unpeeled if desired.","In <b>step 7,<b> instead of further steaming, pan-fry the chicken rolls to complete cooking if they appear underdone, or just to add browning."],"basicInfo":["medium","40m","1h 25m","4 portions"]}