{"badges":["TM5","TM6"],"usefulItems":"small bowl, bowl, serving dish","id":"r156324","imageLink":"https:\/\/3.bp.blogspot.com\/-jKKa-fYZtHA\/XZQwuhH9JzI\/AAAAAAAAcoQ\/IdECZXrvD3crOUXRA24W3YB9zni3WIIPgCLcBGAsYHQ\/s1600\/0_eH-FpXyAO5N_26v9.png","title":"Chicken and warm potato salad","publishedAt":"2017-05-08T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"80 g olive oil"},{"content":"1 ½ tsp ground sweet paprika"},{"content":"4 tsp salt"},{"content":"2 pinches ground black pepper"},{"content":"1 ½ tsp garlic powder"},{"content":"1 tsp dried thyme"},{"content":"1 pinch cayenne pepper"},{"content":"1 tsp ground coriander"},{"content":"1 tsp dried parsley"},{"content":"800 g skinless chicken breast fillets, cut into slices (2 cm)"},{"content":"500 g water"},{"content":"650 g potatoes, peeled and cut into cubes (2 cm)"},{"content":"3 tsp white wine vinegar"},{"content":"1 tsp sugar              (optional)"},{"content":"1 tsp dried basil"},{"content":"200 g cherry tomato, cut into halves"},{"content":"60 - 80 g rocket"}],"nutrition":{"protein":"52 g","fat":"14 g","uom":"per 1 portion","carbohydrates":"30 g","calories":"1978 kJ \/ 473 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place olive oil, sweet paprika, 2 tsp of the salt, black pepper, garlic powder and dried thyme into mixing bowl and mix <b>20 sec\/speed 8<b>. Transfer 3 tbsp of the mixture into a small bowl and set aside."},{"content":"Add cayenne pepper, coriander and dried parsley into mixing bowl and stir <b>5 sec\/speed 3<b>."},{"content":"Add sliced chicken breasts and stir <b>10 sec\/\/speed 1<b>. Transfer into a bowl and allow to marinate for 15 minutes (this time can be used to prepare the potatoes)."},{"content":"Place water and remaining 2 tsp salt into mixing bowl. Insert simmering basket and weigh potatoes into it. Place Varoma dish into position, arrange marinated chicken into Varoma dish and Varoma tray, secure Varoma lid and steam <b>20 min\/Varoma\/speed 1<b>."},{"content":"Set Varoma aside and remove simmering basket with aid of spatula. Transfer potatoes into a serving dish. Reserve cooking liquid and set aside."},{"content":"Place reserved herb-oil mixture, vinegar, sugar, dried basil and 100 g of the reserved cooking liquid into mixing bowl and mix <b>3 sec\/speed 3<b>."},{"content":"Add cherry tomatoes and rocket onto serving dish with potatoes, then pour dressing over salad. Combine gently using spatula. Serve chicken with the warm potato salad."}],"hintsAndTricks":["The salad can also be served cold. Add dressing to potatoes and allow potato salad and chicken to cool, then place both into the refrigerator. Add cherry tomatoes, rocket and chicken just before serving and stir gently to combine."],"basicInfo":["easy","25m","55m","4 portions"]}