{"badges":["TM5","TM6"],"usefulItems":"large bowl, plastic wrap, ramekin (8cm), refrigerator","id":"r156335","imageLink":"https:\/\/4.bp.blogspot.com\/-h1_6Cr0b0LA\/XZQxaKgEb7I\/AAAAAAAAcu4\/0t57zRUsPaogaH6MjkCXuzftHFUQJrsFgCLcBGAsYHQ\/s1600\/0_raH_vkoWTrbIBH5i.png","title":"Caribbean stew and steamed rice cups","publishedAt":"2017-05-08T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Caribbean stew"},{"content":"800 g boneless lamb shoulder (see variation), cut into pieces (3-4 cm)"},{"content":"50 g freshly squeezed orange juice (approx. 1 orange)"},{"content":"20 g freshly squeezed lemon juice (approx. ½ lemon)"},{"content":"60 g Worcestershire sauce"},{"content":"3 garlic cloves"},{"content":"150 g brown onions, cut into halves"},{"content":"180 g celery stalks, cut into pieces"},{"content":"2 - 4 sprigs fresh coriander"},{"content":"2 - 3 pinches dried oregano"},{"content":"2 fresh bay leaves"},{"content":"1 - 1 ½ tsp ground cayenne pepper"},{"content":"25 g oil"},{"content":"20 g raw sugar"},{"content":"50 g tomato paste"},{"content":"1 ½ tsp salt"},{"content":"450 g water"},{"isHeader":true,"content":"Steamed rice cups"},{"content":"160 g basmati rice"},{"content":"400 g water"},{"content":"4 pinches salt"},{"content":"4 tsp oil"}],"nutrition":{"protein":"45 g","fat":"23 g","uom":"per 1 portions","carbohydrates":"45 g","calories":"2438 kJ \/ 581 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Caribbean stew"},{"content":"Place a large bowl onto mixing bowl lid, weigh lamb, orange juice, lemon juice and Worcestershire sauce into it and set aside. Place garlic, onions, celery, coriander, oregano, bay leaves and cayenne pepper into mixing bowl and chop <b>5 sec\/speed 5<b>. Transfer into bowl with meat and stir to coat meat, then cover with plastic wrap and place into refrigerator to marinate for 8-24 hours."},{"content":"After marinating lamb, place oil and sugar into mixing bowl and cook <b>7 min\/Varoma\/speed 1<b>."},{"content":"Add tomato paste and cook <b>3 min\/Varoma\/speed 1<b>, then add reserved meat and marinade, salt and water. Place Varoma dish into position."},{"isHeader":true,"content":"Steamed rice cups"},{"content":"Arrange 4 heat-resistant tea cups or small mugs (8 cm, height 9 cm) into Varoma dish. Place into each cup 40 g rice, 100 g water, 1 pinch salt and 1 tsp oil. Secure Vatroma lid and cook <b>35 min\/Varoma\/\/speed <b>. To serve, invert one rice cup onto each plate, giving a firm shake downwards to unmould the rice, and serve hot with the Caribbean stew."}],"hintsAndTricks":["<i>The rich flavours of this lamb stew are enhanced by the overnight marinade with citrus juices, spices and herbs. Steaming rice in cups above the stew allows you to save time and also to present the rice in an elegant moulded shape. The original Caribbean recipe, a classic from the Dominican Republic, is traditionally made with goat meat - try ordering goat at your butcher’s for a slightly more gamey flavour.<\/i>","For a more traditional, richer flavour, use bone-in meat, increasing the amount of meat to <b>1000 g.<b><br>- <b>Caribbean goat meat stew:<b> replace lamb meat with <b>1000 g bone-in<b> goat shoulder, cut into <b>5-6 cm pieces.<b> In <b>step 4,<b> cook the stew <b>90 min\/95°C\/\/speed <b> before setting the covered Varoma with rice cups onto mixing bowl lid – then cook a further <b>30 min\/Varoma\/\/speed .<b>"],"basicInfo":["easy","25m","9h 15m","4 portions"]}