{"badges":["TM5","TM6"],"usefulItems":"melon baller, serving dish","id":"r156348","imageLink":"https:\/\/3.bp.blogspot.com\/-I7UPiY6x6P8\/XZVRhQZ5ejI\/AAAAAAAAdPg\/wHsGk5OPxuY9d3OmEZ0yB3NnzwhmBeAqwCLcBGAsYHQ\/s1600\/0_qBGnsJ5KF-a6gypH.png","title":"Tomatoes stuffed with mushrooms and nuts","publishedAt":"2017-05-08T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"50 g mixed nuts (e.g. almonds, walnuts)"},{"content":"30 g extra virgin olive oil"},{"content":"50 g brown onion, cut into halves"},{"content":"1300 g ripe tomato (5-6 cm) (see Tip)"},{"content":"100 g fresh mushrooms (e.g. button, oyster)"},{"content":"1 tsp salt"},{"content":"1 pinch ground black pepper"},{"content":"10 - 12 leaves fresh mint"},{"content":"4 - 5 sprigs fresh parsley, leaves only, plus extra to garnish"},{"content":"75 g long grain white rice"},{"content":"20 g freshly squeezed lemon juice (approx. ½ lemon)"}],"nutrition":{"protein":"11 g","fat":"22 g","uom":"per 1 portion","carbohydrates":"33 g","calories":"1644 kJ \/ 392 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place mixed nuts into mixing bowl and chop <b>8 sec\/speed 5<b>. Transfer into a bowl and set aside."},{"content":"Place 20 g of the oil and onions into mixing bowl, chop <b>5 sec\/speed 5<b>, then sauté <b>3 min\/120°C\/speed 1<b>, without measuring cup<b>. Meanwhile, cut a slice (approx. 2 cm thick) off the bottom (opposite the stem) of each tomato, making sure tomatoes fit under Varoma lid when on Varoma tray. Reserve tomato slices."},{"content":"Add 125 g of the reserved tomato slices, mushrooms, ½ teaspoon of the salt, black pepper, 6-8 of the mint leaves (or ½ tsp dried mint) and parsley into mixing bowl, chop <b>5 sec\/speed 5<b>, then cook <b>10 min\/Varoma\/speed 1<b>. Meanwhile, scoop out the tomatoes with a melon baller or spoon, reserving seeds and pulp and setting them aside with remaining reserved tomato slices. Arrange hollowed tomatoes into Varoma dish and tray with openings facing up."},{"content":"Add rice, reserved ground nuts and lemon juice into mixing bowl and mix <b>5 sec\/\/speed 3<b>. Fill tomatoes with rice mixture."},{"content":"Place reserved tomato centres and any remaining slices (approx. 500 g), remaining 4 mint leaves (or ½ tsp dried mint), ½ tsp salt and 10 g oil into mixing bowl and blend <b>5 sec\/speed 5<b>. Set Varoma in position, secure Varoma lid and steam <b>30 min\/Varoma\/speed 1<b>. Remove Varoma. Transfer sauce into a serving dish, arrange stuffed tomatoes on the sauce and garnish with fresh parsley leaves. Serve warm or cold."}],"hintsAndTricks":["<i>This recipe from Cyprus is bursting with the fresh flavours of tomato, lemon and mint. The rice mixed with nuts and mushrooms has a crunchy and almost meaty texture. Serve as a satisfying main course or as an impressive side dish.<\/i>","Choose tomatoes that are large enough to fill, yet small enough to fit under the lid on the Varoma tray <b>(5-6 cm).<b> The number of tomatoes may vary between <b>8 and<b> <b>12 depending<b> on their size and shape.","The same mixture can be used to stuff vine leaves. Vine leaves can be bought preserved or fresh. In either case, soak leaves for <b>1 minute<b> in boiling water, then drain and pat dry before filling. To fill vine leaves, you will need only <b>600-650 g tomatoes.<b> Use <b>125 g chopped<b> tomatoes instead of tomato slices and the remaining chopped tomatoes instead of reserved tomato centres and slices. Fill vine leaves and proceed as directed by the recipe.<br>- Use the same mixture to stuff kale leaves, zucchinis, capsicums, onions, or other vegetables."],"basicInfo":["medium","35m","1h 5m","3 portions"]}