{"badges":["TM5","TM6"],"usefulItems":"bowl, serving plate, plate, small bowl","id":"r156345","imageLink":"https:\/\/1.bp.blogspot.com\/-lJCOASNZ_ZM\/XZVRgpkEOiI\/AAAAAAAAdPU\/dPOQWtIX6o8bof5sOzRc0yJeN6vqVkjuACLcBGAsYHQ\/s1600\/0_q8tDfAlHvsyJ_tY9.png","title":"Asparagus with Parmesan rice and lemon sabayon sauce","publishedAt":"2017-05-08T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"30 g Parmesan cheese, crust removed and cut into pieces (3 cm)"},{"content":"1200 g water"},{"content":"1 tsp Vegetable stock paste (refer to the recipe in The Basic Cookbook)"},{"content":"200 g basmati rice"},{"content":"500 - 700 g asparagus"},{"content":"40 g extra virgin olive oil"},{"isHeader":true,"content":"Lemon sabayon sauce"},{"content":"4 egg yolks"},{"content":"½ tsp salt"},{"content":"1 pinch ground black pepper"},{"content":"10 g freshly squeezed lemon juice"}],"nutrition":{"protein":"13 g","fat":"20 g","uom":"per 1 portion","carbohydrates":"41 g","calories":"1685 kJ \/ 403 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Lemon sabayon sauce"},{"content":"Place Parmesan cheese into mixing bowl and grate <b>10 sec\/speed 10<b>. Transfer into a bowl and set aside."},{"content":"Place water and stock paste into mixing bowl, insert simmering basket and weigh basmati rice into it."},{"content":"Arrange asparagus into Varoma dish, stacking each layer in alternate directions to allow steam to circulate. Place Varoma into position, secure Varoma lid and steam <b>20 min\/Varoma\/speed 1<b>. Remove Varoma and remove simmering basket with aid of spatula, transfer rice onto a serving plate, drizzle with extra oil, cover and set aside. Check whether asparagus is cooked. If not, place Varoma back into position and steam for a further <b>5-10 min\/Varoma\/speed 1<b>."},{"content":"Set covered Varoma aside onto a plate to keep asparagus warm. Tare scale to zero and transfer 120 g of the cooking liquid into a small bowl (scale will show ‘-120 g’ when mixing bowl is set back in position), discarding the rest. Set small bowl aside. Clean and dry mixing bowl."}],"hintsAndTricks":["If using white asparagus, steam for a further <b>5 min\/Varoma\/speed 1<b> after removing simmering basket with rice."],"basicInfo":["easy","30m","1h","4 portions"]}