{"badges":["TM5","TM6"],"usefulItems":"baking paper, plate, wooden skewers, plastic wrap, bowl, serving bowl, refrigerator","id":"r156327","imageLink":"https:\/\/4.bp.blogspot.com\/-z8SIfeaI9WE\/XZQvi1k970I\/AAAAAAAAcdM\/e5oChHaC0Y4knhjCmoua63telLgsAAg8gCLcBGAsYHQ\/s1600\/0_I-jSqF9UL3lsASnc.png","title":"Chicken skewers with cumin rice and warm vegetable salad","publishedAt":"2017-05-08T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Marinated chicken skewers"},{"content":"1 ½ tsp salt"},{"content":"1 tsp ground cinnamon"},{"content":"1 tsp ground sweet paprika"},{"content":"1 tsp ground allspice (see Tips)"},{"content":"450 g skinless chicken breast fillets, cut into long thin strips (5 mm thick, 2 cm wide)"},{"content":"6 - 8 cherry tomatoes              (optional)"},{"content":"50 g brown onion"},{"content":"60 g tomato paste"},{"content":"4 - 6 sprigs fresh flat-leaf parsley, leaves only"},{"content":"80 g water"},{"content":"20 g vinegar"},{"isHeader":true,"content":"Salad dressing"},{"content":"50 g cherry tomato, cut into halves"},{"content":"15 g white wine vinegar"},{"content":"20 g olive oil"},{"content":"½ tsp salt"},{"content":"1 pinch ground black pepper              (optional)"},{"content":"2 - 3 sprigs fresh flat-leaf parsley, leaves only"},{"isHeader":true,"content":"Steamed chicken skewers, cumin rice and warm vegetable salad"},{"content":"200 g basmati rice"},{"content":"1700 g water"},{"content":"120 g carrots, cut into pieces"},{"content":"1 tsp cumin seeds              (optional)"},{"content":"1 ½ tsp salt"},{"content":"600 g mixed vegetables (e.g. capsicum, eggplant, zucchini, cauliflower, broccoli, asparagus), cut into pieces (3 cm)"}],"nutrition":{"protein":"39 g","fat":"7 g","uom":"per 1 portion","carbohydrates":"48 g","calories":"1801 kJ \/ 431 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Marinated chicken skewers"},{"content":"Place salt, cinnamon, paprika and allspice into mixing bowl and dry roast <b>5 min\/Varoma\/speed <b>, without measuring cup<b>. Meanwhile thread chicken strips onto wooden skewers (approx. 18 cm, see Tips), keeping the meat quite loose and finish by threading a cherry tomato onto each skewer. Transfer them onto a plate and set aside."},{"content":"Add onions, tomato paste, parsley, water and vinegar and chop <b>10 sec\/speed 5<b>. Transfer marinade onto plate with the skewers and roll them in the marinade. Cover with plastic wrap and place into refrigerator to marinate for minimum of 1 hour (see Tips). Rinse mixing bowl."},{"isHeader":true,"content":"Salad dressing"},{"content":"Place tomatoes, vinegar, oil, salt, pepper and parsley into mixing bowl and mix <b>10 sec\/speed 6<b>. Transfer into a bowl and set aside."},{"isHeader":true,"content":"Steamed chicken skewers, cumin rice and warm vegetable salad"},{"content":"Insert simmering basket and weigh basmati rice into it. Add 500 g of the water and wash rice <b>30 sec\/speed 7<b>. Remove simmering basket with aid of spatula and empty mixing bowl."},{"content":"Place carrots into mixing bowl and chop <b>5 sec\/speed 4.5<b>. Transfer into simmering basket with rice. Add cumin seeds to the simmering basket and mix well using spatula."},{"content":"Place 1200 g water and salt into mixing bowl and insert simmering basket. Place Varoma dish into position and weigh mixed vegetables into it. Line Varoma tray with baking paper and place marinated chicken skewers onto it. Insert Varoma tray into Varoma dish, secure Varoma lid and steam <b>20 min\/Varoma\/speed 1<b>. Set Varoma aside and remove simmering basket with aid of spatula. Transfer rice into a serving bowl, mix with a fork, cover to keep warm and set aside."},{"content":"Turn skewers in Varoma tray to help them cook evenly, place Varoma back into position, secure Varoma lid and cook a further <b>10 min\/Varoma\/speed 1<b>."},{"content":"Transfer steamed vegetables into a serving bowl and drizzle with reserved dressing. Serve chicken skewers and rice, with warm vegetable salad on the side."}],"hintsAndTricks":["Ground allspice can be replaced with a mixture of equal parts ground cinnamon, ground cloves and ground nutmeg.<br>- Long skewers can be cut to fit the Varoma tray.<br>- For a stronger flavour marinate the chicken in <b>step 2<b> for a few hours or overnight.","For a vegetarian version of this dish, replace chicken with halloumi cheese, cut into cubes (2 cm). Follow the recipe omitting the extra cooking time in <b>step 7.<b><br>- For a spicier dish add <b>½-1 tsp<b> of chilli sauce to the marinade ingredients."],"basicInfo":["medium","35m","2h","4 portions"]}