{"badges":["TM5","TM6"],"usefulItems":"large serving bowl, pie pan (approx. 9 in.), airtight jar, bowl, refrigerator, oven","id":"r157495","imageLink":"https:\/\/1.bp.blogspot.com\/-fEDd7pgqxCc\/XZWZpBBN23I\/AAAAAAAAeQI\/79QzbxsZS_cJ7vK84KP7tKaeyNmkmhXHgCLcBGAsYHQ\/s1600\/0_i25PfkUw7DcV0SdS.png","title":"Jambalaya, Spicy Soup and Fruit Crumble","publishedAt":"2017-03-24T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Creole Seasoning"},{"content":"2 ½ tbsp paprika"},{"content":"2 tbsp fine sea salt"},{"content":"2 tbsp garlic powder"},{"content":"1 tbsp ground black pepper"},{"content":"1 tbsp onion powder"},{"content":"1 tbsp cayenne pepper"},{"content":"1 tbsp dried oregano"},{"content":"1 tbsp dried thyme"},{"isHeader":true,"content":"Jambalaya, Spicy Soup and Fruit Crumble"},{"content":"4 oz all-purpose flour"},{"content":"4 oz unsalted butter, chilled (cut into ½ in. pieces)"},{"content":"3 oz old fashioned rolled oats"},{"content":"3 oz brown sugar"},{"content":"1 oz unsweetened shredded coconut"},{"content":"16 oz medium shrimp (raw), peeled and deveined"},{"content":"8 oz boneless, skinless chicken, diced into ½ in. pieces"},{"content":"½ oz olive oil"},{"content":"5 oz andouille sausage, diced into ¼ in. cubes (approx. 2 sausages)"},{"content":"14 oz fresh peaches, pitted and quartered (approx. 5 small peaches)"},{"content":"14 oz Granny Smith apples, cored, peeled and cut into eighths (approx. 4 medium apples)"},{"content":"5 oz yellow onion, quartered (approx. 1 large onion)"},{"content":"1 oz garlic cloves"},{"content":"3 ½ oz carrot, cut into 1 in. pieces (approx. 1 large carrot)"},{"content":"3 ½ oz celery, cut into 1 in. pieces (approx. 2 stalks)"},{"content":"3 ½ oz red bell pepper, cut into 1 in. strips (approx. ½ large pepper)"},{"content":"3 ½ oz green bell pepper, cut into 1 in. strips (approx. ½ large pepper)"},{"content":"3 dried bay leaves"},{"content":"1 tsp Worcestershire sauce"},{"content":"1 tsp hot sauce"},{"content":"12 oz chicken stock"},{"content":"½ tsp fine sea salt, to taste"},{"content":"¼ tsp freshly ground black pepper, to taste"},{"content":"7 oz white basmati rice"},{"content":"8 oz fresh tomatoes, diced into ½ in. pieces (approx. 2 medium tomatoes)"}],"nutrition":{"protein":"29 g","fat":"36 g","uom":"per 1 portion","carbohydrates":"97 g","calories":"3435 kJ \/ 821 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Creole Seasoning"},{"content":"Place all spices into an airtight jar, shake to mix and reserve."},{"isHeader":true,"content":"Jambalaya, Spicy Soup and Fruit Crumble"},{"content":"Place flour, butter, oats, sugar and coconut into mixing bowl and mix <b>10 sec\/speed 4<b> or until mixture resembles bread crumbs. Transfer to a bowl and set aside."},{"content":"Place Varoma dish into position and weigh in shrimp and chicken. Add olive oil and 1 tsp Creole seasoning and mix well with spatula. Weigh in andouille sausage."},{"content":"Place Varoma tray onto Varoma dish and weigh in peaches and apples. Set Varoma on a plate and refrigerate until required."},{"content":"Place onion and garlic into mixing bowl and chop <b>3 sec\/speed 5<b>."},{"content":"Add carrot, celery and bell peppers and chop <b>3 sec\/speed 4.5<b>."},{"content":"Add bay leaves, Worcestershire sauce, hot sauce, stock, salt and pepper. Insert simmering basket into mixing bowl and weigh in rice. Remove simmering basket with spatula and rinse rice under cold running water until water runs clear. Insert simmering basket with rice back into mixing bowl. Add tomatoes onto rice and steam <b>10 min\/Varoma\/\/speed 2<b>."},{"content":"Place Varoma with meats, shrimp and fruit into position and secure Varoma lid. Steam <b>8 min\/Varoma\/\/speed 2<b>. Stir meats and shrimp in Varoma dish with spatula to ensure even cooking. Secure Varoma lid and steam a further <b>8 min\/\/speed 2<b>. With aid of spatula, remove simmering basket with rice and tomatoes. Transfer to a large serving bowl, add steamed meats and shrimp. Gently mix through with spatula. Set aside and keep warm."},{"content":"Transfer soup from mixing bowl and keep warm. Meanwhile, preheat oven to 400°F."},{"content":"Place steamed fruit in a pie pan (approx. 9 in.) and cover with reserved crumble topping. Bake 25-35 minutes (400°F) until golden."},{"content":"Serve Jambalaya in a large serving bowl with the Spicy Soup either on the side or poured over the top of the Jambalaya."}],"hintsAndTricks":["Crumble topping is optional:  omit crumble if you prefer a simple dessert of steamed fruit.","Be sure to remove the bay leaf before serving.","To save time purchase shrimp already peeled and deveined and chicken breast that is already cubed."],"basicInfo":["medium","25m","1h 45m","6 portions"]}