{"badges":["TM5","TM6"],"usefulItems":"paper towels, large freezer bag, refrigerator","id":"r164642","imageLink":"https:\/\/4.bp.blogspot.com\/-ghqwakVMrEY\/XZMt34t5WWI\/AAAAAAAAZ-c\/Yf8mmRgo7gs8ZZMP0nlROLKuhEXBxfIswCLcBGAsYHQ\/s1600\/0_2il5mF8refTDWqON.png","title":"Turkey Breast with Creamy Potato Soup","publishedAt":"2017-10-27T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Dry Brine"},{"content":"½ oz fresh rosemary, leaves only"},{"content":"2 oz salt"},{"content":"2 oz dried apple"},{"content":"3 heaping tbsp black peppercorns"},{"content":"1 lemon, thin peel only, no pith"},{"content":"1 oz coriander seeds"},{"content":"1 oz juniper berries"},{"content":"2 dried bay leaves"},{"isHeader":true,"content":"Spice Rub"},{"content":"2 limes, thin peel only, no pith"},{"content":"2 lemons, thin peel only, no pith"},{"content":"2 tsp salt"},{"content":"1 tsp freshly ground black pepper"},{"content":"2 tsp ground turmeric"},{"content":"1 pinch saffron"},{"content":"2 garlic cloves"},{"content":"2 dried chilies"},{"content":"1 heaping tsp sweet paprika"},{"content":"1 heaping tsp sugar"},{"isHeader":true,"content":"Turkey Breast and Potato Soup"},{"content":"35 oz turkey breast half, skin on, bone in"},{"content":"3 oz red onions, quartered"},{"content":"2 oz unsalted butter"},{"content":"32 oz chicken stock"},{"content":"30 oz Yukon gold potatoes, peeled and quartered"},{"content":"freshly ground black pepper, to taste"},{"content":"salt, to taste"},{"content":"fresh rosemary, to garnish"}],"nutrition":{"protein":"34 g","fat":"11 g","uom":"per 1 portion","carbohydrates":"32 g","calories":"1556 kJ \/ 372 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Dry Brine"},{"content":"Place rosemary, salt, dried apple, peppercorns, lemon peel, coriander seeds, juniper berries and bay leaves into mixing bowl and grind <b>Turbo\/2 sec\/2-3 times<b>. Transfer to a bowl and set aside."},{"isHeader":true,"content":"Spice Rub"},{"content":"Place lime and lemon peels, salt, pepper, turmeric, saffron, garlic, chilies, sweet paprika and sugar into mixing bowl and grind <b>1 min\/speed 10<b>. Transfer to a bowl and set aside."},{"isHeader":true,"content":"Turkey Breast and Potato Soup"},{"content":"Place Varoma dish onto mixing bowl lid and weigh in turkey. Rub turkey breast all over with reserved Dry Brine, place into a large freezer bag, remove as much air as possible and refrigerate for 24 hours."},{"content":"Remove turkey breast from plastic bag, rinse under cold running water removing as much brining mixture as possible. Pat dry with paper towels."},{"content":"Rub turkey with reserved Spice Rub, getting under skin as much as possible. Place prepared turkey into Varoma dish, place onto inverted Varoma lid and set aside."},{"content":"Place onion and butter into mixing bowl and chop <b>5 sec\/speed 5<b> scrape down sides of mixing bowl with spatula. Add stock, place Varoma into position, secure Varoma lid and steam <b>20 min\/Varoma\/speed 2<b>."},{"content":"Remove Varoma and turn turkey breast over to ensure even cooking. Add potatoes into mixing bowl, place Varoma back into position, secure Varoma lid and steam a further <b>20 min\/Varoma\/speed 2<b>."},{"content":"Check if turkey has reached 165°F using a meat thermometer or by inserting a sharp knife into the thickest part of the breast. If the juices that run out are clear, turkey is done. If necessary steam a further <b>10 min\/Varoma\/speed 2<b>."},{"content":"Remove Varoma and transfer turkey to a serving platter, remove skin and keep turkey warm. Adjust seasonings in soup and increasing speed gradually blend <b>1 min\/speed 8<b>. Garnish with a sprig of rosemary and serve soup as a starter while turkey rests. Slice turkey and serve."}],"hintsAndTricks":["If using two turkey breasts place one in the Varoma tray and one in the Varoma dish, half way through the cooking swap them around. You may need to increase the cooking time.","After steaming turkey breast, keep spices left in Varoma dish to make a gravy. Place leftover spices, 6 oz water, 1 tsp vegetable stock paste and 1 tbsp corn starch into mixing bowl and mix <b>7 min\/195°F\/speed 4<b>.","For added flavor: increase brine spice by 1 oz each fresh rosemary, ground coriander and juniper berries.","Turkey may also be served or garnished with homemade Spiced Cranberry Orange Sauce."],"basicInfo":["easy","45m","27h","6 portions"]}