{"badges":["TM5","TM6"],"usefulItems":"paper towel, serving platter, refrigerator","id":"r165826","imageLink":"https:\/\/2.bp.blogspot.com\/-8lhWlvk0-2A\/XZMvU9zGh3I\/AAAAAAAAaQc\/BOj3Qp2zuKwXuybPWu7RtaeNGY7Vma23ACLcBGAsYHQ\/s1600\/0_d6o-oeDUWktg2OiP.png","title":"Green Chili Deviled Eggs","publishedAt":"2017-11-10T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"14 oz water"},{"content":"6 jumbo eggs"},{"content":"5 sprigs cilantro, leaves only (approx. 15 leaves), plus extra to garnish"},{"content":"1 oz fresh jalapeño chili (approx. 1 jalapeño), plus extra to garnish"},{"content":"½ oz anchovies, preserved in olive oil (approx. 5 anchovies) (optional)"},{"content":"1 oz diced green chilies, e.g. New Mexico Hatch chilies or serrano, mild or to taste"},{"content":"½ oz mayonnaise"},{"content":"½ oz Dijon mustard"},{"content":"½ tsp ground turmeric"},{"content":"¼ ground cumin"},{"content":"1 tsp lime juice"},{"content":"&frac18; pinch salt, to taste"},{"content":"&frac18; pinch freshly ground black pepper, to taste"},{"content":"smoked Spanish paprika, ground, to garnish"}],"nutrition":{"protein":"4 g","fat":"3 g","uom":"per 1 piece","carbohydrates":"4 g","calories":"230 kJ \/ 55 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place water into mixing bowl, insert simmering basket, place in eggs and cook <b>14 min\/Varoma\/speed 1<b>."},{"content":"Immediately remove simmering basket with spatula and place simmering basket with eggs under cold running water to stop the cooking process. Crack egg shells under cool running water. Peel eggs carefully then gently pat eggs dry with paper towel. Slice eggs in half lengthwise and gently remove cooked egg yolks and set aside. Place egg whites on a serving platter. Clean mixing bowl."},{"content":"Place cilantro, jalapeño, anchovy fillets and green Hatch chilies into mixing bowl and chop <b>5 sec\/speed 5<b>. Add reserved egg yolks, mayonnaise, Dijon mustard, turmeric, cumin, lime juice, salt and pepper into mixing bowl and mix <b>10 sec\/speed 3<b>. Scrape down sides of mixing bowl with spatula and mix <b>3 sec\/speed 4<b>."},{"content":"Evenly distribute heaping teaspoons of yolk mixture into the cooked egg whites. Garnish with finely chopped cilantro and jalapeño, sprinkle with paprika and refrigerate until serving."}],"hintsAndTricks":["Replace Dijon mustard with other mustard of choice e.g. hot mustard.","Lime juice can be replaced with white vinegar.","For a decorative look: spoon egg yolk mixture into a piping bag with a large tip and pipe filling into the egg white halves.","For additional heat add ¼ tsp of hot sauce when adding lime juice.","Fresh Hatch chilies can be replaced with canned diced Hatch chilies."],"basicInfo":["easy","20m","40m","12 pieces"]}