{"badges":["TM5","TM6"],"usefulItems":"nut milk bag or four layers of cheesecloth, dehydrator, thermometer, sterilized jars with twist off lids, refrigerator","id":"r166503","imageLink":"https:\/\/1.bp.blogspot.com\/-fXLGZo1ArDQ\/XZaoElt54bI\/AAAAAAAAhGw\/3nmUmyJL0CUIbo2ZdV_g1wRhOJ7STiYCQCLcBGAsYHQ\/s1600\/0_dt6N4RYsES5MXtOQ.png","title":"Coconut Milk Yogurt","publishedAt":"2017-11-10T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"11 oz desiccated coconut, unsweetened"},{"content":"27 oz water"},{"content":"2 tbsp tapioca flour"},{"content":"2 probiotic capsules, powder only, casings removed"},{"content":"1 tbsp maple syrup"}],"nutrition":{"protein":"21 g","fat":"201 g","uom":"per 1 Total recipe","carbohydrates":"102 g","calories":"9083 kJ \/ 2171 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place coconut into mixing bowl and grind <b>20 sec\/speed 10<b>."},{"content":"Add water and blend <b>1 min\/speed 9<b>. Strain through nut milk bag or four layers of cheesecloth, squeezing out as much liquid as possible. Set coconut milk aside and keep the pulp for another use. Rinse mixing bowl."},{"content":"Return reserved coconut milk into mixing bowl, add tapioca flour and cook <b>6 min\/140째F\/speed 5<b>. Leave coconut milk in mixing bowl with lid and measuring cup, set aside to cool (approx. 1 hr.), or until contents reach 100째F."},{"content":"Once cooled to 100째F, add probiotic powder and maple syrup and mix <b>30 sec\/speed 8<b>."},{"content":"Pour mixture into sterilized jars, seal, place into a dehydrator, and incubate for 16 hours at 110째F. Yogurt may separate, split or become firm, this is normal."},{"content":"Remove jars from dehydrator and chill in refrigerator for 3 hours."},{"content":"Place chilled yogurt into mixing bowl and blend <b>10 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula and blend a further <b>10 sec\/speed 6<b>. Transfer into jars and refrigerate. Serve chilled."}],"hintsAndTricks":["Never fill yogurt to the top of an airtight jar prior to incubation, always leave room for yogurt to expand. Once sealed, do not disturb the jars while incubating.","<b>Remember, too high a temperature will kill the bacterial culture; too low of a temperature will prevent proper fermentation.<b>","Sealed yogurt jars will keep up to two weeks, once refrigerated.","If yogurt develops a green, grey or pink color, discard it as it has been contaminated.","Probiotic capsules can be found at vitamin shops or health food stores. Make sure to buy capsules with casings that can be separated and removed, not hard caplets.","Use a high-quality probiotic that contains a few of: Lactobacillus acidophilus, Bifidobacterium bifidum, Bifidobacterium lactis and Streptococcus thermophilus.","You can also use a few tablespoons of store-bought yogurt with <b>live<b> cultures. Try coconut, soya, or if dairy is tolerated, use cow's milk yogurt to help stabilize.","To ensure Coconut Milk Yogurt is truly gluten-free, check manufacturer's notes on label of probiotic capsules.","Water can be replaced with coconut water, keffir or filtered water."],"basicInfo":["medium","20m","20h","1"]}