{"badges":["TM5","TM6"],"usefulItems":"large bowl, serving platter","id":"r166331","imageLink":"https:\/\/3.bp.blogspot.com\/-H_3IXfIoni0\/XZQFernU4UI\/AAAAAAAAbzM\/mo73u4RdW0oXpycfo9OZHsrDcFkImzBxgCLcBGAsYHQ\/s1600\/0_4wRToggfE8NHkYJO.png","title":"Chicken with couscous and saffron","publishedAt":"2018-10-15T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"250 g couscous"},{"content":"1 piece fresh ginger (2 cm)"},{"content":"2 garlic cloves"},{"content":"1500 g chicken pieces (thighs, drumsticks and breast cut into quarters), skinless and boneless"},{"content":"20 g olive oil"},{"content":"100 g raisins"},{"content":"1 ½ tsp ground cumin"},{"content":"½ tsp ground cinnamon"},{"content":"½ tsp ground turmeric              (optional)"},{"content":"2 tsp salt"},{"content":"2 pinches freshly ground black pepper"},{"content":"700 g water"},{"content":"1 - 2 pinches saffron"},{"content":"600 g red onions, cut into slices (5 mm)"},{"content":"240 g dried chickpeas, soaked in 800 g water the day before, rinsed and drained"}],"nutrition":{"protein":"63.4 g","fat":"15.5 g","uom":"per 1 portion","carbohydrates":"71 g","calories":"2832 kJ \/ 677 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place a large bowl onto mixing bowl lid, weigh in couscous and set aside."},{"content":"Place ginger and garlic into mixing bowl and chop <b>3 sec\/speed 9<b>. Transfer to a large bowl."},{"content":"Place large bowl with ginger-garlic mixture onto mixing bowl lid and add chicken pieces, olive oil, and raisins into it and season with 1 tsp cumin, cinnamon, turmeric, raisins,1 tsp salt and 1 pinch pepper. Mix well with spatula to coat all chicken pieces and set aside."},{"content":"Place water, saffron, ½ tsp cumin, 1 tsp salt, 1 pinch pepper, 200 g sliced onions and drained and rinsed chickpeas  into mixing bowl. Place Varoma dish into position, distribute 200 g sliced onions in Varoma dish, place marinated chicken pieces on top and cover with 200 g sliced onions, steam <b>20 min\/Varoma\/\/speed 1<b>."},{"content":"Carefully open Varoma and stir chicken to ensure even cooking, close Varoma again and steam a further <b>20 min\/Varoma\/\/speed 1<b>."},{"content":"Remove Varoma and set aside. Insert simmering basket and strain some of the liquid from mixing bowl over the reserved couscous (enough to cover the couscous plus 1½ cm on top). Mix gently with a fork and allow to rest for 15 minutes."},{"content":"Remove simmering basket, set Varoma back in position, stir chicken again, cover Varoma and steam a further <b>15 min\/Varoma\/\/speed 1<b>. Empty couscous onto a wide, deep platter, make a hole in the middle and fill with chicken. Pour over the whole content of mixing bowl (chickpeas and stock). Serve hot."}],"hintsAndTricks":["For a more intense flavour, marinate the chicken prepared in <b>step 2<b> overnight in the refrigerator. Continue the next day with the preparation from step 3.","When using canned chickpeas, rinse and drain them well and add them to the mixing bowl at the end of step 5."],"basicInfo":["easy","15m","1h 15m","6 portions"]}