{"badges":["TM5","TM6"],"usefulItems":"bowl, ladle, plate, non-stick frying pan, tea towel, refrigerator, stove","id":"r167898","imageLink":"https:\/\/2.bp.blogspot.com\/-HbcQF2a6f_A\/XZXZ7oXwHDI\/AAAAAAAAgNo\/IbYTMOV89QUEdyym60Qk8Gg2Z7ufYo5OwCLcBGAsYHQ\/s1600\/0_oms8PgaNJHeJ8t6l.png","title":"Crêpes with herbs","publishedAt":"2018-10-15T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"40 g Parmesan cheese, cut into pieces (3 cm)"},{"content":"10 sprigs fresh mint, leaves only, washed and dried"},{"content":"10 sprigs fresh parsley, leaves only, washed and dried"},{"content":"10 g spring onions, cut into pieces (3 cm)"},{"content":"4 eggs"},{"content":"40 g olive oil"},{"content":"500 g milk"},{"content":"200 g flour"},{"content":"½ tsp salt"},{"content":"1 pinch freshly ground black pepper"},{"content":"5 - 10 g sunflower oil for frying"}],"nutrition":{"protein":"5.6 g","fat":"7.8 g","uom":"per 1 piece","carbohydrates":"12.7 g","calories":"602 kJ \/ 144 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place Parmesan cheese into mixing bowl and grate <b>10 sec\/speed 9<b>. Transfer to a bowl and set aside."},{"content":"Place mint leaves, parsley leaves and spring onions into mixing bowl and chop <b>10 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add ground Parmesan, eggs, olive oil, milk, flour, salt and black pepper and mix <b>20 sec\/speed 5<b>. The batter should have the consistency of liquid cream. If it seems too thick, add a little milk and combine using spatula. Refrigerate and allow batter to rest for at least 20 minutes before using."},{"content":"Lightly grease a non-stick frying pan with sunflower oil and heat on medium heat. Pour in a ladle of batter, twirling the pan as you pour to cover base of pan completely. Cook for 2-3 minutes or until edges of crêpe are light golden. Turn crêpe over and cook for a further 1 minute. Transfer to a plate and cover with a kitchen towel to keep warm. Repeat with remaining batter. Serve warm."}],"hintsAndTricks":["Crêpes can be served with various fillings (e.g. butter, yogurt and a sprinkle of sumac or sour cream and salmon).","Crêpes can be frozen for later use. Place a piece of baking paper or cling film between each crêpe before freezing so they can be easily defrosted. After defrosting, wrap crêpes in aluminium foil and warm in a preheated oven (150ºC) for <b>5-10 minutes.<b>"],"basicInfo":["easy","30m","1h","12 pieces"]}