{"badges":["TM5","TM6"],"usefulItems":"baking trays, baking paper, tea towel, cooling rack, baking tray and paper, ma'amoul mould, oven","id":"r168228","imageLink":"https:\/\/4.bp.blogspot.com\/-fBZYRzsp3ak\/XZWr2enaRrI\/AAAAAAAAft4\/9PDcJCHmfk4wr-LM-v3yfNB5CTWY2ocQwCLcBGAsYHQ\/s1600\/0_x5g3ioy9xUCBKkaI.png","title":"Stuffed semolina cookies (ma'amoul)","publishedAt":"2018-10-15T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Dough"},{"content":"600 g butter, cut in pieces"},{"content":"20 g dried yeast"},{"content":"1000 g medium wheat semolina"},{"content":"500 g fine semolina"},{"content":"100 g sugar"},{"content":"6 mastic gum grains"},{"content":"14 mahleb seeds"},{"content":"150 g rose water"},{"content":"70 g blossom water"},{"content":"200 g water"},{"isHeader":true,"content":"Filling"},{"content":"550 g pistachio nuts, shelled, unsalted"},{"content":"30 g sugar"},{"content":"25 g blossom water"},{"content":"50 g rose water"},{"isHeader":true,"content":"Assembly"},{"content":"100 g icing sugar"}],"nutrition":{"protein":"6.9 g","fat":"20.4 g","uom":"per 1 piece","carbohydrates":"37 g","calories":"1502 kJ \/ 359 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Dough"},{"content":"Place 300 g butter and 10 g dried yeast into mixing bowl and melt <b>4 min\/60°C\/speed 2<b>. Transfer into a bowl and set aside."},{"content":"Place a bowl onto mixing bowl lid, weigh in 500 g medium semolina and 250 g fine semolina. Add melted butter, mix with spatula, cover and set aside for 3 hours."},{"content":"Place remaining 300 g butter and remaining 10 g dried yeast into mixing bowl and melt <b>4 min\/60°C\/speed 2<b>. Transfer into a bowl and set aside."},{"content":"Place another bowl onto mixing bowl lid, weigh in remaining 500 g medium semolina and remaining 250 g fine semolina flour. Add melted butter, mix with spatula, cover and set aside for 3 hours."},{"content":"Place 50 g sugar, 3 mastic gum grains and 7 mahleb seeds into clean and dry mixing bowl and grind <b>10 sec\/speed 10<b>."},{"content":"Add first semolina mixture, 75 g rose water, 35 g blossom water and mix <b>20 sec\/speed 6<b> with aid of spatula."},{"content":"Add 100 g water, mix <b>10 sec\/speed 6<b>, then knead <b>1 min\/<b>. Transfer into a bowl and set aside."},{"content":"Place remaining 50 g sugar, remaining 3 mastic gum grains and remaining 7 mahleb seeds into clean and dry mixing bowl and grind <b>10 sec\/speed 10<b>."},{"content":"Add second semolina mixture, remaining 75 g rose water, remaining 35 g blossom water and mix <b>20 sec\/speed 6<b> with aid of spatula."},{"content":"Add 100 g water, mix <b>10 sec\/speed 6<b>, then knead <b>1 min\/<b>. Transfer into bowl with other dough and set aside for 30 minutes."},{"isHeader":true,"content":"Filling"},{"content":"Place pistachio nuts and sugar into mixing bowl and chop <b>10 sec\/speed 5<b>."},{"content":"Add blossom water and rose water and mix <b>10 sec\/speed 3<b> with aid of spatula."},{"isHeader":true,"content":"Assembly"},{"content":"Preheat oven to 200ºC. Line 2 baking trays with baking paper and set aside."},{"content":"Divide dough into 6 equal pieces and roll into a log. Divide each log into 8 equal pieces and roll into a ball (approx. 3 cm)."},{"content":"Flatten each ball between the bottom part of your palms and shape into a flat circle (Ø 9-10 cm). Form a small cup of dough and stuff with 1 heaped teaspoon of pistachio mixture and close carefully, rolling smooth. Shape into a semi-sphere (Ø 4 cm)."},{"content":"Place the semi-sphere in the ma’amoul mould, press gently but firmly. Place a tea towel on the border of the table then invert the mould, tapping the end of the mould on the tea towel so that formed cookie will fall out. Transfer formed cookies on prepared baking trays and bake for 12-15 minutes (200ºC) until slightly golden. Transfer to a cooling rack, sprinkle with icing sugar and allow to cool before serving."}],"hintsAndTricks":["Replace pistachio or walnut filling with date filling (see Biscuits with date, pistachio and cardamom filling recipe).","Instead of shaping the semolina cookies with a ma’amoul mould, it is possible to realize the characteristic decoration pinching the dough with a pastry crimper or a fork."],"basicInfo":["advanced","35m","4h","48 pieces"]}