{"badges":["TM5","TM6"],"id":"r170300","imageLink":"https:\/\/3.bp.blogspot.com\/-SY-MSP3LLTg\/XZQwzWGKe_I\/AAAAAAAAcpM\/TjxOxmE9R0s9pwF9TEFJFBR1CiTGWBXdwCLcBGAsYHQ\/s1600\/0_fRrwgoUGiPiB0l9T.png","title":"Moroccan Chicken and Couscous","publishedAt":"2017-05-29T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"1 ½ Tbsp garam masala"},{"content":"3 tsp ground turmeric"},{"content":"1 ½ tsp fine sea salt"},{"content":"¾ tsp ground black pepper"},{"content":"600 g chicken thighs, boneless and skinless, cut in bite size pieces"},{"content":"250 g couscous"},{"content":"630 g water"},{"content":"30 g sunflower oil"},{"content":"10 sprigs fresh flat-leaf parsley, leaves only"},{"content":"3 garlic cloves"},{"content":"80 g onions, cut in halves"},{"content":"1 Tbsp sunflower oil"},{"content":"60 g green olives, pitted"},{"content":"1 tsp chicken stock paste"},{"content":"1 lemon, zest and juice"}],"nutrition":{"protein":"44 g","fat":"15 g","uom":"per 1 portion","carbohydrates":"44 g","calories":"2073 kJ \/ 496 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Combine garam masala, ground turmeric, salt and black pepper in a small bowl. Spread half on a plate, toss the chicken thighs in the spice mixture until completely coated and arrange them in Varoma dish, make sure that a few holes remain unobstructed to allow steam to circulate. Reserve remaining spice mixture."},{"content":"Place a bowl on mixing bowl lid, weigh couscous, 250 g water and sunflower oil in it, mix together with a fork and set aside."},{"content":"Place parsley in mixing bowl and chop <b>4 sec\/speed 6<b>.  Transfer to a bowl and set aside."},{"content":"Place garlic cloves and onions in mixing bowl and chop <b>4 sec\/speed 5<b>. Scrape down sides of mixing bowl using spatula."},{"content":"Add 1 tbsp sunflower oil, remaining spice mixture and sauté <b>4 min\/120°C\/speed 1<b>. Meanwhile, insert Varoma tray in Varoma dish. Fluff couscous with a fork and transfer and distribute it on Varoma tray."},{"content":"Add 380 g water, green olives, chicken stock paste, lemon zest and juice in mixing bowl, set Varoma in position and steam <b>20-23 min\/Varoma\/\/speed 1<b>. Remove Varoma, add the cooked chicken, half of the steamed couscous and half of the reserved chopped parsley to sauce in mixing bowl, combine using spatula."},{"content":"Serve chicken and couscous hot in sauce, with the remaining steamed couscous. Garnish with remaining chopped parsley."}],"basicInfo":["easy","25m","45m","4 portions"]}