{"badges":["TM5","TM6"],"usefulItems":"springform pan (10 in.), parchment paper, rolling pin, cling wrap","id":"r174137","imageLink":"https:\/\/1.bp.blogspot.com\/-Vox-ZXlQZiI\/XZWeMZ7Fn_I\/AAAAAAAAewU\/WhLFBabfg5suIIK41xOdC7AKnn3GTQRpQCLcBGAsYHQ\/s1600\/0_V1LNJE6juKCMdQr2.png","title":"Leek Pie","publishedAt":"2017-05-26T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"7 oz all-purpose flour"},{"content":"3 ½ oz unsalted butter, chilled, cut into pieces, plus extra to grease"},{"content":"3 ½ oz cream cheese"},{"content":"1 tsp baking powder"},{"content":"1 ½ tsp salt, divided"},{"content":"7 oz Gouda, cut into ¾ in. pieces"},{"content":"8 ½ oz leeks, green part, cut into 1 in. pieces (see Tip)"},{"content":"5 ½ oz leeks, white part, cut into ⅛ in. rounds"},{"content":"14 oz water"},{"content":"7 oz heavy whipping cream"},{"content":"4 large eggs"},{"content":"5 ½ oz ham, diced"},{"content":"¼ tsp ground black pepper"},{"content":"1 pinch ground nutmeg"}],"nutrition":{"protein":"38 g","fat":"62 g","uom":"per 1 slice","carbohydrates":"45 g","calories":"3727 kJ \/ 891 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 400°F. Line the base of a springform pan with parchment, grease sides of pan and set aside."},{"content":"Place flour, butter, cream cheese, baking powder and 1 tsp salt into mixing bowl and knead <b>3 min\/<b>. Transfer dough to a floured surface and form into a ball."},{"content":"Roll dough out between 2 sheets of cling wrap to a circle (approx. 14 in.) with a rolling pin. Line prepared pan with rolled dough and gently push into base and around edges up to 2 inches high. Prick base with a fork to avoid air bubbles and pre-bake for 10 minutes (400°F). Meanwhile, place cheese into mixing bowl and grate <b>10 sec\/speed 5<b>. Transfer to a bowl and set aside."},{"content":"Place green leeks into mixing bowl and chop <b>10 sec\/speed 5<b>."},{"content":"Add chopped white leeks and water and cook <b>12 min\/Varoma\/speed 1<b>. Drain leeks through simmering basket, place leeks into pre-baked crust and discard water."},{"content":"Reduce oven temperature to 350°F."},{"content":"Place reserved grated cheese, cream, eggs, ham, pepper, ½ tsp salt and nutmeg into mixing bowl and mix <b>15 sec\/\/speed 4<b>. Pour over the leeks,  stir through with spatula and bake for 45 minutes (350°F). Cut into pieces and serve hot."}],"hintsAndTricks":["If using only the white part of the leek you will need approximately 10 leeks. If using the white and green parts of the leek you'll need approximately 3 leeks."],"basicInfo":["medium","35m","1h 45m","8 slices"]}