{"badges":["TM31","TM5","TM6"],"usefulItems":"tea towel, non-stick pan (Ø 22 cm), ladle, hob","id":"r178863","imageLink":"https:\/\/2.bp.blogspot.com\/-Egf4LaE-mLE\/XZXYpQkzQaI\/AAAAAAAAgAU\/48nMscq4ZMULRZMPsofwP_MTw3YWT2xyQCLcBGAsYHQ\/s1600\/0_Qx3k4Yz2wzUsgvxm.png","title":"Crêpes","publishedAt":"2018-04-10T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"50 g butter, unsalted, plus extra for frying"},{"content":"500 g milk"},{"content":"200 g water"},{"content":"250 g plain flour"},{"content":"4 eggs"},{"content":"1 pinch salt"}],"nutrition":{"protein":"7 g","fat":"9 g","uom":"per 1 piece","carbohydrates":"21 g","calories":"823 kJ \/ 197 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place butter in mixing bowl and melt <b>2 min\/70°C\/speed 2<b>."},{"content":"Add milk, water, flour, eggs and salt to mixing bowl and mix <b>20 sec\/speed 4<b>. The batter should have the consistency of liquid cream. If it seems too thick, add a little milk. Allow batter to rest for at least 30 minutes before using."},{"content":"Lightly grease a non-stick frying pan with butter and heat on medium-high. Pour in a small ladle of batter, twirling the pan as you pour to cover base of pan completely. Cook for 2-3 minutes or until edges of crêpe are light golden. Turn crêpe over and cook for a further 1 minute. Transfer to a plate and cover with a tea towel to keep warm. Repeat with remaining batter. Serve warm."}],"hintsAndTricks":["To replace butter with oil, omit <b>step 1<b> and add <b>50 g oil<b> along with all other ingredients in <b>step 2.<b> Use oil instead of butter for frying.","Flavour the crêpes in <b>step 2:<b> add <b>40 g vanilla<b> sugar, <b>1 tsp grated<b> orange zest, or <b>80 g sugar<b> and <b>2 tbsp rum.<b>","Crêpes can be served with sweet or savoury fillings.","Crêpes can be frozen for later use. Place a piece of baking paper or cling film between each crêpe before freezing so they can be easily defrosted. After defrosting, wrap crêpes in aluminium foil and warm in a preheated oven (150°C) for <b>5-10 minutes.<b>"],"basicInfo":["easy","45m","1h 15m","10 pieces"]}