{"badges":["TM5","TM6"],"usefulItems":"cling film, fine mesh sieve, long sharp knife, jug, ice cream machine, fridge, freezer","id":"r178688","imageLink":"https:\/\/4.bp.blogspot.com\/-wu0zgo4khIk\/XZWc2pBW09I\/AAAAAAAAefo\/s3KDwZ6b_08wFcxTijI6EHsFi43S__NPgCLcBGAsYHQ\/s1600\/0_7_YUJifeNVt49Fv_.png","title":"Chocolate and Sesame Ganache","publishedAt":"2017-10-09T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Chocolate and Sesame Ganache"},{"content":"125 g double cream"},{"content":"½ tsp cocoa powder"},{"content":"50 g liquid glucose"},{"content":"¾ tsp fine sea salt"},{"content":"200 g dark chocolate (64%), small pieces or callets"},{"content":"200 g milk chocolate, small pieces or callets"},{"content":"3 egg yolks, from medium eggs"},{"content":"50 g sesame oil"},{"content":"25 g vegetable oil"},{"content":"250 g double cream, semi whipped (soft peak stage)"},{"isHeader":true,"content":"Ginger Ice Cream"},{"content":"750 g whole milk"},{"content":"250 g double cream"},{"content":"75 g liquid glucose"},{"content":"40 g trimoline"},{"content":"30 g milk powder"},{"content":"50 g fresh root ginger, grated"},{"content":"200 g egg yolks"},{"content":"100 g caster sugar"},{"content":"20 g stem ginger in syrup, syrup only"},{"content":"50 g stem ginger, chopped in small pieces"},{"isHeader":true,"content":"Pear Purée"},{"content":"3 pears, medium, peeled, cored (approx. 300 g)"},{"content":"30 g unsalted butter"},{"content":"50 g caster sugar"},{"content":"½ lemon, juice only"},{"isHeader":true,"content":"Garnish"},{"content":"16 halved walnuts, for grating over plates"},{"content":"4 pears, medium, peeled, sliced (1 mm) then cut in 2 cm discs"},{"content":"coriander cress, for garnish"}],"nutrition":{"protein":"11 g","fat":"60 g","uom":"per 1 portion","carbohydrates":"54 g","calories":"3347 kJ \/ 806 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Chocolate and Sesame Ganache"},{"content":" <b>Insert butterfly whisk<b>. Place 125 g double cream, cocoa powder, glucose and salt in mixing bowl then mix <b>2 min\/50°C\/speed 2<b>."},{"content":"Without measuring cup, set <b>speed 1<b> and slowly add dark chocolate and milk chocolate through hole in mixing bowl lid. Melt <b>5 min\/40°C\/speed 1<b>. Transfer to a bowl and set aside. Clean mixing bowl and butterfly whisk."},{"content":" <b>Insert butterfly whisk<b>. Place egg yolks in mixing bowl then whisk <b>3 min\/speed 4<b>, until pale and creamy."},{"content":"Place a jug on mixing bowl lid then weigh in sesame oil and vegetable oil. Without measuring cup, set <b>speed 3<b>. Slowly drizzle in oils. Fold into chocolate mixture. Then fold in semi-whipped cream."},{"content":"Using cling film, form mixture into 4 x 32 cm x Ø 3 cm logs. Place in fridge to set for approx. 6 hours, preferably overnight. Clean mixing bowl."},{"isHeader":true,"content":"Ginger Ice Cream"},{"content":"Place milk, double cream, glucose, trimoline, milk powder and ginger in mixing bowl then boil <b>5 min\/100°C\/speed 5<b>. Transfer to a bowl, leave to cool, then allow to infuse overnight in the fridge. Clean mixing bowl."},{"content":"The next day, strain infused liquid and place in mixing bowl."},{"content":"Add egg yolks, sugar and syrup then cook <b>6 min\/85°C\/speed 5<b>. Strain through a fine sieve then churn in an ice cream machine (see tip for alternative method). Add ginger near end of churning. Store in freezer until required. Clean mixing bowl."},{"isHeader":true,"content":"Pear Purée"},{"content":"Place pears in mixing bowl and chop <b>5 sec\/speed 5<b>."},{"content":"Add butter and sugar then cook <b>5 min\/100°C\/speed <b>. Blend <b>2 min\/speed 6<b>. Remove mixing bowl and leave to cool. Add lemon juice. Pass through a fine sieve then cover and place in fridge to cool. Remove 30 minutes before required."},{"isHeader":true,"content":"Garnish"},{"content":"Remove chocolate ganache logs from fridge and trim either end through cling film, using a sharp knife dipped in hot water. Cut 3 even cylinders from each log then remove cling film."},{"content":"Place a ganache cylinder on a plate. Place some grated walnuts next to it then add a scoop of ginger ice cream on top of walnuts. Dot pear purée around the plate. Arrange pear discs and remaining grated walnuts over the plate. Dress with a little coriander cress before serving."}],"hintsAndTricks":["Slice the pears on a mandolin into <b>1 mm<b> slices then cut out discs using a <b>2 cm<b> pastry cutter.","To make ice cream without an ice cream machine - pour mixture into ice cube trays and freeze until solid. Place ice cream cubes in mixing bowl and chop <b>20 sec\/speed 6<b>. Add stem ginger pieces then, while stirring with spatula through hole in mixing bowl lid, churn <b>10 sec\/speed 4<b>."],"basicInfo":["medium","30m","13h","12 portions"]}