{"badges":["TM31","TM5","TM6"],"usefulItems":"bowl, slotted spoon, paper towel, large frying pan, baking tray (20 x 30 cm), large shallow bowl, silicone bread mat, serving plate, oven, stove top","id":"r214337","imageLink":"https:\/\/3.bp.blogspot.com\/-VPzC0ZvNcy8\/XZWexmcpa2I\/AAAAAAAAe5o\/wScGtJKLk_MEe9A3fOjKLGP1JeUNpkwWgCLcBGAsYHQ\/s1600\/0_hSTtOnpUZyJeLM6i.png","title":"Almond briouats with honey and sesame seeds","publishedAt":"2017-10-15T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Almond paste filling"},{"content":"250 g blanched almonds"},{"content":"80 g sugar"},{"content":"½ tsp ground cinnamon"},{"content":"1 pinch salt"},{"content":"30 g unsalted butter, softened"},{"content":"1 tbsp orange blossom water"},{"isHeader":true,"content":"Briouats"},{"content":"6 sheets filo pastry"},{"content":"50 g unsalted butter, melted"},{"content":"oil, for frying"},{"isHeader":true,"content":"Honey syrup"},{"content":"300 g honey"},{"content":"½ tsp orange blossom water"},{"content":"1 tbsp sesame seeds"}],"nutrition":{"protein":"2.7 g","fat":"11 g","uom":"per 1 portions","carbohydrates":"16.3 g","calories":"723.2 kJ \/ 172.2 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Almond paste filling"},{"content":"Preheat oven to 200°C. Set aside a baking tray (20 x 30 cm)."},{"content":"Place a bowl onto mixing bowl lid and weigh 120 g of the blanched almonds into it. Spread in a single layer onto baking tray and toast for 5 minutes (200°C) or until lightly browned. Set aside to cool."},{"content":"Place roasted almonds, sugar and remaining 130 g almonds into mixing bowl and mill <b>15 sec\/speed 7<b>."},{"content":"Add ground cinnamon, salt, butter and orange blossom water and mix <b>15 sec\/speed 5<b>. Transfer into a bowl and set aside. Clean and dry mixing bowl."},{"isHeader":true,"content":"Briouats"},{"content":"Place a sheet of filo pastry onto a silicone bread mat or clean work surface and brush with melted butter. Cut sheet into 5-6 strips (approx. 7 cm wide). Place 1 tablespoon of the reserved almond paste filling at the bottom of strip. Fold the bottom left corner of the pastry strip diagonally to the right, enclosing the filling and forming a triangle. Fold again (folding up) along the bottom crease of the triangle. Keep folding, creating triangles, to the top of the strip. Seal pastry using melted butter. Repeat with remaining pastry and filling (makes approx. 24 in total)."},{"content":"Place a large frying pan over medium heat and add oil (2-3 cm deep). Working in batches, fry briouats (approx. 1-2 minutes), turning occasionally, until golden brown on both sides. Remove with a slotted spoon and drain on paper towel. Transfer into a large shallow bowl."},{"isHeader":true,"content":"Honey syrup"},{"content":"Place honey and orange blossom water into mixing bowl and heat <b>4 min\/100°C\/speed 1<b>. Pour syrup over briouats in bowl. Using 2 forks, turn briouats in syrup to coat completely and transfer to a plate. Drizzle with extra syrup, sprinkle with sesame seeds and set aside to cool before serving."}],"hintsAndTricks":["A briouat is a sweet or savoury puff pastry dessert.","You can store briouats for 2-3 days at room temperature, covered with a kitchen towel (do not store in a sealable container, as they may get soggy)."],"basicInfo":["medium","40m","1h","24 portions"]}