{"badges":["TM5","TM6"],"usefulItems":"bowl, serving bowls, large baking tray, freezer-proof container, pastry brush, oven","id":"r218852","imageLink":"https:\/\/1.bp.blogspot.com\/-pyFan6LRmpo\/XZVPyX6UA-I\/AAAAAAAAc8k\/tXRP9IClVTA2tf7KzYEqyTl78VAH_ZL5wCLcBGAsYHQ\/s1600\/0_EoH95SJlL_BhXmTk.png","title":"Asparagus Risotto, Sun-dried Tomato Tear and Share Rolls, Berry Foam","publishedAt":"2017-09-05T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Preparation Before Demo"},{"content":"250 g asparagus, woody ends removed"},{"isHeader":true,"content":"Sun-dried Tomato Tear and Share Rolls"},{"content":"220 g water"},{"content":"1 tsp sugar"},{"content":"2 tsp dried instant yeast"},{"content":"500 g strong white bread flour"},{"content":"90 g sun-dried tomatoes in oil, drained"},{"content":"30 g olive oil, plus extra for greasing"},{"content":"1 tsp fine sea salt, to taste"},{"isHeader":true,"content":"Berry Foam"},{"content":"80 - 140 g sugar, to taste"},{"content":"500 g mixed berries, frozen, to taste"},{"content":"10 - 30 g lime juice, to taste"},{"content":"1 egg white, from medium or large egg"},{"isHeader":true,"content":"Baking"},{"content":"1 egg yolk, from medium or large egg"},{"isHeader":true,"content":"Asparagus Risotto"},{"content":"60 g Parmesan cheese, cut in pieces (2 cm)"},{"content":"50 g shallots, halved"},{"content":"20 g olive oil"},{"content":"200 g dry white wine"},{"content":"250 g risotto rice"},{"content":"450 g vegetable stock, hot"},{"content":"½ tsp fine sea salt"},{"content":"¼ tsp ground black pepper"},{"content":"250 g frozen peas"},{"content":"20 g butter"}],"nutrition":{"protein":"17.8 g","fat":"18.1 g","uom":"per 1 portion","carbohydrates":"101.7 g","calories":"2758 kJ \/ 658 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Preparation Before Demo"},{"content":"Cut off asparagus tips and set aside. Cut each asparagus stalk into 3 pieces and set aside."},{"isHeader":true,"content":"Sun-dried Tomato Tear and Share Rolls"},{"content":"Preheat oven to 50°C and grease a large baking tray (see tip)."},{"content":"Place water, sugar and yeast in mixing bowl then mix <b>20 sec\/speed 2<b>."},{"content":"Add flour, sun-dried tomatoes, oil and salt then knead <b>2 min\/<b>. Tip out and divide dough into 12 equal-sized pieces, then roll each into a ball. Arrange side by side in rows (6 x 2) on prepared tray so rolls are just touching. Place in preheated oven and leave to prove for 20 minutes (50°C, quick rise).  Meanwhile, self-wash mixing bowl by covering blade with water and a drop of washing up liquid. Set for <b>1 min\/60°C\/speed 6<b>. Discard water, rinse and wipe dry then make berry foam."},{"isHeader":true,"content":"Berry Foam"},{"content":"Place sugar in mixing bowl and grind <b>15 sec\/speed 10<b>."},{"content":"Add frozen berries, lime juice and egg white then, while stirring with spatula through hole in mixing bowl lid, blend <b>40 sec\/speed 5<b>."},{"content":" <b>Insert butterfly whisk<b> and whisk <b>3 min\/speed 3.5<b>. Transfer to serving bowls and enjoy, freezing any leftovers in a freezer-proof container. Rinse mixing bowl, then make risotto."},{"isHeader":true,"content":"Baking"},{"content":"Brush rolls with reserved egg yolk then increase oven temperature to 180°C and bake for 18-20 minutes (180°C) or until rolls sound hollow when tapped underneath. Meanwhile, continue with recipe."},{"isHeader":true,"content":"Asparagus Risotto"},{"content":"Place Parmesan in mixing bowl and grate <b>10 sec\/speed 10<b>. Transfer to a bowl and set aside."},{"content":"Place asparagus stalk pieces, shallots and oil in mixing bowl then chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula then sauté <b>3 min\/120°C\/speed 1<b>."},{"content":"Add wine then risotto rice and, without measuring cup, cook <b>2 min\/120°C\/\/speed 1<b>. Scrape base of mixing bowl with spatula to loosen rice."},{"content":"Add hot stock, salt and pepper. Place Varoma dish into position and weigh in peas. Cover then cook <b>12-15 min\/100°C\/\/speed 1<b> until rice is cooked al dente (with a bite) - the risotto should be slightly soupy at this stage."},{"content":"Set Varoma aside. Add reserved asparagus tips, reserved Parmesan and butter then stir in with spatula. Adjust seasoning if desired then replace Varoma and leave to rest for 2 minutes."},{"content":"Serve with peas on the side accompanied by the tear and share rolls."}],"hintsAndTricks":["If the oven does not have a 50°C setting, preheat oven to 100°C then turn off before placing loaves in warm oven to prove."],"basicInfo":["easy","20m","1h 30m","1 portion"]}