{"badges":["TM5","TM6"],"usefulItems":"large jug, fine mesh sieve, sterilised sealable jar, large bowl, refrigerator","id":"r238988","imageLink":"https:\/\/2.bp.blogspot.com\/-iXIZMXLVREs\/XZWZcDXnbLI\/AAAAAAAAeM8\/x7LBdmB0rA06sCzvQNgRYU80iqy4HydDgCLcBGAsYHQ\/s1600\/0_bUH-7zF5rh0lh_bL.png","title":"Mixed meat rillettes","publishedAt":"2018-07-30T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"1 carrot, cut into pieces"},{"content":"1 brown onion, cut into pieces"},{"content":"10 g dried porcini mushrooms or dried shiitake mushrooms"},{"content":"1200 g water"},{"content":"1 tsp ground allspice"},{"content":"2 sprigs fresh thyme, leaves only"},{"content":"3 dried bay leaves"},{"content":"200 g gravy beef, cut into cubes (3-4 cm)"},{"content":"200 g boneless skinless chicken thigh, cut into cubes (3-4 cm)"},{"content":"1200 - 1500 g ham hock (smoked)"},{"content":"½ tsp salt"},{"content":"&frac18; tsp nutmeg"},{"content":"½ tsp ground black pepper"},{"content":"&frac18; tsp ground ginger"}],"nutrition":{"protein":"17.8 g","fat":"13.6 g","uom":"per 1 portion","carbohydrates":"0.5 g","calories":"816.1 kJ \/ 194.3 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place carrot, onion and mushrooms into mixing bowl and chop <b>3 sec\/speed 7<b>."},{"content":"Add 1000 g of the water, allspice, thyme and bay leaves into mixing bowl. Insert simmering basket, then weigh beef and  chicken into it. Place Varoma dish into position and place ham hock into it. Secure Varoma lid and steam <b>60 min\/Varoma\/speed 1<b>."},{"content":"Remove Varoma. Add remaining 200 g water, replace Varoma into position, secure Varoma lid and cook <b>30 min\/Varoma\/speed 1<b>."},{"content":"Remove Varoma and set hock aside until cool enough to handle (approx. 20 minutes). Remove simmering basket with aid of spatula, transfer contents into a large bowl and set aside to cool. Strain hot stock through a fine-mesh sieve into a large jug. Rinse mixing bowl."},{"content":"Remove meat from the ham hock and discard skin and fat. Place ham, cooked beef and chicken, salt, nutmeg, pepper and ginger into mixing bowl and shred <b>5-10 sec\/\/speed 5<b>."},{"content":"Gently pack meat mixture into a large sterilised sealable jar and top with reserved strained stock to seal the top (ensure meat mixture is covered). Place into refrigerator for 2 hours to cool and set. When ready to serve, remove from refrigerator approx. 30 minutes before serving to allow it to come to room temperature."}],"hintsAndTricks":["You can store rillettes in the refrigerator unopened for up to 1 week. Once seal is broken, consume within 3 days.","Serve rillettes on crackers, Melba toast or slices of toasted sourdough. Serve alongside salami, cornichons, radishes or pickles on a ploughman’s lunch platter or as part of a cheese platter."],"basicInfo":["easy","20m","4h 10m","28 portions"]}