{"badges":["TM5","TM6"],"usefulItems":"baking dish (approx. 30 cm x 20 cm), oven, refrigerator","id":"r238768","imageLink":"https:\/\/3.bp.blogspot.com\/-yJf3ILKlNgg\/XZWffEzXxII\/AAAAAAAAfFU\/JUhndpxBgdoGFFdUS7HJ7uVZjfUyNEPGwCLcBGAsYHQ\/s1600\/0_vv25U2I9MECD9uuy.png","title":"Peach and Plum Fruit Cobbler","publishedAt":"2018-02-19T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Batter"},{"content":"250 g salted butter, soft, plus extra for greasing"},{"content":"250 g sugar"},{"content":"250 g self-raising flour"},{"content":"4 medium eggs"},{"content":"1 pinch fine sea salt"},{"isHeader":true,"content":"Fruit Stew And Finalisation"},{"content":"4 peaches, halved, stone removed"},{"content":"4 plums, halved, stone removed"},{"content":"60 g sugar"},{"content":"20 g apple juice"},{"content":"200 g double cream"}],"nutrition":{"protein":"16 g","fat":"75 g","uom":"per 1 portion","carbohydrates":"158 g","calories":"5990 kJ \/ 1336 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Batter"},{"content":"Preheat oven to 180°C. Lightly grease a baking dish (approx. 30 cm x 20 cm) with butter."},{"content":"Place sugar in mixing bowl and grind <b>3 sec\/speed 10<b>."},{"content":"Add butter, flour, eggs and salt then mix <b>20 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula and mix again <b>10 sec\/speed 9<b>. Transfer to a bowl and set aside."},{"isHeader":true,"content":"Fruit Stew And Finalisation"},{"content":"Place peaches, plums and sugar in mixing bowl then chop <b>3 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add apple juice and heat <b>3 min\/50°C\/speed 1<b>. Transfer to prepared baking dish."},{"content":"Spoon the reserved batter over the fruits and bake for 45-50 minutes (180°C), or until a skewer inserted into the middle of the top layer comes out clean. Meanwhile, clean mixing bowl and continue with recipe."},{"content":" <b>Insert butterfly whisk<b>. Place cream in mixing bowl and whip <b>speed 3, without setting a time<b>, until desired stiffness is achieved, watching carefully to avoid over-whipping. <b>Remove butterfly whisk<b>. Transfer to a bowl and refrigerate until needed."},{"content":"Serve pudding in bowls, topped with whipped cream."}],"hintsAndTricks":["You can serve the fruit pudding with ice cream, custard or very cold unsweetened yoghurt instead of whipped cream.","Note that the batter recipe always has equal quantities of sugar, butter, eggs and self-raising flour. If you are making a bigger or smaller cobbler, vary the weights we’ve given here depending on the size of the pudding required—always using equal quantities.","You might like the fruit base to be a puree, or a mix of puree and chunks of fruit, or entirely chunky.","Try different types of fruit. For berries, just create a layer of mixed berries in the baking dish and top with batter.","If using apples, pears or quinces, sprinkle the cut fruit with lemon juice to avoid discolouring."],"basicInfo":["easy","25m","1h","4 portions"]}