{"badges":["TM5","TM6"],"usefulItems":"bowl, thermal serving bowl or other large bowl, 6-hole Texas muffin tray, oven","id":"r238980","imageLink":"https:\/\/1.bp.blogspot.com\/-JgjsoBFFirQ\/XZQGs2Dcc7I\/AAAAAAAAcA4\/yazRv4rod5Q9Rzd8dVuSeCcWwUGLj-HyACLcBGAsYHQ\/s1600\/0_W4wGa61t3HSXNg-U.png","title":"Chicken picadillo cups","publishedAt":"2018-07-30T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"200 g tasty cheddar cheese, cut into cubes (3-4 cm)"},{"content":"500 g water"},{"content":"650 - 750 g boneless skinless chicken thighs, cut into pieces (3-4 cm)"},{"content":"½ tsp ground black pepper, plus extra to season"},{"content":"½ tsp salt, plus extra to season"},{"content":"150 g brown onion, cut into halves"},{"content":"2 garlic cloves"},{"content":"2 - 3 fresh chillies, trimmed and deseeded if preferred"},{"content":"2 tsp ground coriander"},{"content":"2 tsp ground cumin"},{"content":"40 g oil"},{"content":"1 tomato, cut into quarters"},{"content":"50 g tomato paste"},{"content":"50 g raisins"},{"content":"100 g pimento stuffed olives"},{"content":"olive oil spray, for greasing"},{"content":"18 mini tortillas"},{"content":"150 g sour cream, to serve"},{"content":"4 - 5 sprigs fresh coriander, leaves only"},{"content":"¼ iceberg lettuce, shredded"}],"nutrition":{"protein":"41.9 g","fat":"47.1 g","uom":"per 1 portion","carbohydrates":"61.6 g","calories":"3546.1 kJ \/ 844.3 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place cheese into mixing bowl and grate <b>3 sec\/speed 9<b>. Transfer into a bowl and set aside."},{"content":"Without cleaning mixing bowl, place water into mixing bowl. Place Varoma into position and weigh chicken into it. Season with salt and pepper, secure Varoma lid and steam <b>10 min\/Varoma\/speed 1<b>."},{"content":"Stir chicken with aid of spatula, secure Varoma lid and steam <b>8 min\/Varoma\/speed 1<b>. Set Varoma aside, discard water and rinse mixing bowl."},{"content":"Place chicken into mixing bowl and shred <b>5 sec\/\/speed 5<b>. Transfer into a thermal serving bowl or other large bowl and set aside."},{"content":"Preheat oven to 180°C. Without cleaning mixing bowl, place onion, garlic, chillies, ground coriander and ground cumin into mixing bowl and chop <b>3 sec\/speed 7<b>."},{"content":"Add oil, tomato and tomato paste and cook <b>4 min\/Varoma\/speed 1<b>, then blend <b>30 sec\/speed 4<b>-7, increasing speed gradually from speed 4 to speed 7<b>."},{"content":"Add raisins, olives, salt and pepper and cook <b>6 min\/80°C\/\/speed 1<b>. Transfer into thermal serving bowl or other large bowl with chicken and stir to combine."},{"content":"Spray a 6-hole Texas muffin tin with oil. Place a tortilla into each hole of a 6-hole Texas muffin tin, shaping tortilla into a cup shape. Bake for 5-8 minutes (180°C) until golden. Allow to cool and harden in tin for a few minutes, then turn out to cool completely. Repeat with remaining tortillas, spraying tin with oil as needed."},{"content":"Fill tortilla cups with chicken mixture. Top with grated cheese, 1-2 teaspoons sour cream, coriander leaves and shredded lettuce to serve."}],"hintsAndTricks":["You can serve these simply as tacos, or for a heartier meal, serve with rice and black beans."],"basicInfo":["easy","20m","40m","6 portions"]}