{"badges":["TM5","TM6"],"usefulItems":"square cake tin (23 cm), baking paper, skewer, pastry brush, tongs, oven, refrigerator","id":"r245104","imageLink":"https:\/\/1.bp.blogspot.com\/-SA0StEksL5w\/XZWqw3f3YHI\/AAAAAAAAfc8\/0xRNtn0H0HQONGkuBas2i5bw4i93BIMwQCLcBGAsYHQ\/s1600\/0_Tvq-SGqARFbmXk7V.png","title":"Italian Rice Cake - Torta di riso","publishedAt":"2018-05-28T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"100 g amaretti biscuits"},{"content":"100 g blanched almonds"},{"content":"1000 g whole milk"},{"content":"250 g caster sugar"},{"content":"1 lemon, thin peelings of skin only"},{"content":"1 vanilla pod and scraped out seeds"},{"content":"100 g risotto rice"},{"content":"50 g candied mixed peel"},{"content":"5 medium eggs, beaten"},{"content":"1 pinch fine sea salt"},{"content":"80 g Amaretto or other almond liqueur"}],"nutrition":{"protein":"7 g","fat":"8.5 g","uom":"per 1 portion","carbohydrates":"31.5 g","calories":"1036 kJ \/ 246 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place amaretti biscuits in mixing bowl and grind <b>15 sec\/speed 10<b>. Transfer to a bowl and set aside."},{"content":"Place almonds in mixing bowl and chop <b>5 sec\/speed 7<b>. Transfer to bowl with amaretti biscuits and set aside."},{"content":"Place milk, sugar, lemon peel, vanilla pod and scraped out seeds in mixing bowl then cook <b>10 min\/98°C\/\/speed 3<b>. Meanwhile, line a square cake tin (23 cm) with baking paper."},{"content":"Add rice and, with simmering basket in place of measuring cup, cook <b>30 min\/95°C\/\/speed 2<b>. Use tongs to remove vanilla pod and lemon peel then set mixing bowl aside to cool without lid until temperature reaches 40°C or lower (see tip). When nearly at correct temperature, preheat oven to 180°C."},{"content":"Add candied peel, reserved almonds and amaretti, eggs and salt then mix <b>5 sec\/\/speed 5<b>. Transfer to prepared tin then bake for 60-70 minutes (180°C) until a skewer inserted in centre comes out clean."},{"content":"Turn off oven and remove cake. Make holes in the surface with a skewer then immediately brush with almond liqueur. Return cake to rest in the warm oven with the door slightly ajar for 5 minutes."},{"content":"Remove from oven and cool to room temperature. Place in fridge for at least 5 hours before removing from tin and cutting into portions to serve."}],"hintsAndTricks":["This comforting cake dates back to the early 20th century when peasant women in the Emilia-Romagna region of Italy would help cultivate the famous short-grain Arborio rice. Once the harvest was over, the families were left with an abundance of rice, so the women experimented by creating different sweet and savoury dishes. <i>Torta di riso<\/i> is one such creation and is made when the plump grains of rice are slowly cooked in milk and spices before being baked until golden.","To check the temperature of the mixture as it cools, return the mixing bowl to position and wait a few seconds for the temperature to display on the Thermomix.","To allow the mixture to cool faster, transfer to a ceramic or glass bowl and leave to cool, then return to mixing bowl to continue the recipe."],"basicInfo":["easy","15m","8h 30m","16 portions"]}