{"badges":["TM5","TM6"],"usefulItems":"large bowl, large casserole dish, aluminium foil, baking tray, oven, hob","id":"r247619","imageLink":"https:\/\/3.bp.blogspot.com\/-mdAmUOPfrzw\/XZQIDx89GwI\/AAAAAAAAcO4\/XzYK2A_SSM00cEhhPJ5GfwHbjyCFKwWKQCLcBGAsYHQ\/s1600\/0_wYCu1x7OQlGoQ41-.png","title":"Braised Lamb Shanks with Roasted Garlic and Parmesan Mash - Stinco d'agnello con purè di patate all'aglio e parmigiano","publishedAt":"2018-05-28T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Braised Lamb Shanks"},{"content":"200 g red wine, full-bodied Italian"},{"content":"400 g tinned chopped tomatoes"},{"content":"60 g balsamic vinegar"},{"content":"50 g tomato purée"},{"content":"100 g water"},{"content":"1 beef stock cube (for 0.5 l)"},{"content":"3 sprigs fresh rosemary"},{"content":"2 tsp dried oregano"},{"content":"110 g onions, quartered"},{"content":"3 - 4 garlic cloves, to taste"},{"content":"150 g celery stalks, cut in pieces"},{"content":"150 g carrots, cut in pieces"},{"content":"40 g extra virgin olive oil, plus extra for browning"},{"content":"4 lamb shanks (approx. 400 g each)"},{"content":"2 pinches fine sea salt"},{"content":"2 pinches ground black pepper"},{"isHeader":true,"content":"Roasted Garlic and Parmesan Mash"},{"content":"50 g Parmesan cheese, cut in pieces (2 cm)"},{"content":"1 garlic bulb"},{"content":"1 tsp olive oil"},{"content":"1 pinch fine sea salt"},{"content":"1000 g floury potatoes, peeled, sliced (5 mm)"},{"content":"1 ½ tsp fine sea salt, plus extra to taste"},{"content":"350 g milk"},{"content":"50 g unsalted butter, diced"},{"content":"ground black pepper, to taste"}],"nutrition":{"protein":"79 g","fat":"71 g","uom":"per 1 portion","carbohydrates":"64 g","calories":"5255 kJ \/ 1259 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Braised Lamb Shanks"},{"content":"Preheat oven to 150°C."},{"content":"Place a large bowl on mixing bowl lid. Weigh in wine, tomatoes, balsamic vinegar, tomato purée, water, stock cube, rosemary and oregano then set bowl aside."},{"content":"Place onions, garlic, celery, carrots and 40 g oil in mixing bowl then chop <b>7 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula then cook <b>5 min\/100°C\/speed 0.5<b>. Meanwhile, heat a little oil in a large casserole dish (with lid) over a medium-high heat then season lamb shanks and brown on all sides in the hot oil. Transfer lamb shanks to a plate and set aside."},{"content":"Transfer cooked vegetables to casserole dish then add reserved liquid ingredients from bowl. Bring to a simmer then add lamb shanks, pushing them down into the sauce, and cover with lid."},{"content":"Place casserole dish in oven and cook for 2-2½ hours (150°C) until lamb is tender and falling off the bones. With 45 minutes remaining, prepare mashed potatoes in a clean mixing bowl."},{"isHeader":true,"content":"Roasted Garlic and Parmesan Mash"},{"content":"Place Parmesan in mixing bowl and grate <b>10 sec\/speed 10<b>. Transfer to a bowl and set aside."},{"content":"Slice the top off a whole garlic bulb to expose the tops of the cloves. Place on a piece of foil on a baking tray, drizzle with oil and sprinkle with a pinch of salt. Wrap in the foil then roast for 35-40 minutes (150°C) until cloves come out easily when squeezed, then remove and set aside to cool. Meanwhile, cook potatoes."},{"content":" <b>Insert butterfly whisk<b>. Place potatoes, milk and 1½ tsp salt in mixing bowl then, without measuring cup, cook <b>25-30 min\/95°C\/speed 1<b>."},{"content":"Place squeezed out garlic flesh from cooled cloves in a bowl and mash with a fork then set aside."},{"content":"Add butter, reserved Parmesan and mashed garlic cloves to mixing bowl then mash <b>15 sec\/speed 3.5<b>. Season to taste and keep warm until lamb is cooked."},{"isHeader":true,"content":"Assembly"},{"content":"Serve lamb shanks and sauce with garlic and Parmesan mash on the side."}],"hintsAndTricks":["This meaty main course is a real show-stopper. Cooked in a traditional Italian sauce of red wine, rosemary and balsamic vinegar, lamb shanks simmer slowly in the oven until the meat is tender and falling off the bone. A batch of extra special Thermomix mashed potatoes, containing salty Parmesan and a slow-roasted whole garlic bulb, makes an indulgent side dish and a perfect accompaniment to the lamb."],"basicInfo":["medium","30m","3h 20m","4 portions"]}