{"badges":["TM5","TM6"],"usefulItems":"serving bowl, large saucepan, colander, hob","id":"r247598","imageLink":"https:\/\/3.bp.blogspot.com\/-6p7KzVEvpb8\/XZMyiAXIpJI\/AAAAAAAAamM\/nuwoQXGxvJsG8sc76GH8E_Sav-ACBbtCACLcBGAsYHQ\/s1600\/0_GkKDLsUt-SCZvgK2.png","title":"Creamy Truffled Mushroom Tagliatelle - Tagliatelle con crema di funghi tartufata","publishedAt":"2018-05-28T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"180 g Parmesan cheese, cut in pieces (2 cm)"},{"content":"100 g onions, quartered"},{"content":"4 garlic cloves"},{"content":"40 g truffle oil, plus extra for serving"},{"content":"50 g unsalted butter, diced"},{"content":"300 g mixed fresh mushrooms, sliced if large"},{"content":"water, for cooking pasta"},{"content":"2 ½ tsp fine sea salt"},{"content":"100 g white wine"},{"content":"250 g double cream"},{"content":"3 sprigs fresh thyme, leaves only, plus extra for serving"},{"content":"2 pinches ground black pepper"},{"content":"320 g dried tagliatelle"}],"nutrition":{"protein":"28.5 g","fat":"72 g","uom":"per 1 portion","carbohydrates":"59 g","calories":"4464 kJ \/ 1071 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place Parmesan in mixing bowl and grate <b>10 sec\/speed 10<b>. Transfer to a bowl and set aside."},{"content":"Place onions, garlic, oil and butter in mixing bowl then chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula then, without measuring cup, sauté <b>3 min\/100°C\/speed 1<b>."},{"content":"Add mushrooms and, without measuring cup, cook <b>5 min\/90°C\/\/speed <b>. Meanwhile, bring a large saucepan of water with 1 tsp salt added to the boil."},{"content":"Add wine, cream, 100 g reserved grated Parmesan, thyme, remaining 1½ tsp salt and pepper to mixing bowl then, without measuring cup, cook <b>8 min\/90°C\/\/speed <b>. Meanwhile, cook tagliatelle in saucepan according to packet instructions, or until al dente."},{"content":"Drain tagliatelle using a colander and transfer to a serving bowl. Pour mushroom sauce over pasta and toss thoroughly to combine."},{"content":"Serve hot, sprinkled with remaining 80 g grated Parmesan and thyme leaves, then drizzled with truffle oil, if desired."}],"hintsAndTricks":["Tagliatelle comes from the Italian <i>'tagliare'<\/i>, meaning ‘to cut’. It originated in the Emilia-Romagna region in Northern Italy and dates back to the 15th century. Wider, thicker pasta shapes like tagliatelle work well when paired with thick sauces. To showcase this, we’ve created a luxurious pasta dish that features earthy mushrooms stirred through a rich Parmesan cream sauce, finished with the unmistakably heady aroma of white truffle oil.","The dried tagliatelle in this recipe can be replaced with homemade or fresh shop-bought pasta, if preferred.","To make this recipe suitable for vegetarians, substitute the Parmesan cheese for a vegetarian hard cheese.","Substitute the tagliatelle with any other variety of long, dried pasta such as pappardelle or spaghetti."],"basicInfo":["easy","15m","55m","4 portions"]}