{"badges":["TM5","TM6"],"usefulItems":"deep saucepan or deep fat fryer, baking tray, slotted spoon, paper towel, hob","id":"r247611","imageLink":"https:\/\/4.bp.blogspot.com\/-kGnrdBJ3314\/XZarB4mDzCI\/AAAAAAAAhkI\/zEeZM-tWdY0DJf8nSd6HAH9Rc2qwUvOfQCLcBGAsYHQ\/s1600\/0_ygDQXwGVsqfGLPuP.png","title":"Supplì (Roman Rice Croquettes)","publishedAt":"2018-02-05T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Tomato Sauce"},{"content":"80 g onions, quartered"},{"content":"30 g extra virgin olive oil"},{"content":"1 garlic clove"},{"content":"400 g tinned chopped tomatoes"},{"content":"½ Tbsp balsamic vinegar"},{"content":"3 fresh basil leaves, roughly chopped"},{"content":"1 tsp caster sugar"},{"content":"½ tsp fine sea salt"},{"content":"1 pinch ground black pepper"},{"isHeader":true,"content":"Supplì"},{"content":"100 g bread, torn in pieces"},{"content":"¼ tsp fine sea salt"},{"content":"1 pinch ground black pepper"},{"content":"600 g risotto rice, any flavour, leftover or freshly made and cooled"},{"content":"100 g fresh mozzarella, cubed (1-2 cm)"},{"content":"2 medium eggs, beaten"},{"content":"vegetable oil, for frying"}],"nutrition":{"protein":"15 g","fat":"26.7 g","uom":"per 1 piece","carbohydrates":"90 g","calories":"2801 kJ \/ 667 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Tomato Sauce"},{"content":"Place onions, olive oil and garlic in mixing bowl then chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula then sauté <b>2 min\/100°C\/speed 2<b>."},{"content":"Add tomatoes, balsamic vinegar, basil, sugar, salt and pepper then, with simmering basket in place of measuring cup, cook <b>15 min\/100°C\/speed 2<b>."},{"content":"Blend <b>5 sec\/speed 7<b> then transfer to a bowl and set aside. Clean mixing bowl."},{"isHeader":true,"content":"Supplì"},{"content":"Place bread, salt and pepper in mixing bowl then grate <b>10 sec\/speed 10<b>. Transfer to a bowl and set aside."},{"content":"Take a small handful of cold leftover risotto (approx. 90 g) and shape into an elongated ball. Press 1-2 cubes of mozzarella in centre and mould rice around the cheese until completely enclosed."},{"content":"Dip supplì in beaten eggs then roll in reserved breadcrumbs until completely covered. Transfer to a baking tray and repeat until all rice and filling have been used."},{"content":"Heat vegetable oil in a deep saucepan or deep fat fryer over a medium-low heat."},{"content":"Fry supplì, a few at a time, turning in the oil, until golden and crisp (approx. 5 minutes). Remove with a slotted spoon and leave to drain on paper towels. Serve warm with tomato sauce."}],"hintsAndTricks":["Any flavoured leftover risotto or simply plain cooked rice will work well with this recipe.","This recipe calls for <b>600 g<b> leftover risotto or cooked rice, but the breadcrumbs and mozzarella can be easily adjusted if you have more or less rice.","If you don't have any leftover rice, try making the 'Risotto with Parmesan Cheese' found in the Basic Cookbook. For best results, prepare the risotto then chill in the fridge for <b>8 hours<b> or overnight before making supplì."],"basicInfo":["easy","30m","50m","6 pieces"]}