{"badges":["TM5","TM6"],"usefulItems":"large bowl, large baking tray, rectangular baking dish (approx. 30 cm x 20 cm x 5 cm), oven","id":"r247604","imageLink":"https:\/\/3.bp.blogspot.com\/-vhrX15XbMaA\/XZMz_oFBLmI\/AAAAAAAAa3s\/cIicF9j_k4AMJp-O3bsygM0hLLE538PMQCLcBGAsYHQ\/s1600\/0_pKz2VPsdzYiXR5hk.png","title":"Christmas Eve Lasagne - Lasagne della vigilia di Natale","publishedAt":"2018-05-28T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Spinach Ricotta Filling"},{"content":"200 g Parmesan cheese, cut in pieces (2 cm)"},{"content":"500 g ricotta cheese"},{"content":"200 g frozen spinach, defrosted and drained (drained weight)"},{"content":"1 medium egg"},{"content":"1 tsp fine sea salt"},{"content":"1 pinch ground black pepper"},{"isHeader":true,"content":"Seafood Filling"},{"content":"400 g large raw prawns, peeled"},{"content":"180 g scallops (halved if large)"},{"content":"150 g raw squid rings"},{"content":"½ tsp fine sea salt"},{"content":"1 pinch ground black pepper"},{"content":"3 garlic cloves"},{"content":"50 g unsalted butter, diced"},{"content":"125 g white wine"},{"content":"30 g lemon juice"},{"isHeader":true,"content":"Béchamel Sauce"},{"content":"3 sprigs fresh dill, leaves only"},{"content":"40 g unsalted butter, diced"},{"content":"40 g plain flour"},{"content":"600 g milk"},{"content":"¼ tsp ground nutmeg"},{"content":"1 tsp fine sea salt"},{"content":"1 pinch ground black pepper"},{"isHeader":true,"content":"Assembly"},{"content":"12 dried lasagne pasta sheets"},{"content":"250 g grated mozzarella"}],"nutrition":{"protein":"63 g","fat":"44 g","uom":"per 1 portion","carbohydrates":"28.9 g","calories":"3224 kJ \/ 772 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Spinach Ricotta Filling"},{"content":"Place Parmesan in mixing bowl and grate <b>10 sec\/speed 10<b>. Transfer to a bowl and set aside."},{"content":"Place ricotta, 100 g reserved grated Parmesan, spinach, egg, salt and pepper in mixing bowl then mix <b>10 sec\/speed 5<b>. Transfer to a bowl and set aside. Clean mixing bowl."},{"isHeader":true,"content":"Seafood Filling"},{"content":"Place a large bowl on mixing bowl lid. Weigh into bowl prawns, scallops, squid, salt and pepper then set aside."},{"content":"Place garlic and butter in mixing bowl then chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula then sauté <b>2 min\/100°C\/speed 1<b>."},{"content":"Add wine and lemon juice then, without measuring cup, cook <b>10 min\/110°C\/speed 1<b>. Transfer garlic-butter mixture to bowl with seafood, then stir gently with spatula to combine. Clean mixing bowl."},{"isHeader":true,"content":"Béchamel Sauce"},{"content":"Place dill in mixing bowl and chop <b>5 sec\/speed 7<b>."},{"content":"Add butter and melt <b>2 min\/100°C\/speed 1<b>."},{"content":"Avoiding blades, add flour and cook <b>3 min\/100°C\/speed 1<b>."},{"content":"Add milk, nutmeg, salt and pepper then cook <b>6 min\/90°C\/speed 4<b>."},{"content":"Add 50 g reserved grated Parmesan and mix <b>10 sec\/speed 3<b>."},{"isHeader":true,"content":"Assembly"},{"content":"Preheat oven to 180°C."},{"content":"Spread a little béchamel sauce to cover the bottom of a large baking dish (approx. 30 cm x 20 cm x 5 cm) then lay 3 lasagne sheets over the top. Place half the spinach-ricotta mixture then half the seafood filling (without juices) on top."},{"content":"Add 3 lasagne sheets then the remaining seafood filling and pour half of the béchamel sauce over the top. Add a layer of 3 lasagne sheets then the remaining spinach-ricotta mixture."},{"content":"Add 3 lasagne sheets. Pour over remaining béchamel sauce, top with grated mozzarella and remaining 50 g reserved grated Parmesan."},{"content":"Place baking dish on a baking tray then bake for 45-55 minutes (180°C) until bubbling and golden brown on top. Rest for 5 minutes before cutting into portions to serve."}],"hintsAndTricks":["The Feast of the Seven Fishes is an Italian-American Christmas Eve celebration. The roots of the celebration are linked to the Roman Catholic custom of abstaining from meat on this day. There are no set rules for the <i>cena della Vigilia<\/i> (Christmas Eve dinner) with families celebrating in different ways using recipes that have been passed down through generations. This lavish seafood lasagne is bursting with beautiful fresh squid, scallops and prawns, making it the perfect way to celebrate the Feast of the Seven Fishes in your own home."],"basicInfo":["medium","30m","1h 45m","8 portions"]}