{"badges":["TM5","TM6"],"usefulItems":"baking tray and baking paper, rolling pin, pastry brush, oven","id":"r248416","imageLink":"https:\/\/4.bp.blogspot.com\/-R2wNL65OeNg\/XZQGnlhNUeI\/AAAAAAAAb_8\/MWWcH_iydAAweLJV5fEPKpiEPIdsu3JMgCLcBGAsYHQ\/s1600\/0_Uo9pZxNvInNNVUha.png","title":"Pide with Lamb, Cinnamon, Pine Nuts and Yoghurt","publishedAt":"2018-03-05T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Dough"},{"content":"500 g plain flour, plus extra for dusting"},{"content":"15 g dried instant yeast"},{"content":"320 g water, warm"},{"content":"1 tsp fine sea salt"},{"content":"30 g olive oil"},{"isHeader":true,"content":"Lamb Filling"},{"content":"80 g onions, quartered"},{"content":"1 garlic clove"},{"content":"20 g extra virgin olive oil, plus extra for brushing and greasing"},{"content":"500 g lamb mince, broken in pieces"},{"content":"50 g toasted pine nuts"},{"content":"1 tsp ground cinnamon"},{"content":"1 pinch fine sea salt"},{"content":"1 pinch ground black pepper"},{"isHeader":true,"content":"Assembly"},{"content":"100 g water"},{"content":"4 tsp sesame seeds"},{"content":"250 g natural yoghurt"},{"content":"1 Tbsp sumac"},{"content":"½ bunch fresh coriander, leaves only"}],"nutrition":{"protein":"20 g","fat":"28 g","uom":"per 1 portion","carbohydrates":"54 g","calories":"2293 kJ \/ 548 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Dough"},{"content":"Place flour, yeast, olive oil, water and salt in mixing bowl then knead <b>40 sec\/<b>."},{"content":"Transfer dough to a lightly-oiled bowl and leave to rise until doubled in size (at least 1 hour). Clean mixing bowl."},{"content":"Tip dough out onto a work surface and shape into a large ball using lightly-floured hands."},{"content":"Roll dough into a rectangle and divide into 8 equal pieces."},{"content":"Shape each piece into a smooth ball using lightly-floured hands. Cover with a tea towel and set aside to rest while making filling."},{"isHeader":true,"content":"Lamb Filling"},{"content":"Place onions and garlic in mixing bowl then chop <b>5 sec\/speed 5<b>."},{"content":"Add oil then cook <b>5 min\/120°C\/speed <b>. Remove lid and leave to cool for 5-10 minutes."},{"content":"Add lamb, pine nuts, cinnamon, salt and pepper then mix <b>20 sec\/\/speed <b>."},{"isHeader":true,"content":"Assembly"},{"content":"Preheat oven to 200°C and line a large baking tray with baking paper."},{"content":"With lightly-floured hands and working with one ball at a time, roll out to form a long oval. Roll across the middle to make it slightly wider without losing the oval shape (approx. 23 cm x 13 cm). Repeat with remaining balls of dough."},{"content":"Place lamb filling down the centre of each oval of dough flattening it out a little, leaving 3-4 cm at each end."},{"content":"Fold long edges in, leaving 4 cm uncovered in the centre."},{"content":"Pinch each short end together and twist into a small ball to resemble a small boat."},{"content":"Transfer pides to prepared baking tray. Moisten dough edges with water and scatter with sesame seeds. Leave to rest for 30 minutes."},{"content":"Spoon 2 tsp yoghurt on top of each pide then bake 15-20 minutes (200°C) until puffed and golden."},{"content":"Remove from oven, brush with extra virgin olive oil and sprinkle with sumac and coriander leaves before serving."}],"hintsAndTricks":["When preparing the dough, at the end of <b>step 5<b> the balls of dough can be covered and refrigerated or frozen for later use.","Depending on the size of your oven you may need two trays with <b>4 pides<b> on each.","For a vegetarian option, replace the lamb mince with a similar weight of cooked spinach mixed with ricotta."],"basicInfo":["medium","35m","2h 15m","8 portions"]}