{"badges":["TM5","TM6"],"usefulItems":"non-porous bowl, plastic wrap, baking tray (30 x 40 cm), baking paper, kitchen towel, sharp knife, oven","id":"r249177","imageLink":"https:\/\/2.bp.blogspot.com\/-mvyvPIsVOZc\/XZWqlIUmQEI\/AAAAAAAAfaE\/kMqLwj30CAA-TxjuLvFzBZy4IZSpyJmcgCLcBGAsYHQ\/s1600\/0_PtBEyZQeptT7dYZf.png","title":"Mick's ciabatta rolls","publishedAt":"2018-07-30T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Poolish"},{"content":"270 g baker's flour"},{"content":"270 g warm water"},{"content":"1 pinch dried instant yeast"},{"isHeader":true,"content":"Dough"},{"content":"300 g water"},{"content":"20 g olive oil"},{"content":"2 tsp dried instant yeast"},{"content":"500 g baker's flour, plus extra for dusting"},{"content":"2 tsp sea salt"}],"nutrition":{"protein":"10.1 g","fat":"3.3 g","uom":"per 1 portion","carbohydrates":"61.6 g","calories":"1369.6 kJ \/ 326.1 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Poolish"},{"content":"Place all poolish ingredients into mixing bowl and mix <b>30 sec\/speed 2<b>. Set aside to ferment at room temperature in a non-porous bowl, covered with plastic wrap, for 16 hours."},{"isHeader":true,"content":"Dough"},{"content":"Place water and oil into mixing bowl and heat <b>4 min\/37°C\/speed 1<b>."},{"content":"Add fermented poolish and all remaining dough ingredients and mix <b>5 sec\/speed 6<b>, until a rough dough forms."},{"content":"Knead <b>2 min\/<b>. Transfer dough onto a well-floured work surface and cover with a kitchen towel. Allow to rise for 2½ hours or until doubled in size."},{"content":"Dust hands with flour. Gently lift 1 side of the dough and fold it over into the middle. Lift other side of dough and fold into the middle, overlapping the first fold. Take care not to knock air out of dough. Cover and set aside to rest for 30 minutes. Repeat lifting, folding and resting for 30 minutes twice more (for a total of 3 folds)."},{"content":"Preheat oven to 210°C. Line a baking tray (30 x 40 cm) with baking paper and set aside."},{"content":"Carefully cut dough with a sharp knife into 9 rectangles (cut carefully so you don't knock the air out of the dough). Transfer onto prepared baking tray and allow to rise for 20 minutes."},{"content":"Bake for 25-30 minutes (210°C), until lightly golden and rolls sound hollow when tapped underneath. Set aside to cool before serving."}],"hintsAndTricks":["Using a poolish (pre-ferment) improves the keeping time of baked bread and creates greater complexities of flavour. Although pre-ferments have declined in popularity in recent years, due to the accessibility of store-bought yeast, they are still widely used in artisan bread recipes.","Make the poolish before you go to bed and your bread will be ready to bake in time for lunch.","It's important to cut the dough on a floured work surface so you don't damage your bread mat.","This recipe was originally contributed by customer Mick Hammond.","We served these rolls as the bun for our <i>Open fish burgers<\/i> (please refer to the recipe on this recipe chip)."],"basicInfo":["easy","20m","21h 20m","9 portions"]}