{"badges":["TM5","TM6"],"usefulItems":"wire rack, bowl, plastic wrap, paper towel, roasting tray, ceramic or glass baking dish, refrigerator, oven","id":"r250206","imageLink":"https:\/\/1.bp.blogspot.com\/-TLloAekMWi0\/XZQFbZKe6bI\/AAAAAAAAbyo\/FxoajkqHe6Q1s7lQsV_WJOsBtskmmrykgCLcBGAsYHQ\/s1600\/0_3h4O1mJYBfip1h8v.png","title":"Twice-cooked pork belly with lentils","publishedAt":"2018-07-30T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"3 garlic cloves"},{"content":"4 cm piece fresh ginger, peeled"},{"content":"1 tsp dried chilli flakes"},{"content":"1 star anise"},{"content":"50 g Chinese cooking wine"},{"content":"1 tbsp tamarind paste (see Tips)"},{"content":"2 tsp Chinese five spice"},{"content":"½ tsp sesame oil"},{"content":"700 g water, plus extra water for steaming"},{"content":"800 - 1100 g boneless pork belly, rind on"},{"content":"1 - 2 pinches salt, to taste, plus extra for sprinkling"},{"content":"2 pears (large), cut into halves and cored"},{"content":"2 tsp white sugar"},{"content":"120 g red onion, cut into pieces"},{"content":"1 tbsp oil"},{"content":"½ tsp cumin seeds"},{"content":"1 beetroot, peeled and cut into quarters"},{"content":"800 g canned lentils, rinsed and drained (approx. 500 g after draining)"},{"content":"3 tsp red wine vinegar"},{"content":"5 - 6 sprigs fresh thyme, leaves only"},{"content":"1 - 2 pinches ground black pepper, to taste"}],"nutrition":{"protein":"69.4 g","fat":"51.8 g","uom":"per 1 portion","carbohydrates":"46.5 g","calories":"4109.7 kJ \/ 978.5 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place garlic, ginger, chilli flakes and star anise into mixing bowl and chop <b>5 sec\/speed 9<b>."},{"content":"Add wine, tamarind paste, Chinese five spice and oil and mix <b>10 sec\/speed 3<b>. Transfer into a bowl and set aside. Do not clean mixing bowl."},{"content":"Place water into mixing bowl. Place Varoma dish into position and weigh pork belly into it (ensure that it fits comfortably and the lid closes completely). Secure Varoma lid and cook <b>45 min\/Varoma\/speed 1<b> or until pork is cooked through. Remove Varoma and set pork aside to cool for 10 minutes."},{"content":"Transfer pork into a glass or ceramic dish, skin side down, and cover with reserved marinade. Cover with plastic wrap and place a heavy weight on top to help flatten the pork. Place into refrigerator for a minimum of 3 hours or overnight. Clean and dry mixing bowl."},{"content":"Preheat oven to 220°C. Remove pork from refrigerator and allow to come to room temperature (approx. 30 minutes). Place a wire rack into a roasting tray. Carefully pour 2 cups of water into base of tray. Transfer pork onto wire rack, skin side up, then pat skin dry with paper towel. Using a sharp knife, score pork skin multiple times and sprinkle with salt."},{"content":"Place pears, skin side down, onto wire rack around pork, then sprinkle with sugar. Roast for 30-40 minutes (220°C) or until pears are golden and pork is crispy (see Tips)."},{"content":"Place onion, oil, cumin seeds and beetroot into mixing bowl and chop <b>3 sec\/speed 5<b>, then cook <b>5 min\/100°C\/\/speed 1<b>."},{"content":"Add lentils, vinegar, thyme, salt and pepper and combine <b>2 min\/\/speed 1<b>. To serve, cut pork into 4 portions and serve on top of lentils, with a pear on the side."}],"hintsAndTricks":["You can find tamarind paste at most Asian food stores or specialty food stores.","To save time, during the last 10 minutes while pork and pears are in the oven, start cooking beetroot and lentils.","If pork belly skin is still not crispy after the designated cooking time in the oven, remove the pears and place the pork belly, skin side up, under the grill to crisp (watch the skin carefully so it doesn't burn)."],"basicInfo":["medium","30m","5h 30m","4 portions"]}