{"badges":["TM31","TM5","TM6"],"usefulItems":"cling film, baking paper, cocktail stick, wire rack, airtight container, large baking tray, baking tray and baking paper, refrigerator, oven","id":"r252589","imageLink":"https:\/\/3.bp.blogspot.com\/-SLg3mMMjm3s\/XZWrqQwvmoI\/AAAAAAAAfqs\/DlsrkNCb2QYSEQehP_MR9YYRl2lR-YGagCLcBGAsYHQ\/s1600\/0_rLWQYy154iw-556n.png","title":"Bloody Almond Finger Biscuits","publishedAt":"2017-10-23T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Almond Biscuits"},{"content":"130 g sugar"},{"content":"225 g unsalted butter, soft"},{"content":"1 large egg"},{"content":"1 tsp almond extract              (optional)"},{"content":"1 tsp vanilla extract"},{"content":"1 pinch fine sea salt"},{"content":"400 g plain flour"},{"isHeader":true,"content":"Decoration"},{"content":"200 g strawberry jam"},{"content":"46 flaked almonds"}],"nutrition":{"protein":"1 g","fat":"4 g","uom":"per 1 portion","carbohydrates":"13 g","calories":"393 kJ \/ 94 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Almond Biscuits"},{"content":"Place sugar in mixing bowl and grind <b>15 sec\/speed 9<b>."},{"content":"Add butter, egg, almond extract (if using), vanilla extract, salt and flour. Mix with aid of spatula through hole in mixing bowl lid <b>15 sec\/speed 6<b>. Divide dough in half and shape into disks. Tightly wrap dough in cling film and place in fridge for 1 hour. Clean mixing bowl."},{"content":"Towards the end of this time, preheat oven to 180째C. Line a baking tray with baking paper and set aside."},{"content":"Working with half the dough at a time, roll into 2 cm thick ropes. Cut finger-like pieces (approx. 46 total) then use a cocktail stick to mark 4 lines for the 'knuckles'. At one end of each piece, apply pressure to form the nail bed cavity. Place on prepared baking tray (approx. 3 cm apart) and bake for 12-18 minutes (180째C), or until lightly browned and cooked through. Allow to cool for 5 minutes before placing on a wire rack to cool completely."},{"isHeader":true,"content":"Decoration"},{"content":"Place jam in mixing bowl and heat <b>3 min\/90째C\/speed 1<b>. Dip flaked almonds into jam and place on fingernail cavity. Leave to set for 2 hours before serving. Store in an airtight container."}],"hintsAndTricks":["If jam sets before you have time to complete decorating, reheat remaining jam in mixing bowl <b>2 min\/90째C\/speed 1<b>.","Use a spoon to help drizzle jam over almond fingers.","For a gluten-free version: replace <b>400 g<b> plain flour with <b>400 g<b> gluten-free flour. Coconut flakes can be used to replace almonds for fingernails. Break or cut large coconut flakes into nail shapes.","For a truly ghoulish biscuit: lightly dip the end opposite the 'fingernail' into the hot jam and place back onto baking tray. Drizzle remaining jam over fingers to look like blood splatter. Let set for <b>2 hours<b> before serving.","Use <b>2 tsp<b> of vanilla extract if desired, when not using almond extract.","Replace strawberry jam with raspberry, mixed berry or another similarly coloured jam."],"basicInfo":["medium","40m","2h","46 pieces"]}