{"badges":["TM5","TM6"],"usefulItems":"frying pan, aluminium foil, oven, stove top","id":"r252884","imageLink":"https:\/\/3.bp.blogspot.com\/-yM_lOMhnQSg\/XZQGIiOy0pI\/AAAAAAAAb6g\/jzkjM_grZ0YQ7FaiYR1j6QOPfhw-E34uQCLcBGAsYHQ\/s1600\/0_IyfPMXqZKitm08WE.png","title":"Steak au Poivre","publishedAt":"2017-11-20T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"15 g black peppercorns"},{"content":"500 - 600 g beef fillet steak, trimmed, cut into 4 steaks"},{"content":"60 g beef stock"},{"content":"40 g brandy"},{"content":"60 g double cream"},{"content":"2 Tbsp olive oil"},{"content":"50 g unsalted butter, diced"},{"content":"1 pinch fine sea salt, or to taste"}],"nutrition":{"protein":"29 g","fat":"44 g","uom":"per 1 portion","carbohydrates":"3 g","calories":"2301 kJ \/ 550 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 50°C (or lowest setting) and place 5 dinner plates in to warm."},{"content":"Place peppercorns in mixing bowl and grind <b>5 sec\/speed 8<b> (see tips). Scrape down sides of mixing bowl with spatula. Transfer ground pepper to a sixth dinner plate and spread evenly. Press each steak firmly into the peppercorns: top, bottom and sides."},{"content":"Place beef stock, brandy and cream in mixing bowl then blend <b>4 sec\/speed 5<b>."},{"content":"Place oil in a heavy-based frying pan and heat until hot. Add steaks, pressing down firmly, and cook for approx. 2 minutes on each side over a high heat (see variation), then reduce heat."},{"content":"Add the beef stock-brandy-cream mix to pan, then cook over a medium heat for 30 seconds. Transfer steaks to a warm dinner plate, cover with foil and leave to rest while finishing sauce."},{"content":"Continue cooking sauce, stirring gently for 3-5 minutes until thickened and alcohol is cooked off."},{"content":"Add butter to pan, quickly stirring through sauce. Taste and season with salt."},{"content":"Transfer steaks to remaining warm dinner plates, pour over sauce and serve immediately with a salad, mashed potatoes, mashed pumpkin or baked potatoes."}],"hintsAndTricks":["Fillet steak is best for this dish. One portion is approx. <b>125-150 g.<b><br>Cooking time for steaks will vary depending on your preference and the thickness of the steaks. Using a meat thermometer will ensure the steaks are done to your preference: rare has an internal temperature of 60°C, medium-rare 65°C, medium 67°C and well done 75°C.","Of the warm dinner plates in the oven, four are for serving the steaks and the fifth is for resting the steaks after cooking while you make the sauce.","When crushing the peppercorns, watch and aim for a texture that is between chunky and powdery: a coarse grind.<br>You do not need to clean the mixing bowl after crushing the peppercorns and before commencing the sauce.","The sauce is traditionally made with Cognac but any brandy can be used.<br>Madeira, rum or port can be substituted for brandy to vary the flavour."],"basicInfo":["easy","20m","20m","4 portions"]}