{"badges":["TM5","TM6"],"usefulItems":"small bowl, tall glasses, heatproof glass dish","id":"r252594","imageLink":"https:\/\/3.bp.blogspot.com\/-YEDPJsuJof8\/XZXXfSoyXLI\/AAAAAAAAf04\/7mf9wWFTpBkxTBwbtBIBkjlNDF3X0foMgCLcBGAsYHQ\/s1600\/0_4sRm40NVntpT9aAY.png","title":"Butter Beer","publishedAt":"2017-10-23T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"60 g unsalted butter, diced"},{"content":"60 g whipping cream"},{"content":"30 g dark brown sugar"},{"content":"15 g maple syrup"},{"content":"½ tsp vanilla bean paste"},{"content":"30 g sweetened condensed milk"},{"content":"185 g water"},{"content":"15 g gelatine powder"},{"content":"240 g sugar"},{"content":"100 g egg whites"},{"content":"20 tin US \"cream soda\" cans, chilled (approx. 330 ml)"}],"nutrition":{"protein":"1 g","fat":"2 g","uom":"per 1 glass","carbohydrates":"64 g","calories":"1151 kJ \/ 275 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place 30 g butter, whipping cream, brown sugar, maple syrup and vanilla bean paste in mixing bowl then cook <b>9 min\/Varoma\/speed 2<b>."},{"content":"Add remaining 30 g butter and sweetened condensed milk then mix <b>15 sec\/speed 2<b>. Transfer to a heatproof bowl and set caramel aside to cool (approx. 30 minutes)."},{"content":"Place a bowl on mixing bowl lid and weigh in 140 g water. Sprinkle gelatine powder over and set bowl aside."},{"content":"Place sugar and remaining 45 g water in mixing bowl then heat <b>12 min\/Varoma\/speed 3<b>."},{"content":"Add reserved gelatined water and reserved caramel then mix <b>10 sec\/speed 6<b>. Transfer to a bowl and set aside. Clean and dry mixing bowl."},{"content":" <b>Insert butterfly whisk<b>. Place egg whites in mixing bowl and whip <b>4 min\/50°C\/speed 4<b> or until egg whites form stiff peaks. Mix <b>1 min\/speed 3<b> while slowly adding reserved caramel sauce through hole in mixing bowl lid onto rotating blades."},{"content":"Pour 1 can of cream soda into a tall glass or stein (see tip) and spoon fluffy caramel sauce on top of cream soda. Serve immediately."}],"hintsAndTricks":["Make your own vanilla bean paste: place <b>6-10 whole<b> vanilla bean pods in mixing bowl and grind <b>20 sec\/speed 10<b> or until pulverised. Add <b>3 Tbsp<b> pure vanilla extract and <b>2 tsp<b> xanthan gum (optional) then stir <b>3 sec\/speed 3<b>. Transfer to a glass jar and use as required.","Vanilla bean paste can be replaced with vanilla extract.","Make sure mixing bowl, lid and butterfly whisk are thoroughly clean and dry. Any residual grease or moisture will prevent eggs from properly aerating."],"basicInfo":["easy","5m","30m","20 glasses"]}