{"badges":["TM5","TM6"],"usefulItems":"cling wrap, pie pan (approx. 9 in.), parchment paper, baking weights, pastry brush, star-shaped cookie cutters, various sizes, baking sheet, rolling pin, refrigerator, oven","id":"r254150","imageLink":"https:\/\/3.bp.blogspot.com\/-FCr5uMPZpPw\/XZWdquYkYcI\/AAAAAAAAeow\/YafCCQkezTcaDHGcF-kDedqBZBzFzOVywCLcBGAsYHQ\/s1600\/0_KsKNRgtrywBtj-SR.png","title":"Cherry Pie","publishedAt":"2017-11-03T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Pecan Pie Crust"},{"content":"12 oz all-purpose flour"},{"content":"8 oz unsalted butter, chilled, cubed (½ in.) plus extra to grease"},{"content":"4 oz chopped pecans"},{"content":"3 oz sugar, plus extra to sprinkle"},{"content":"1 pinch salt"},{"isHeader":true,"content":"Cherry Filling"},{"content":"30 oz frozen cherries, pitted"},{"content":"5 oz sugar, plus extra to sprinkle on pie"},{"content":"1 tbsp orange liqueur (e.g. Cointreau)"},{"content":"1 tbsp lemon juice"},{"content":"4 tbsp corn starch"},{"content":"1 vanilla bean, seeds only"},{"content":"1 egg white, from a large egg"},{"content":"1 tbsp water"},{"content":"decorative sugar, to sprinkle"}],"nutrition":{"protein":"8 g","fat":"34 g","uom":"per 1 portion","carbohydrates":"91 g","calories":"2870 kJ \/ 686 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Pecan Pie Crust"},{"content":"Place flour, butter, pecans, sugar and salt into mixing bowl and chop <b>25 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula and mix <b>5 sec\/speed 5<b>. Form dough into a ball, flatten and wrap in cling wrap. Refrigerate for 1 hour. Meanwhile make filling."},{"isHeader":true,"content":"Cherry Filling"},{"content":"Place cherries, sugar, Cointreau, lemon juice, corn starch and vanilla bean seeds into mixing bowl, place simmering basket instead of measuring cup onto mixing bowl lid and cook <b>20 min\/250°F\/\/speed <b>. Set aside mixing bowl with Cherry Filling."},{"content":"Grease a pie pan (approx. 9 in.) and set aside. Preheat oven to 400°F."},{"content":"Roll out pie dough between two sheets of cling wrap into a circle (approx. 13 in.) with a ½ inch thickness. Line pie pan with dough, ensure top edge is ½ inch above pan rim and shape edge as desired. Roll out dough scraps, use cookie cutters to cut enough star shapes for topping pie, plus a few extra to garnish. Refrigerate pie crust and star shapes for 15 minutes."},{"content":"Line chilled pie dough with parchment and baking weights and blind-bake for 10 minutes (400°F) until slightly golden. Remove parchment and weights. Increase oven temperature to 425°F."},{"content":"Transfer Cherry Filling into pre-baked pie crust, top with some of the star shapes and reserve some to garnish. Combine egg white and water in a bowl, brush onto all stars with a pastry brush and sprinkle with decorative sugar. Transfer reserved stars onto a baking sheet lined with parchment."},{"content":"Bake pie and stars for 25 minutes (425°F) or until crust is golden. Chill before slicing. Garnish with additional baked stars and serve."}],"hintsAndTricks":["Dough can be pushed into pie pan instead of rolling dough out.","Baking weights can be replaced with 16 oz dry beans.","Handle dough as little as possible. If dough becomes too soft to work with re-chill until firm."],"basicInfo":["advanced","20m","2h 30m","8 portions"]}