{"badges":["TM31","TM5","TM6"],"usefulItems":"baking trays, baking paper, piping bag and nozzle, freezer bag, airtight container, oven, refrigerator","id":"r254887","imageLink":"https:\/\/1.bp.blogspot.com\/-eFEaJdYLfHI\/XZWqie0DHiI\/AAAAAAAAfZY\/mbE1Jc-omOIl7X2cQq8N4wZG8IgUjAYBQCLcBGAsYHQ\/s1600\/0_O8BZwzI0LTSB2iQ7.png","title":"Nougat Biscuits","publishedAt":"2017-12-11T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"3 egg whites, from medium eggs"},{"content":"60 g hazelnuts, with skin"},{"content":"100 g unsalted butter, soft"},{"content":"100 g sugar"},{"content":"130 g plain flour"},{"content":"150 g nougat, cut in pieces (2 cm)"},{"content":"1 - 2 Tbsp icing sugar, for dusting"}],"nutrition":{"protein":"1 g","fat":"4 g","uom":"per 1 piece","carbohydrates":"7 g","calories":"270 kJ \/ 64 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 160°C and line 2 baking trays with baking paper."},{"content":" <b>Insert butterfly whisk<b>. Place egg whites in mixing bowl and whisk <b>2 min\/speed 3.5<b>. <b>Remove butterfly whisk<b> then transfer to a bowl and set aside."},{"content":"Place hazelnuts in mixing bowl and grind <b>15 sec\/speed 10<b>. Scrape down sides of mixing bowl with spatula then grind again <b>15 sec\/speed 10<b>."},{"content":"Add butter, sugar, flour and reserved whipped egg whites then mix <b>10 sec\/speed 4<b>."},{"content":"Transfer mixture to a piping bag fitted with a plain or star-shaped nozzle (Ø 7 mm) and pipe small circles (Ø 2 cm) on prepared baking trays. Bake (one baking tray after another) for 10-12 minutes (160°C) and allow to cool on trays (approx. 20 minutes). Meanwhile, clean mixing bowl."},{"content":"Place nougat in mixing bowl and melt <b>3 min\/50°C\/speed 1<b>. Transfer to a freezer bag and seal bag."},{"content":"Turn half the cookies over so flat sides are facing up. Cut a small hole (Ø approx. 3 mm) in the corner of freezer bag and pipe a large drop of nougat onto each cookie. Place remaining cookies, flat side down, on top then refrigerate for approx. 1 hour."},{"content":"Dust cookies with icing sugar before serving or store in an airtight container."}],"basicInfo":["medium","45m","2h 30m","45 pieces"]}