{"badges":["TM31","TM5","TM6"],"usefulItems":"bowl, sealable container","id":"r260636","imageLink":"https:\/\/1.bp.blogspot.com\/-dkKNfc4MPNc\/XZWeEd4K7MI\/AAAAAAAAeuY\/zFLFsD3bN2sVcpJFKq4yjvvXhSULwESKgCLcBGAsYHQ\/s1600\/0_SLeW_8OiaEAUYPbD.png","title":"Marzipan","publishedAt":"2018-06-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"450 g white sugar"},{"content":"1 vanilla pod, seeds scraped"},{"content":"450 g blanched almonds (see Tips)"},{"content":"2 tsp glycerine (optional - see Tips)"},{"content":"2 egg whites"},{"content":"1 tsp natural almond extract (see Tips)"},{"content":"½ tsp lemon juice"},{"content":"pure icing sugar, for dusting"}],"nutrition":{"protein":"5.1 g","fat":"12.6 g","uom":"per 1 portion","carbohydrates":"25.2 g","calories":"971.9 kJ \/ 231.4 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place sugar and vanilla seeds into mixing bowl and mill <b>1 min 30 sec\/speed 10<b>. Transfer into a bowl and set aside."},{"content":"Place almonds into mixing bowl and chop <b>20 sec\/speed 7<b>."},{"content":"Add glycerine (optional), egg whites, almond extract, lemon juice and reserved vanilla sugar and mix <b>10 sec\/speed 3<b>, then knead <b>1 min\/<b> or until a dough forms. Lightly flour a work surface with icing and knead together to form a dough. Use immediately or store in a sealable container in the pantry (see Tips)."}],"hintsAndTricks":["To blanch raw almonds, place almonds into a saucepan of boiling water and boil for 1 minute. Drain, then rinse in cold water. Use a paper towel to blot almonds dry, then gently squeeze them from their skin. Allow almonds to dry before using.","Glycerine helps make the paste more pliable and prevents cracking.","Almond extract intensifies the flavour, adjust to your taste.","To store marzipan, wrap tightly in plastic wrap and place into an airtight container (this prevents it from becoming too hard). You can then store it in the pantry for up to 1 month.","You can use marzipan to decorate and cover cakes, to make biscuits or to make decorative shapes (to place on top of cakes, or use to decorate gingerbread houses)."],"basicInfo":["easy","10m","10m","20 portions"]}