{"badges":["TM31","TM5","TM6"],"usefulItems":"bowl, baking tray (30 x 40 cm), baking paper, pastry brush, small bowl, oven","id":"r260525","imageLink":"https:\/\/4.bp.blogspot.com\/-xVh-MoehPLc\/XZMvcRivKwI\/AAAAAAAAaR4\/A0_L40wcJaw7SRQ6w7EO2tRB9jx4dRJ2ACLcBGAsYHQ\/s1600\/0_gAiD1TIQhJI_xnw_.png","title":"Mushroom-stuffed mushrooms","publishedAt":"2018-02-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"16 fresh cup mushrooms, brushed clean (stems removed and reserved)"},{"content":"20 g blanched almonds"},{"content":"40 g Parmesan cheese"},{"content":"40 g butter"},{"content":"30 g olive oil"},{"content":"60 g eschalots, cut into quarters"},{"content":"1 garlic clove"},{"content":"1 egg"},{"content":"½ bunch fresh flat-leaf parsley, leaves only"},{"content":"1 pinch ground nutmeg"},{"content":"½ tsp salt, to taste"},{"content":"1 - 2 pinches ground black pepper"}],"nutrition":{},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 190°C. Line a baking tray (30 x 40 cm) with baking paper and set aside."},{"content":"Hollow out the centre of each mushroom cap (reserving stems) to create space for filling and place, hollow-side up, onto baking tray."},{"content":"Place almonds into mixing bowl and mill <b>10 sec\/speed 8<b>. Transfer into a bowl and set aside."},{"content":"Place Parmesan into mixing bowl and chop <b>5 sec\/speed 9<b>. Transfer into a separate bowl and set aside. Clean and dry mixing bowl."},{"content":"Place butter and oil into mixing bowl and heat <b>1 min\/Varoma\/speed 1<b>. Transfer 2 tablespoons of the melted butter mixture into a small bowl and set aside."},{"content":"Add eschalots, garlic, egg, parsley, nutmeg, salt, pepper and mushroom stems to mixing bowl and cook <b>10 min\/Varoma\/speed 2<b>."},{"content":"Add reserved grated Parmesan and mix <b>10 sec\/speed 6<b>."},{"content":"Brush each mushroom entirely with the reserved melted butter mixture and carefully spoon 1½ teaspoons of the mushroom mixture into each mushroom cap and sprinkle with reserved almonds. Place onto prepared tray and bake for 20 minutes (190°C - see Tip), until golden on top. Serve while warm."}],"hintsAndTricks":["Cooking time may vary depending on the size of your mushrooms. We recommend using medium to large mushrooms for this recipe."],"basicInfo":["easy","20m","50m","4 portions"]}