{"badges":["TM5","TM6"],"usefulItems":"large frying pan, large plate, rolling pin, cling film, baking tray, fine sieve, pastry brush, saucepan, sharp knife, refrigerator, hob, oven","id":"r265317","imageLink":"https:\/\/2.bp.blogspot.com\/-vDZDZ6URxSU\/XZQGDP3-IYI\/AAAAAAAAb5o\/wxCbCb6I7iIiLtdVafORa2uvGQuJeEoMQCLcBGAsYHQ\/s1600\/0_HGhu8HYvzXj2lNaI.png","title":"Individual Beef Wellingtons with Red Wine Jus","publishedAt":"2017-12-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Mushroom Duxelle"},{"content":"225 g fresh portobello mushrooms, quartered"},{"content":"10 g dried porcini mushrooms, soaked in boiling water for 15 minutes then drained and squeezed of excess water"},{"content":"50 g shallots, halved"},{"content":"30 g unsalted butter, diced"},{"content":"1 garlic clove"},{"content":"50 g Madeira wine"},{"content":"2 sprigs fresh thyme, leaves only"},{"content":"1 pinch fine sea salt"},{"content":"1 pinch ground black pepper"},{"isHeader":true,"content":"Beef Wellingtons"},{"content":"200 g unsalted butter, diced (2 cm), then frozen for 1 hour"},{"content":"200 g plain flour, plus extra for dusting"},{"content":"90 g water, cold"},{"content":"½ tsp fine sea salt, plus extra for seasoning"},{"content":"groundnut oil, for searing, plus extra for greasing"},{"content":"4 beef fillet steaks, (180-200 g each, 3-4 cm thick)"},{"content":"ground black pepper, for seasoning"},{"content":"2 large eggs, beaten"},{"isHeader":true,"content":"Red Wine Jus"},{"content":"50 g shallots, halved"},{"content":"1 garlic clove,"},{"content":"1 sprig fresh thyme, leaves only"},{"content":"50 g salted butter, diced"},{"content":"100 g port,"},{"content":"150 g red wine"},{"content":"100 g beef stock, hot"},{"content":"20 g balsamic vinegar,"},{"content":"35 g dark brown sugar"},{"content":"1 pinch fine sea salt, or to taste"},{"content":"1 pinch ground black pepper, or to taste"}],"nutrition":{"protein":"49 g","fat":"66 g","uom":"per 1 portion","carbohydrates":"34.8 g","calories":"4024 kJ \/ 967 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Mushroom Duxelle"},{"content":"Place portobello mushrooms, porcini mushrooms, shallots, butter and garlic in mixing bowl then chop  <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula then sauté <b>3 min\/100°C\/speed 1<b>."},{"content":"Add Madeira, thyme, salt and pepper then, without measuring cup, sauté <b>40-50 min\/90°C\/\/speed 1<b> until mixture has become a dry paste and most of the liquid has evaporated. Transfer to a bowl and place in fridge until needed (see tip)."},{"isHeader":true,"content":"Beef Wellingtons"},{"content":"Place butter, flour, water and salt in mixing bowl then mix <b>20 sec\/speed 6<b>. Tip dough out, shape into a ball then wrap in cling film and place in fridge for 20 minutes. Meanwhile, clean mixing bowl and continue with recipe."},{"content":"In a large frying pan, heat oil over a high heat until very hot. Place steaks in pan, 2 at a time, and sear for 20 seconds on each side. Transfer to a large plate to cool. Once steaks are cool, season well with salt and pepper."},{"content":"On a lightly-floured surface, roll out chilled dough to a long rectangle (approx. 60 cm x 20 cm). Fold bottom third up to cover middle third then fold top third down over this. Seal edges then give dough a quarter turn so that the fold is on the left. Repeat rolling and folding process twice more."},{"content":"Divide pastry into 4 equal-sized pieces and, on a lightly-floured surface, roll each one out to a square (approx. 20 cm). If necessary, trim edges to form a neat square."},{"content":"Brush each pastry square with beaten egg. Place ⅛ duxelle mixture in centre of one pastry square, then place a steak on top. Top steak with another ⅛ duxelle mixture."},{"content":"Bring 2 opposite corners of pastry up over the steak to overlap in the centre, tucking in the sides to make a neat parcel. Brush with beaten egg, then bring remaining 2 corners to the middle to overlap each other. Turn parcel over, brush all over with beaten egg then lightly score the top twice with a sharp knife. Repeat until all pastry is used."},{"content":"Carefully transfer parcels to a greased baking tray and chill for 30 minutes. Meanwhile, preheat oven to 220°C and make red wine jus."},{"isHeader":true,"content":"Red Wine Jus"},{"content":"Place shallots, garlic and thyme in mixing bowl then chop <b>2 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add butter and, without measuring cup, cook <b>4 min\/Varoma\/speed 1<b>."},{"content":"Add port, red wine, beef stock, balsamic vinegar and sugar then, with simmering basket in place of measuring cup, cook <b>14-16 min\/Varoma\/speed 3<b> until sauce reaches desired consistency."},{"content":"Pass through a fine sieve into a saucepan, season to taste then keep warm."},{"isHeader":true,"content":"Cooking"},{"content":"Cook beef Wellingtons on a high shelf in the oven for 20 minutes (220°C) (rare), 25 minutes (medium-rare) or 30 minutes (medium-well). Serve immediately, accompanied by red wine jus and vegetables of choice."}],"hintsAndTricks":["Make light work of this impressive dish – all components are easily made in your Thermomix. From crisp, buttery pastry to the rich mushroom duxelle that covers succulent beef fillet, your friends and family will all enjoy this luxurious main course.","The mushroom duxelle and pastry can be made <b>1-2 days<b> in advance and placed in the fridge until required.","The beef Wellingtons can be assembled <b>5-6 hours<b> in advance, then placed in the fridge until required. When ready to cook, remove from fridge and brush with egg wash, then cook accordingly."],"basicInfo":["advanced","40m","2h 10m","4 portions"]}