{"badges":["TM5","TM6"],"usefulItems":"rolling pin, large frying pan, tea towel, hob","id":"r270141","imageLink":"https:\/\/2.bp.blogspot.com\/-3MZVB3ZDRrc\/XZQGs6nktMI\/AAAAAAAAcA0\/X7NsOoTVSJ0qGcdqU7FY6sqZwfqrmIWiACLcBGAsYHQ\/s1600\/0_Vzg-TvnPiaXX8KgL.png","title":"Beef With Lemon Grass (Kuruma Iraichchi) And Coconut Roti","publishedAt":"2017-11-27T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Coconut Roti"},{"content":"350 g plain flour, plus extra for dusting"},{"content":"200 g fresh coconut (see tips)"},{"content":"100 g water, lukewarm"},{"content":"½ - 1 tsp fine sea salt, to taste"},{"content":"2 Tbsp oil, plus extra for frying"},{"isHeader":true,"content":"Kuruma Iraichchi"},{"content":"750 g beef chuck steak, boneless, diced (approx. 3 cm)"},{"content":"2 tsp fine sea salt"},{"content":"2 - 4 tsp ground black pepper, to taste"},{"content":"1 Tbsp ground coriander"},{"content":"2 tsp ground cumin"},{"content":"1 tsp dried fennel seeds"},{"content":"3 garlic cloves"},{"content":"1 cm fresh root ginger, peeled, cut in round slices (2 mm)"},{"content":"3 - 5 bird's eye chillies, fresh, deseeded if preferred"},{"content":"2 onions, quartered"},{"content":"½ tsp ground turmeric"},{"content":"8 fresh curry leaves"},{"content":"2 pandan leaves, tied in a knot"},{"content":"2 Tbsp white wine vinegar"},{"content":"1 stalk fresh lemon grass, halved"},{"content":"1 Tbsp tomato purée"},{"content":"270 g coconut cream"},{"content":"1 Tbsp ghee"},{"content":"1 lime, cut in wedges for serving"}],"nutrition":{"protein":"38 g","fat":"41 g","uom":"per 1 portion","carbohydrates":"48 g","calories":"3054 kJ \/ 727 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Coconut Roti"},{"content":"Place flour, coconut, water, salt and oil in mixing bowl then mix <b>6 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Knead <b>1 min\/<b>. Transfer dough to a lightly floured work surface (see tips). Divide dough into 12 pieces and use a rolling pin to flatten into round rotis (approx. Ø 12 cm)."},{"content":"Place a large frying pan over a medium heat and add oil. Place 1 roti in hot frying pan and fry until golden (approx. 2-3 minutes on each side). Transfer to a plate and cover with a tea towel to keep warm. Repeat with remaining roti. Cover to keep warm and set aside. Clean mixing bowl."},{"isHeader":true,"content":"Kuruma Iraichchi"},{"content":"Place a bowl on mixing bowl lid and weigh in beef. Add salt and pepper then combine until meat is evenly coated. Set bowl aside."},{"content":"Place coriander in mixing bowl and, without measuring cup, toast <b>2 min\/Varoma\/speed 2<b>. Transfer to bowl with beef and stir to combine. Set bowl aside."},{"content":"Place cumin and fennel seeds in mixing bowl then, without measuring cup, toast <b>1 min\/Varoma\/speed 2<b>. Transfer to a small bowl and set aside."},{"content":"Place garlic, ginger and chillies in mixing bowl then chop <b>3 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add onions and chop <b>3 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add turmeric, curry leaves, pandan leaves, vinegar, lemon grass, tomato puree, coconut cream and reserved beef then cook <b>8 min\/Varoma\/\/speed <b>."},{"content":"With simmering basket in place of measuring cup on mixing bowl lid, cook <b>50 min\/90°C\/\/speed <b>."},{"content":"Add ghee and cook <b>5 min\/90°C\/\/speed <b>."},{"content":"Add reserved toasted spice mixture and, with simmering basket in place of measuring cup on mixing bowl lid, cook <b>10 min\/Varoma\/\/speed <b>, until sauce has thickened. Serve warm with coconut roti and lime wedges."}],"hintsAndTricks":["You can purchase fresh coconut at most supermarkets or fruit and vegetable stores.","For a milder curry, reduce the number of chillies and deseed before using.","To save time, prepare coconut roti up to <b>step 2<b> and set aside, then continue with recipe. Fry roti in <b>step 9<b> when Kuruma Iraichchi is cooking. Cover to keep warm and set aside until Kuruma iraichchi is ready to serve.","Coconut roti can be prepared a day ahead and reheated in a warm oven before serving.","To save time, use shop-bought roti and start recipe at <b>step 4.<b>"],"basicInfo":["medium","1h","1h 40m","6 portions"]}