{"badges":["TM5","TM6"],"usefulItems":"griddle pan, aluminium foil, hob","id":"r281778","imageLink":"https:\/\/2.bp.blogspot.com\/-7hQJ1xlxMzY\/XZafmNcN_KI\/AAAAAAAAgwA\/yhowujl4DBIWmgf99JHz_QhwXZicCOwngCLcBGAsYHQ\/s1600\/0_s88cRPRybvhQiKzX.png","title":"Smashed Plum Tomato Bruschetta with Poached Eggs","publishedAt":"2018-12-03T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"30 g extra virgin olive oil, plus extra for drizzling"},{"content":"8 plum tomatoes, large, halved"},{"content":"2 garlic cloves, sliced (optional)"},{"content":"3 sprigs fresh thyme, leaves only"},{"content":"½ tsp fine sea salt, plus extra for sprinkling and seasoning"},{"content":"4 slices sourdough bread"},{"content":"1300 g water"},{"content":"4 large eggs, room temperature"},{"content":"ground black pepper, to taste"}],"nutrition":{"protein":"20.5 g","fat":"16 g","uom":"per 1 portion","carbohydrates":"57.2 g","calories":"1954 kJ \/ 465 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place oil, tomatoes, garlic (if using), thyme and salt in mixing bowl then pulse <b>Turbo\/0.5 sec\/1 time<b>. Cook <b>12 min\/98°C\/speed <b>. Meanwhile, heat a griddle pan until hot, drizzle bread slices with oil and sprinkle with salt then grill bread on both sides. Set aside."},{"content":"Transfer cooked tomato sauce to a bowl and cover to keep warm."},{"content":"Without cleaning mixing bowl, insert simmering basket then place water in mixing bowl."},{"content":"Place eggs in simmering basket and cook <b>16 min\/70°C\/speed 4<b> (see tip)."},{"content":"Remove simmering basket with aid of spatula. Top each slice of toast with some tomato sauce. Crack the tip of each egg carefully and peel back the shell. Gently tip out the whole egg onto the toast."},{"content":"Season to taste and serve immediately."}],"hintsAndTricks":["A perfect weekend brunch with hassle-free poached eggs thanks to your Thermomix. Prepare the tomato sauce in advance then gently reheat, before spreading on griddled sourdough and topping with perfectly runny eggs. One for the whole family to enjoy together.","The cooking time for the eggs is based on large eggs at room temperature. Any variation to this may produce a different result."],"basicInfo":["easy","15m","40m","4 portions"]}