{"badges":["TM5","TM6"],"usefulItems":"cling film, large frying pan, large bowl, refrigerator, hob","id":"r286188","imageLink":"https:\/\/1.bp.blogspot.com\/-8KzhqY-N5bk\/XZVRR00vqtI\/AAAAAAAAdMQ\/9OPTDTkm9gYAwaMiERWOc9DJGXW2X6jrQCLcBGAsYHQ\/s1600\/0_kXumBpMlA5_m55sq.png","title":"Beetroot and Halloumi Burgers","publishedAt":"2018-12-03T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Beetroot Burgers"},{"content":"100 g bread, torn in pieces"},{"content":"240 g tinned chickpeas, rinsed, drained (1 x 400 g tin)"},{"content":"250 g cooked beetroot, halved"},{"content":"1 garlic clove"},{"content":"2 sprigs fresh parsley, leaves only"},{"content":"1 Tbsp ground cumin"},{"content":"½ tsp fine sea salt"},{"content":"2 pinches ground black pepper"},{"content":"1 medium egg"},{"isHeader":true,"content":"Chilli Jam"},{"content":"300 g red peppers, quartered"},{"content":"3 fresh red chillies, halved, deseeded if desired"},{"content":"150 g caster sugar"},{"content":"75 g cider vinegar"},{"content":"35 g water"},{"isHeader":true,"content":"Assembly"},{"content":"1 Tbsp olive oil"},{"content":"250 g halloumi cheese, sliced (1 cm)"},{"content":"6 brioche burger buns"}],"nutrition":{"protein":"22.3 g","fat":"21.2 g","uom":"per 1 portion","carbohydrates":"73.5 g","calories":"2597 kJ \/ 617 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Beetroot Burgers"},{"content":"Place bread in mixing bowl and chop <b>5 sec\/speed 8<b>. Transfer to a large bowl and set aside."},{"content":"Place chickpeas, beetroot, garlic, parsley, cumin, salt and pepper in mixing bowl then chop <b>10 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add egg and mix <b>10 sec\/speed 3<b>. Transfer to bowl with breadcrumbs and stir with spatula until combined."},{"content":"Shape mixture into 6 patties (approx. 110 g each, Ø 8 cm). Transfer to a plate, cover with cling film and place in fridge for 30 minutes. Meanwhile, clean mixing bowl and prepare chilli jam."},{"isHeader":true,"content":"Chilli Jam"},{"content":"Place red peppers and chillies in mixing bowl then chop <b>5 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula then chop again <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add sugar, vinegar and water then, with simmering basket in place of measuring cup, cook <b>20-25 min\/Varoma\/speed 0.5<b> until desired consistency is reached."},{"isHeader":true,"content":"Assembly"},{"content":"Heat oil in a large frying pan over a medium heat and fry chilled beetroot patties until browned and crisp on the edges (approx. 3-4 minutes on each side). Transfer to a plate and keep warm."},{"content":"In the same frying pan, fry halloumi until lightly golden (approx. 1-2 minutes on each side)."},{"content":"Serve patties in brioche buns, with slices of halloumi and chilli jam to taste."}],"hintsAndTricks":["Sweet, earthy beetroot, smoky cumin and fresh parsley come together to make these fantastic veggie burgers. Shaped into colourful patties that are pan-fried until crispy, then served in a sweet brioche bun with homemade chilli jam, these burgers are real crowd-pleasers.","Serve with sweet potato fries and a side salad for a complete meal."],"basicInfo":["easy","35m","1h","6 portions"]}