{"badges":["TM5","TM6"],"usefulItems":"baking paper, pastry brush, large baking tray, oven","id":"r292362","imageLink":"https:\/\/1.bp.blogspot.com\/-0vopud87AIo\/XZQup3xensI\/AAAAAAAAcVs\/lnDAplgAzusG9-Pqmn99nW9g5GfpcOwIwCLcBGAsYHQ\/s1600\/0_4OsyB9YUZjqWsEFn.png","title":"Salmon Filo Spiral","publishedAt":"2018-12-03T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"180 g unsalted butter, diced"},{"content":"10 g fresh parsley leaves"},{"content":"¼ - ½ fresh red chilli, to taste"},{"content":"130 g fresh baby spinach"},{"content":"250 g cream cheese"},{"content":"20 g lemon juice"},{"content":"1 tsp fine sea salt"},{"content":"100 g pecan nuts, roasted"},{"content":"300 g fresh salmon fillets, skinless, cut in pieces"},{"content":"12 sheets filo pastry, plus extra as needed"}],"nutrition":{"protein":"22.8 g","fat":"57 g","uom":"per 1 portion","carbohydrates":"19.8 g","calories":"2853 kJ \/ 679 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 200°C and line a large baking tray with baking paper. Place a long sheet of baking paper (130 cm) on a work surface."},{"content":"Place butter in mixing bowl and melt <b>2 min 30 sec\/80°C\/speed 2<b>. Transfer to a bowl and set aside."},{"content":"Place parsley and chilli in mixing bowl then chop <b>2 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula then chop again <b>2 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add spinach, cream cheese, lemon juice and salt then, with aid of spatula, mix <b>10 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add pecans and salmon then mix <b>5 sec\/speed 5<b>."},{"content":"Working as quickly as possible to avoid pastry drying out, lay 3 sheets filo pastry end-to-end on long sheet of baking paper then brush generously with reserved melted butter. Lay another 3 sheets filo pastry on top and brush with more melted butter. Repeat for 2 more layers, brushing generously with melted butter after each layer."},{"content":"Evenly distribute salmon mixture along one long side of pastry sheets forming a long log. Brush remaining exposed pastry with melted butter, then carefully roll pastry into a long sausage shape to encase filling. Coil pastry around itself into a spiral, brushing with extra melted butter as needed, then transfer to prepared tray."},{"content":"Patch up any breaks in pastry with small pieces of filo and melted butter."},{"content":"Bake for 30-40 minutes (200°C) until pastry is golden and crispy. Cut in wedges and serve hot."}],"hintsAndTricks":["A creative way to use salmon, this dish will impress everyone at your dinner table. It's a great option when introducing fish to fussier eaters as combining cream cheese and crunchy pecan nuts gives the salmon a milder flavour. Cut the flaky pastry spiral into wedges and serve with a fresh green salad,"],"basicInfo":["medium","25m","1h 10m","6 portions"]}