{"badges":["TM5","TM6"],"usefulItems":"cling film, rolling pin, large baking trays, baking paper, wire rack, airtight container, refrigerator, oven","id":"r302242","imageLink":"https:\/\/1.bp.blogspot.com\/-OznizpkbVQA\/XZWp9cK_qLI\/AAAAAAAAfRM\/hHUSCfRyszw2w_XPnCztDkjBEYmCvpKUACLcBGAsYHQ\/s1600\/0_8nRHr16S5vNzi5-D.png","title":"Chocolate Orange Pinwheel Biscuits","publishedAt":"2018-12-03T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"140 g caster sugar"},{"content":"½ orange, thin peelings of skin only"},{"content":"220 g unsalted butter, soft"},{"content":"350 g plain flour"},{"content":"1 large egg"},{"content":"1 Tbsp cocoa powder"}],"nutrition":{"protein":"1.6 g","fat":"6.5 g","uom":"per 1 piece","carbohydrates":"13.7 g","calories":"504 kJ \/ 121 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place sugar and orange peel in mixing bowl then grind <b>8 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add butter and mix <b>30 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula then mix again <b>30 sec\/speed 4<b>."},{"content":"Add flour and egg then mix <b>1 min\/speed 4<b>. Set scales to zero and remove 350 g dough (scales will show -350 g), flatten into a rectangle then wrap in cling film."},{"content":"Add cocoa powder to remaining dough in mixing bowl and mix <b>20 sec\/speed 4<b>. Tip out, flatten into a rectangle then wrap in another piece of cling film. Place both pieces of dough in fridge to rest for 1 hour."},{"content":"After this time, roll out each piece of rested dough, between two pieces of cling film, to a rectangle (approx. 28 cm x 22 cm x 5 mm). Remove cling film then place chocolate layer on top of plain one. Lightly roll over surface with a rolling pin to join layers together."},{"content":"Roll up from long edge of dough tightly into a log, removing any air pockets as you go. Wrap log in cling film and place in fridge for 2 hours or overnight."},{"content":"After this time, preheat oven to 170°C and line 2 large baking trays with baking paper."},{"content":"Remove cling film then slice log into 5 mm thick biscuits. Arrange on prepared trays and bake for 10-12 minutes (170°C) until lightly golden."},{"content":"Transfer to a wire rack to cool completely before serving or storing in an airtight container until needed."}],"hintsAndTricks":["These pretty pinwheel biscuits are flavoured with the winning combination of chocolate and orange. They look impressive and are fun to create, making it a great one to do with the kids. Enjoy with a warm mug of cocoa for elevenses or afternoon tea.","The recipe can be made in advance up to <b>step 6<b> then frozen before baking. Defrost in the fridge overnight or leave to thaw at room temperature for <b>30 minutes<b> before slicing and baking."],"basicInfo":["medium","35m","3h 45m","30 pieces"]}