{"badges":["TM5","TM6"],"usefulItems":"loaf tin (900 g\/2 lb), wire rack, toaster, baking paper, skewer, oven","id":"r304668","imageLink":"https:\/\/4.bp.blogspot.com\/-40NAURQ0TH4\/XZafZW0rnoI\/AAAAAAAAgt4\/scZpLqF8ncorZw259KufGTAQr6FbR6i0QCLcBGAsYHQ\/s1600\/0_mRA2V9u30vzeiR6g.png","title":"Seeded Breakfast Bread with Avocado Ricotta Spread and Smoked Salmon","publishedAt":"2018-12-03T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Seeded Breakfast Bread"},{"content":"250 g wholemeal flour"},{"content":"230 g spelt flour"},{"content":"70 g sunflower seeds, plus 2 tsp for sprinkling"},{"content":"35 g black sesame seeds, plus 1 tsp for sprinkling"},{"content":"1 Tbsp caraway seeds, plus 1 tsp for sprinkling (optional)"},{"content":"1 Tbsp linseeds, plus 1 tsp for sprinkling"},{"content":"2 tsp fine sea salt"},{"content":"2 tsp baking powder"},{"content":"1 tsp bicarbonate of soda"},{"content":"170 g whole milk"},{"content":"180 g buttermilk"},{"content":"30 g runny honey"},{"content":"20 g extra virgin olive oil, plus extra for greasing"},{"isHeader":true,"content":"Avocado Ricotta Spread"},{"content":"125 g ricotta cheese"},{"content":"3 ripe avocados, quartered"},{"content":"2 Tbsp lemon juice"},{"content":"2 pinches fine sea salt, or to taste"},{"content":"2 pinches ground black pepper, or to taste, plus extra for sprinkling"},{"isHeader":true,"content":"Assembly"},{"content":"100 g smoked salmon, sliced"},{"content":"1 lemon, cut in wedges"}],"nutrition":{"protein":"17.7 g","fat":"27.5 g","uom":"per 1 portion","carbohydrates":"22.8 g","calories":"1768 kJ \/ 425 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Seeded Breakfast Bread"},{"content":"Preheat oven to 180°C. Grease and line a loaf tin (900 g\/2 lb) with baking paper."},{"content":"Place wholemeal flour, spelt flour, 70 g sunflower seeds, 35 g black sesame seeds, 1 Tbsp caraway seeds (if using), 1 Tbsp linseeds, salt, baking powder and bicarbonate of soda in mixing bowl then mix <b>20 sec\/speed 3<b>."},{"content":"Add milk, buttermilk, honey and oil then mix <b>30 sec\/speed 3<b>. Transfer to prepared tin then sprinkle with remaining 2 tsp sunflower seeds, 1 tsp black sesame seeds, 1 tsp caraway seeds (if using) and 1 tsp linseeds, pressing gently to adhere. Bake for 1 hour (180°C), rotating tin halfway through, or until a skewer inserted in centre comes out clean."},{"content":"Leave to cool in tin for 20 minutes before removing to a wire rack to cool completely."},{"isHeader":true,"content":"Avocado Ricotta Spread"},{"content":" <b>Insert butterfly whisk<b>. Place ricotta in mixing bowl and whip <b>10 sec\/speed 3<b>. <b>Remove butterfly whisk<b>."},{"content":"Add avocados, lemon juice, salt and pepper then mix <b>10 sec\/speed 3<b>."},{"isHeader":true,"content":"Assembly"},{"content":"Cut 6 slices of cooled seeded bread and toast on both sides in a toaster or griddle pan. Spread each slice with plenty of avocado ricotta spread. Top with smoked salmon and a sprinkle of pepper then serve with lemon wedges."}],"hintsAndTricks":["Cooled bread can be tightly wrapped and stored for <b>3 days,<b> or frozen for up to <b>1 month.<b>","Our version of the ever-popular avocado on toast has a slight twist with the addition of ricotta. Served on a seedy and nutritious loaf that requires no proving time, it makes a great option when you want fresh bread in the morning. Topping the toast with omega 3-rich salmonalso boosts the protein, keeping you fuller for longer.","Could also be topped with a poached egg. See <i>Smashed Plum Tomato Bruschetta with Poached Eggs<\/i> for method."],"basicInfo":["easy","20m","3h 20m","6 portions"]}