{"badges":["TM5","TM6"],"usefulItems":"wire rack, baking trays, baking paper, airtight container, oven, refrigerator","id":"r304369","imageLink":"https:\/\/1.bp.blogspot.com\/-ltB_alq0NNc\/XZWqZoVt38I\/AAAAAAAAfXQ\/VwCwt6bDcfs_fbQtYtbM3vxew-ZXIsheACLcBGAsYHQ\/s1600\/0_KNxu5NJRWcTn32AP.png","title":"Chocolate Thumbprint Biscuits","publishedAt":"2018-12-03T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Biscuits"},{"content":"250 g unsalted butter, soft"},{"content":"200 g granulated sugar"},{"content":"1 medium egg"},{"content":"1 Tbsp vanilla extract"},{"content":"350 g plain flour"},{"content":"½ tsp fine sea salt"},{"isHeader":true,"content":"Ganache"},{"content":"180 g milk chocolate, small pieces or callets"},{"content":"80 g double cream"}],"nutrition":{"protein":"1.6 g","fat":"7.7 g","uom":"per 1 piece","carbohydrates":"16.8 g","calories":"607 kJ \/ 145 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Biscuits"},{"content":"Line 2 baking trays with baking paper."},{"content":"Place butter and sugar in mixing bowl then mix <b>2 min\/speed 4<b>."},{"content":"Add egg and vanilla extract then mix <b>20 sec\/speed 4<b>."},{"content":"Add flour and salt then mix <b>20 sec\/speed 4<b>. Finish mixing by hand with spatula if necessary."},{"content":"Roll heaped tablespoons of dough into balls then place on prepared trays, leaving 3-4 cm between each. Make an indent in dough with your thumb or the back of a teaspoon. Place trays in fridge for 1½ hours. Meanwhile, clean mixing bowl. Towards the end of this time, preheat oven to 180°C."},{"content":"Bake for 12-14 minutes (180°C), turning the trays halfway through, until lightly golden around the edges. If indents puff up, use the back of a teaspoon to push down again. Leave biscuits to rest on trays for 10 minutes, again using a teaspoon to recreate indents if necessary, then transfer to a wire rack to cool completely."},{"isHeader":true,"content":"Ganache"},{"content":"Place chocolate in mixing bowl and grate <b>10 sec\/speed 10<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add cream and heat <b>2 min 30 sec\/50°C\/speed 3<b>."},{"content":"Spoon approx. 1 tsp ganache into the indent of each biscuit, then leave to set for 30 minutes before serving or storing in an airtight container until needed."}],"hintsAndTricks":["While away a weekend afternoon in the kitchen making these fun thumbprint biscuits. Typically made with jam, we’ve filled ours with a rich chocolate ganache which is quick and easy to make in the Thermomix."],"basicInfo":["easy","30m","3h","28 pieces"]}