{"badges":["TM5","TM6"],"usefulItems":"icing spatula, Thermomix heart-shaped silicone cake mold, serving plate, refrigerator","id":"r310828","imageLink":"https:\/\/2.bp.blogspot.com\/-N2QT6vSVwxA\/XZWdLy5sMeI\/AAAAAAAAei8\/jdD3JIfoy60ebKNiVzW4M3Fcb1kRzwdAwCLcBGAsYHQ\/s1600\/0_CThH9HixaLl0D9pw.png","title":"Valentine's Decadent Steamed Chocolate Cake","publishedAt":"2018-02-02T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Chocolate Cake"},{"content":"4 oz unsalted butter, in pieces, plus extra to grease"},{"content":"4 oz sugar"},{"content":"3 oz evaporated milk"},{"content":"3 oz all-purpose flour"},{"content":"4 tbsp cocoa powder"},{"content":"1 tbsp instant espresso powder"},{"content":"1 large egg"},{"content":"½ tsp baking powder"},{"content":"½ tsp baking soda"},{"content":"1 pinch salt"},{"content":"35 oz water"},{"isHeader":true,"content":"Chocolate Ganache"},{"content":"4 oz bittersweet chocolate, in pieces"},{"content":"4 oz heavy whipping cream"},{"isHeader":true,"content":"White Chocolate Heart"},{"content":"2 oz white chocolate, in pieces"}],"nutrition":{"protein":"11 g","fat":"56 g","uom":"per 1 portion","carbohydrates":"67 g","calories":"3318 kJ \/ 793 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Chocolate Cake"},{"content":"Grease a Thermomix heart-shaped silicone mold (see Tip) and Varoma lid with butter and set aside."},{"content":"Place butter, sugar and evaporated milk into mixing bowl and heat <b>3 min\/195°F\/speed 2<b>."},{"content":"Add flour, cocoa powder, espresso powder, egg, baking powder, baking soda, and salt and mix <b>10 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula and mix a further <b>10 sec\/speed 4<b>. Transfer batter to prepared heart mold and set aside. Clean mixing bowl."},{"content":"Place water into mixing bowl. Place Varoma into position. Place mold with batter onto Varoma tray, secure Varoma lid and steam <b>50 min\/Varoma\/speed 2<b>. Remove Varoma lid and set Varoma aside to cool completely. Invert cake onto a serving plate. Discard water and dry mixing bowl."},{"isHeader":true,"content":"Chocolate Ganache"},{"content":"Place chocolate into mixing bowl and chop <b>10 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add whipping cream and heat <b>1 min\/160°F\/speed 3<b>."},{"content":"Pour Chocolate Ganache over cooled cake and smooth with an icing spatula. Clean mixing bowl."},{"isHeader":true,"content":"White Chocolate Heart"},{"content":"Place white chocolate into mixing bowl and chop <b>8 sec\/speed 9<b>, then heat <b>1 min\/130°F\/speed 2<b>."},{"content":"Spread white chocolate into the heart shape of the mold with an icing spatula. Refrigerate mold with white chocolate until set. Carefully remove white chocolate heart layer and position on glazed cake. Serve at room temperature."}],"hintsAndTricks":["If Thermomix heart-shaped cake mold is unavailable, ensure the mold you're using fits into Varoma dish and Varoma lid closes properly.","Decorate cake as desired without using the white chocolate heart component.","To bake in the oven: transfer batter into prepared mold and place in a round baking dish (approx. 10 in.). Carefully fill baking dish with 2 cups water. Cover with foil. Poke a few holes in the foil to vent and bake for 25 minutes (325°F) or until center rises and is set."],"basicInfo":["easy","15m","1h 10m","4 portions"]}