{"badges":["TM31","TM5","TM6"],"usefulItems":"bowl, paper towel, serving bowls, frying pan, stove top","id":"r314217","imageLink":"https:\/\/1.bp.blogspot.com\/-FRut8igTr4k\/XZVRZR_s2sI\/AAAAAAAAdN4\/REezlp5kYTQlXdGJk7YxzyteHpCmX0_6gCLcBGAsYHQ\/s1600\/0_ni9Y4xO9qT_lQK9b.png","title":"Lentil purée (Moujadarra)","publishedAt":"2018-08-09T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"400 g brown onion (200 g cut into thin slices; 200 g cut into pieces)"},{"content":"60 g sunflower oil, plus extra for frying"},{"content":"300 g dried lentils (brown)"},{"content":"1600 g water"},{"content":"2 tsp salt, plus extra to taste"},{"content":"1 pinch ground white pepper, plus extra to taste"},{"content":"50 g basmati rice, rinsed"}],"nutrition":{"protein":"13.7 g","fat":"14.4 g","uom":"per 1 portion","carbohydrates":"33.9 g","calories":"1417.1 kJ \/ 337.4 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place a bowl onto mixing bowl lid and weigh 200 g of the onion (cut into thin slices) into it, then set aside."},{"content":"Place remaining 200 g onion (cut into pieces) and 40 g of the oil into mixing bowl and chop <b>10 sec\/speed 5<b>."},{"content":"Scrape down sides of mixing bowl with spatula, then sauté <b>5 min\/100°C\/speed 1<b>. Transfer into a separate bowl and set aside."},{"content":"Place lentils, 1500 g water, salt and pepper into mixing bowl and cook <b>40 min\/Varoma\/speed 1.5<b>, placing simmering basket instead of measuring cup onto mixing bowl lid."},{"content":" <b>Insert butterfly whisk<b>. Add rice, remaining 100 g water, remaining 20 g oil and reserved sautéed onions and cook <b>20 min\/Varoma\/speed 1.5<b>, placing simmering basket instead of measuring cup onto mixing bowl lid."},{"content":"Season to taste and cook <b>10 min\/Varoma\/speed 1.5<b>, placing simmering basket instead of measuring cup onto mixing bowl lid. Meanwhile, place a frying pan over high heat and add a little oil. Add reserved sliced onions and fry until golden brown. Transfer onto paper towel to drain."},{"content":"Divide lentil purée between serving bowls and garnish with fried onions to serve."}],"hintsAndTricks":["Moujadarra is a Lebanese comfort food - serve it with flatbread, pickled vegetables or even salad."],"basicInfo":["easy","10m","1h 20m","6 portions"]}