{"badges":["TM31","TM5","TM6"],"usefulItems":"large bowl, plastic wrap or kitchen towel, baking paper, wire rack, baking trays (40 x 35 cm), rolling pin, pastry brush, kitchen towel, bowl, small bowl, fork, oven","id":"r314222","imageLink":"https:\/\/3.bp.blogspot.com\/-3BPtb_8u2NQ\/XZVPTVmmJCI\/AAAAAAAAc3M\/M1zghVxw7GcuYdH3DXaNTYfId_a7jUrUACLcBGAsYHQ\/s1600\/0_4WqZ4eGLTpRnb7Af.png","title":"Iraqi cheese pies (Cheese chureck)","publishedAt":"2018-08-09T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Dough"},{"content":"50 g water"},{"content":"170 g salted butter, cut into pieces, plus extra for greasing"},{"content":"180 g milk"},{"content":"2 tsp white sugar"},{"content":"3 tsp dried instant yeast"},{"content":"2 eggs"},{"content":"650 g plain flour, plus extra for dusting"},{"content":"1 tsp salt"},{"isHeader":true,"content":"Cheese filling"},{"content":"200 g feta cheese, cut into cubes (2 cm)"},{"content":"180 g haloumi, cut into cubes (2 cm)"},{"content":"250 g mozzarella, cut into cubes (2 cm)"},{"isHeader":true,"content":"Assembly"},{"content":"1 tbsp water, plus extra for sealing"},{"content":"1 egg"},{"content":"1 tbsp sesame seeds"}],"nutrition":{"protein":"19.9 g","fat":"26.2 g","uom":"per 1 portion","carbohydrates":"42.8 g","calories":"2062.9 kJ \/ 491.2 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Dough"},{"content":"Place water, butter, milk, sugar and yeast into mixing bowl and mix <b>2 min\/37°C\/speed 3<b>."},{"content":"Mix <b>30 sec\/speed 3<b>, adding 2 eggs, one at a time, through hole in mixing bowl lid."},{"content":"Add flour and salt and knead <b>3 min\/<b>. Lightly grease a large bowl with butter and set aside. Place dough into prepared bowl and shape into a ball. Cover bowl with plastic wrap or a damp kitchen towel and set aside to prove in a warm place until doubled in size (approx. 1 hour)."},{"content":"Preheat oven to 180°C. Line 2 baking trays (approx. 40 x 35 cm) with baking paper and set aside."},{"content":"Transfer reserved dough onto a lightly floured work surface and knead briefly with your hands until combined. Divide into 3 equal portions (approx. 360 g each). Divide each portion into 4 equal portions (approx. 90 g each), then set aside, keeping them covered with a damp kitchen towel while making filling. Clean and dry mixing bowl."},{"isHeader":true,"content":"Cheese filling"},{"content":"Place feta, haloumi and mozzarella into mixing bowl and chop <b>10 sec\/speed 5<b>, stirring with aid of spatula. Transfer into a bowl and set aside."},{"isHeader":true,"content":"Assembly"},{"content":"Using a rolling pin, roll out each piece of dough into a rectangle (approx. 30 x 10 cm). Place approx. 3 tablespoons of the cheese filling along the bottom of the long side of the dough. Brush opposite side of the rectangle with a little water and roll up dough into a log, enclosing filling. Press lightly at the edges to seal. Pull edges of dough log around, to create a ring shape, then transfer onto prepared baking trays, seam side down."},{"content":"Crack egg into a small bowl, add 1 tablespoon water and beat lightly with a fork. Brush tops of cheese pies with egg mixture, sprinkle with sesame seeds and bake for 20 minutes (180°C) or until golden. Transfer to a wire rack to cool slightly before serving."}],"basicInfo":["medium","30m","1h 40m","12 portions"]}