{"badges":["TM5","TM6"],"usefulItems":"baking sheet and parchment paper, baking dish (9 in. x 13 in.), pasta machine, rolling pin, oven","id":"r336886","imageLink":"https:\/\/1.bp.blogspot.com\/-b3X2jprrCdg\/XZMyamVLYcI\/AAAAAAAAakk\/uKbn5nzVln01_GbMJiyw0vy-PaYXvkNJgCLcBGAsYHQ\/s1600\/0_CIrlOuuHoYE-XGaB.png","title":"Gluten-Free Mushroom Lasagna","publishedAt":"2018-06-22T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Lasagna"},{"content":"2 - 3 tbsp gluten-free flour, to dust"},{"content":"1 homemade pasta dough, Gluten-Free Pasta, from Fresh Pasta Homemade"},{"content":"2 oz Parmesan cheese, cubed"},{"isHeader":true,"content":"Mushrooms"},{"content":"2 garlic cloves"},{"content":"1 oz extra virgin olive oil"},{"content":"24 oz fresh cremini mushrooms, sliced"},{"content":"6 oz fresh shiitake mushrooms, sliced"},{"content":"2 tbsp dried parsley"},{"content":"½ tsp salt"},{"content":"1 pinch ground black pepper"},{"isHeader":true,"content":"Béchamel Sauce"},{"content":"32 oz whole milk"},{"content":"2 oz cornstarch"},{"content":"1 pinch ground nutmeg"},{"content":"½ tsp salt"},{"content":"1 pinch ground black pepper"},{"content":"2 oz unsalted butter, cubed"},{"isHeader":true,"content":"ASSEMBLY"},{"content":"extra virgin olive oil, to grease"},{"content":"16 oz raclette cheese, deli-sliced or grated"}],"nutrition":{"protein":"34 g","fat":"44 g","uom":"per 1 portion","carbohydrates":"44 g","calories":"2937 kJ \/ 702 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Lasagna"},{"content":"On a well-floured surface divide Gluten-Free dough into eight parts. Roll each piece of dough with a rolling pin into an elongated shape and feed through the pasta machine while guiding the dough. Run dough through pasta machine with rollers set on most open setting; fold dough into thirds and roll it back through the pasta maker. If dough sticks, coat with a little more flour. Fold and roll the dough three more times on this setting. Adjust rollers to the next level of thinness and guide dough back through the machine with the back of your hand, repeating the process until dough is approximately 1\/16 inch thick. Keep remaining dough covered to prevent from drying out. Repeat with remaining dough. Immediately cut sheets into lasagna noodles (4 in. x 13 in.). Line a baking sheet with parchment and transfer pasta sheets onto baking sheet, adding a sheet of parchment between layers of dough. Continue with remaining dough."},{"content":"Place Parmesan cheese into mixing bowl and grate <b>10 sec\/speed 10<b>. Transfer to a bowl and set aside."},{"isHeader":true,"content":"Mushrooms"},{"content":"Place garlic and olive oil into mixing bowl and chop <b>5 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula and cook <b>3 min\/250°F\/speed 1<b>."},{"content":"Add cremini and shiitake mushrooms and parsley and cook <b>10 min\/250°F\/\/speed 1<b>. Transfer to a bowl, toss with salt and pepper and set aside."},{"isHeader":true,"content":"Béchamel Sauce"},{"content":"Place milk, cornstarch, nutmeg, salt and pepper into mixing bowl and cook <b>2 min\/195°F\/speed 4<b>, then cook <b>8 min\/195°F\/speed 1<b>."},{"content":"Add butter and reserved grated Parmesan cheese and mix <b>30 sec\/speed 4<b>. Transfer to a bowl and set aside. Sauce will thicken while baking."},{"isHeader":true,"content":"ASSEMBLY"},{"content":"Preheat oven to 400°F. Grease a baking dish (9 in. x 13 in.) with olive oil and set aside."},{"content":"Spread a thin layer of sauce on bottom of the prepared baking dish, cover with a layer of noodles, a third of the Béchamel Sauce, a third of the mushrooms and top with a third of the sliced cheese. Repeat this step in the same order with remaining ingredients."},{"content":"Bake 30 minutes (400°F) or until golden brown and bubbling. Allow to cool for 10-15 minutes and serve."}],"hintsAndTricks":["Save remaining two layers of dough for another use.","To grate Gruyère cheese: work in batches of 7 oz or less, place 6 oz Gruyère cheese, cut into pieces into mixing bowl and grate <b>10-12 sec\/speed 6<b>. Transfer to a bowl. Repeat with remaining cheese."],"basicInfo":["medium","1h","1h 45m","6 portions"]}