{"badges":["TM5","TM6"],"usefulItems":"baking tray (30 x 40 cm), baking paper, plate, shallow bowl, large plate, paper towel, large frying pan, oven, stove top","id":"r341232","imageLink":"https:\/\/3.bp.blogspot.com\/-w1CYpwokDXE\/XZVQS9u9p6I\/AAAAAAAAc_c\/uF-58hNKXs8Iuxs5RIQ3EeyzibELZqeMACLcBGAsYHQ\/s1600\/0_KFXBQRhG43Eg2xai.png","title":"Celeriac parmigiana","publishedAt":"2016-08-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Coating"},{"content":"20 g flaxmeal (see Tips)"},{"content":"100 g filtered water"},{"content":"4 slices day-old bread of choice (approx. 140 g), torn into pieces"},{"content":"1 garlic clove"},{"content":"2 tsp dried thyme"},{"content":"1 tsp dried sage"},{"content":"½ tsp salt"},{"content":"½ tsp ground black pepper"},{"isHeader":true,"content":"Celeriac cutlets"},{"content":"10 g extra virgin olive oil, plus extra for shallow frying"},{"content":"1 brown onion (approx. 180 g), cut into quarters"},{"content":"1 garlic clove"},{"content":"2 sprigs fresh thyme, leaves only"},{"content":"2 sprigs fresh sage, leaves only"},{"content":"800 g canned chopped tomatoes"},{"content":"2 celeriacs, peeled and cut into 4 slices each (approx. 1.5 cm thickness)"},{"content":"160 g vegan cheese (see Tips)"}],"nutrition":{"protein":"11.3 g","fat":"16.2 g","uom":"per 1 portion","carbohydrates":"32 g","calories":"1496.4 kJ \/ 356.3 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Coating"},{"content":"Place a wide shallow bowl onto mixing bowl lid and weigh flaxmeal and water into it. Stir to combine, then set aside."},{"content":"Preheat oven to 180°C. Line a baking tray (30 x 40 cm) with baking paper and set aside."},{"content":"Place bread, garlic, thyme, sage, salt and pepper into mixing bowl and chop <b>10 sec\/speed 6.5<b> until forms a fine breadcrumb. Transfer onto a plate and set aside. Do not clean mixing bowl."},{"isHeader":true,"content":"Celeriac cutlets"},{"content":"Place oil, onion, garlic, thyme and sage into mixing bowl and chop <b>5 sec\/speed 5<b>."},{"content":"Add tomatoes into mixing bowl. Place Varoma into position and place 4 celeriac slices into Varoma dish and 4 slices onto Varoma tray. Secure Varoma lid and steam <b>20-25 min\/Varoma\/speed 2<b>, until celeriac is soft but still retains its shape."},{"content":"Remove Varoma and set aside. Continue to cook sauce <b>5 min\/100°C\/speed 2<b>, placing simmering basket instead of measuring cup onto mixing bowl lid."},{"content":"Using paper towel, pat dry each slice of celeriac. Dip each slice in flaxmeal mixture, then into breadcrumb mixture, gently patting each side to coat. Place onto a large plate."},{"content":"Place a large frying pan over high heat and add oil (1-2 cm deep). Working in batches, place coated celeriac pieces into pan and fry for 1-2 minutes on each side, until golden. Transfer onto prepared baking tray and spread each piece with 2 heaped tablespoons of the tomato sauce. Top with cheese of choice, then bake for 5-8 minutes (180°C), until golden. Serve with sides of choice."}],"hintsAndTricks":["You can purchase flaxmeal at most major supermarkets, but to make your own, simply place 200 g flaxseeds into mixing bowl and mill <b>30 sec\/speed 10<b>. Transfer into a sealable container and store in the fridge or freezer for up to 3 months.","If you have leftover flaxmeal, you can use it as an egg substitute in baking. Combine 1 tablespoon flaxmeal with 30 g boiling water and set aside until it becomes jelly-like (equates to approx. 1 egg).","You can use any vegan cheese you like in this recipe. We used our Stretchy melty cheese (please refer to the recipe on this recipe chip)."],"basicInfo":["easy","30m","1h 10m","4 portions"]}