{"badges":["TM5","TM6"],"usefulItems":"jug, large serving bowl","id":"r342567","imageLink":"https:\/\/2.bp.blogspot.com\/-7tVWqpHclOo\/XZQGzxb6G6I\/AAAAAAAAcCE\/C_pJpHcW4n4Z8FmzVCEX87eZORJ0mfC4ACLcBGAsYHQ\/s1600\/0_YN9TlxmFACubUceZ.png","title":"Circassian Chicken","publishedAt":"2018-06-14T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"1000 g water"},{"content":"1 onion, quartered"},{"content":"1 celery stalk"},{"content":"2 sprigs fresh thyme"},{"content":"2 bay leaves"},{"content":"1 lemon, finely grated zest and juice, to taste"},{"content":"8 black peppercorns"},{"content":"8 cloves"},{"content":"1 pinch chilli flakes"},{"content":"1 uncooked, whole chicken (1.2-1.4 kg)"},{"content":"60 g walnut oil"},{"content":"4 tsp sweet paprika, plus extra for sprinkling"},{"content":"2 slices sourdough bread (thick) (approx. 100 g)"},{"content":"40 g unsalted butter, diced"},{"content":"50 g red onion, quartered"},{"content":"3 garlic cloves, crushed"},{"content":"½ tsp hot paprika"},{"content":"175 g halved walnuts"},{"content":"fine sea salt, to taste"},{"content":"ground black pepper, to taste"},{"content":"150 g natural yoghurt"},{"content":"10 g fresh tarragon leaves, roughly chopped, plus extra for garnishing"}],"nutrition":{"protein":"32 g","fat":"36.5 g","uom":"per 1 portion","carbohydrates":"10.5 g","calories":"2095 kJ \/ 504 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place water, onion, celery, thyme, bay leaves, lemon zest, peppercorns, cloves and chilli flakes in mixing bowl. Place chicken in Varoma and cover (ensuring lid is completely closed). Place into position then steam <b>45-60 min\/Varoma\/\/speed 1<b> until chicken is cooked."},{"content":"Remove Varoma and set aside to cool uncovered. Strain steaming stock using simmering basket into a jug and set aside to cool. Discard vegetables and rinse mixing bowl."},{"content":"Place walnut oil and 2 tsp sweet paprika in mixing bowl then heat <b>5 min\/95°C\/speed <b>. Transfer to a bowl and leave to infuse. Rinse mixing bowl."},{"content":"Place bread in a bowl and pour over some of the chicken stock. Set aside to soak."},{"content":"Place butter, onion and garlic in mixing bowl then chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula then sauté <b>10 min\/120°C\/speed <b>."},{"content":"Add 2 tsp sweet paprika and hot paprika then sauté <b>1 min\/100°C\/speed <b> "},{"content":"Add walnuts and chop <b>5 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula then chop again <b>5 sec\/speed 7<b>."},{"content":"Add soaked bread then, without measuring cup, set <b>speed 3<b> and slowly pour in reserved stock to create a sauce with thickness of mayonnaise."},{"content":"Add lemon juice and seasoning to taste then transfer to a large serving bowl."},{"content":"Strip steamed chicken meat from carcass and place in mixing bowl. Shred <b>5 sec\/\/speed 4<b>."},{"content":"Add yoghurt and chopped tarragon.  Transfer to serving bowl and mix well."},{"content":"Serve drizzled with paprika walnut oil, paprika and remaining chopped tarragon."}],"hintsAndTricks":["A dish of shredded chicken served in a rich sauce made with crushed walnuts. It is a classic Circassian (Northwest Caucasian) dish, adopted by Imperial Ottoman cuisine. Traditionally served as a main course, it is also popular as an appetizer or as part of a meze."],"basicInfo":["medium","30m","2h","8 portions"]}