{"badges":["TM5","TM6"],"usefulItems":"thermal serving bowl or other large bowl","id":"r342428","imageLink":"https:\/\/2.bp.blogspot.com\/-I85i6KM-tdg\/XZVRDaAktTI\/AAAAAAAAdJM\/iV025GGtimoEtMU_wEI6u_bz3G2ELrqqgCLcBGAsYHQ\/s1600\/0_dpm2FqSmVzl_ucKU.png","title":"Kimchi non-fried rice","publishedAt":"2016-08-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"3 garlic cloves"},{"content":"3 cm piece fresh ginger, peeled"},{"content":"1 fresh long red chilli, trimmed, deseeded if preferred and cut into halves"},{"content":"2 tsp sesame oil"},{"content":"1 tbsp tamari, gluten free (see Tips)"},{"content":"300 g brown rice"},{"content":"1000 g filtered water"},{"content":"1 tsp salt"},{"content":"2 carrots, cut into matchsticks"},{"content":"200 g frozen green peas"},{"content":"170 g kimchi (see Tips)"},{"content":"1 red capsicum, deseeded and cut into thin slices"},{"content":"nori sheet, cut into strips for garnishing"}],"nutrition":{"protein":"12.4 g","fat":"4.9 g","uom":"per 1 portion","carbohydrates":"75.1 g","calories":"1743.5 kJ \/ 415.1 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place garlic, ginger, chilli, oil and tamari into mixing bowl and chop <b>5 sec\/speed 5<b>."},{"content":"Scrape down sides of mixing bowl with spatula, then sauté <b>3 min\/120°C\/speed 2<b>. Transfer into a thermal serving bowl or other large bowl and cover to keep warm. Do not clean mixing bowl."},{"content":"Place simmering basket onto mixing bowl lid and weigh rice into it. Rinse rice until water runs clear."},{"content":"Place water and salt into mixing bowl. Insert simmering basket with rice and cook <b>30 min\/100°C\/speed 4<b>."},{"content":"Place Varoma dish into position and place carrots into it. Insert Varoma tray and weigh peas and kimchi onto it. Add capsicum onto Varoma tray, secure Varoma lid and cook <b>10 min\/Varoma\/speed 2<b>. Remove Varoma and remove simmering basket with aid of spatula. Transfer rice, vegetables and kimchi into the thermal serving bowl with ginger mixture and stir to combine. Serve warm, garnished with nori."}],"hintsAndTricks":["To make your own kimchi, refer to the recipe on this recipe chip.","Be sure to check the label of your tamari, as not all brands are gluten free."],"basicInfo":["easy","15m","1h","4 portions"]}