{"badges":["TM5","TM6"],"usefulItems":"airtight jar, cling film, aluminium foil, refrigerator","id":"r348164","imageLink":"https:\/\/4.bp.blogspot.com\/-wC60ypTS1Ik\/XZQwtgNA_PI\/AAAAAAAAcoE\/Vohzgo_I-V0HeeKbidea8JzLNkMUMt2AQCLcBGAsYHQ\/s1600\/0_dv0w1SZeUhuHY4kk.png","title":"Prawn Stir-Fry with Rice and Vegetables","publishedAt":"2018-06-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Five Spice Powder"},{"content":"2 tsp Sichuan peppercorns"},{"content":"2 tsp dried fennel seeds"},{"content":"3 star anise"},{"content":"2 cinnamon sticks"},{"content":"6 cloves"},{"isHeader":true,"content":"Prawn Stir-fry"},{"content":"5 g fresh root ginger, peeled, cut in round slices (2 mm)"},{"content":"1 garlic clove"},{"content":"½ - 1 long red chilli, halved, deseeded, to taste"},{"content":"½ lime, finely grated zest and juice"},{"content":"1 - 2 tsp palm sugar, to taste"},{"content":"4 tsp sesame oil"},{"content":"1 tsp soy sauce"},{"content":"300 g raw prawns, peeled, deveined (see tip)"},{"content":"120 g basmati rice"},{"content":"800 g water"},{"content":"¼ red pepper, cut in strips (1 cm x 3 cm)"},{"content":"3 tenderstem broccoli, cut in pieces (2 cm)"},{"content":"4 mangetout, cut in pieces (2 cm)"},{"content":"50 g fresh green beans, trimmed, cut in pieces (2 cm)"},{"content":"1 Tbsp honey"},{"content":"1 Tbsp rice vinegar"},{"content":"1 spring onion, green part only, finely sliced, for serving"},{"content":"fresh coriander leaves, for serving"}],"nutrition":{"protein":"39 g  \/ 39 g","fat":"11 g  \/ 11 g","uom":"per 1 portion","carbohydrates":"66 g  \/ 66 g","calories":"2338 kJ \/ 557 kcal \/ 2338 kJ \/ 557 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Five Spice Powder"},{"content":"Place Sichuan peppercorns, fennel seeds, star anise, cinnamon and cloves in mixing bowl then dry roast <b>5 min\/120°C\/speed 1<b>."},{"content":"Leave to cool then grind <b>30 sec\/speed 10<b>. Transfer to an airtight jar until needed."},{"isHeader":true,"content":"Prawn Stir-fry"},{"content":"Place ginger, garlic, chilli, lime zest and sugar in mixing bowl then chop <b>4 sec\/speed 8<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add lime juice, 1 tsp oil, soy sauce, 2 tsp reserved five spice powder and prawns then mix <b>5 sec\/\/speed 1<b>. Transfer to a bowl, cover with cling film and leave to marinate in fridge. Clean mixing bowl."},{"content":"Place simmering basket on mixing bowl lid and weigh in rice. Rinse rice under water until it runs clear. Place water in mixing bowl, insert simmering basket and cook <b>8 min\/100°C\/speed 4<b>."},{"content":"Place red pepper, broccoli and mangetout in Varoma dish. Place Varoma dish into position, weigh in green beans, cover Varoma and steam <b>14 min\/Varoma\/speed 1<b>. Set Varoma aside and remove simmering basket with aid of spatula. Transfer rice and vegetables to a bowl and cover to keep warm. Discard cooking water."},{"content":"Place remaining 3 tsp oil in mixing bowl and heat <b>1 min\/Varoma\/speed 2<b>."},{"content":"Add reserved marinated prawns, honey and vinegar then cook <b>2 min 30 sec\/Varoma\/\/speed <b>, or until prawns are cooked. Strain cooking liquid through simmering basket into a bowl and set aside."},{"content":"Place cooked prawns, reserved rice and vegetables in mixing bowl then mix <b>3 sec\/\/speed 2<b>. Garnish with spring onion and coriander. Drizzle with a little reserved cooking liquid and serve hot."}],"hintsAndTricks":["Recipe for one: reduce prawns to <b>150 g<b> and rice to <b>60 g.<b> In <b>step 6,<b> only use <b>2 tsp<b> sesame oil and proceed as per recipe.","Prawns are high in protein, <b>omega-3<b> fatty acids and selenium whilst being low in saturated fats and calories.","If there is a black line down the back of the prawn, it means that the vein is full. It’s not harmful to eat, but the prawn looks better without it, and it can be gritty to eat. To devein prawns, lift the vein out using the tip of a small sharp knife or a cocktail stick.","Store leftover five spice powder in an airtight container in a cool, dark place.","Substitute soy sauce with tamari to make this recipe gluten free."],"basicInfo":["easy","15m","45m","2 portions"]}