{"badges":["TM5","TM6"],"usefulItems":"parchment paper, pitcher, cling wrap, large salad bowl, refrigerator","id":"r356292","imageLink":"https:\/\/2.bp.blogspot.com\/-RBW6H1J3DE8\/XZMt7hWGxvI\/AAAAAAAAZ_I\/jPfQ9pls2mYp01olfgOlLP_3NAvr_OT_wCLcBGAsYHQ\/s1600\/0_47t3g1CLDdQ9-gy6.png","title":"Chinese Chicken Salad","publishedAt":"2018-05-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"16 oz chicken tenderloins"},{"content":"2 tsp sesame oil"},{"content":"2 oz soy sauce"},{"content":"2 oz sesame oil"},{"content":"4 oz vegetable oil"},{"content":"1 garlic clove"},{"content":"1 inch fresh ginger, peeled"},{"content":"3 oz rice wine vinegar"},{"content":"1 tsp Thai chili sauce"},{"content":"2 oz honey"},{"content":"½ tsp salt"},{"content":"1 pinch ground black pepper"},{"content":"35 oz water"},{"content":"28 oz cabbage coleslaw blend"},{"content":"5 green onions, chopped"},{"content":"1 red bell pepper, julienned (approx. 4 oz)"},{"content":"2 oz sliced almonds"},{"content":"2 fresh mandarin oranges (e.g. Cuties), broken into segments"},{"content":"2 oz chow mein noodles"},{"content":"black sesame seeds, to garnish"}],"nutrition":{"protein":"38 g","fat":"58 g","uom":"per 1 portion","carbohydrates":"47 g","calories":"3535 kJ \/ 845 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place a bowl onto mixing bowl lid and weigh in chicken, 2 tsp sesame oil and soy sauce and stir to combine. Cover with cling wrap and refrigerate for one hour."},{"content":"Place a pitcher onto mixing bowl lid and weigh in 2 oz sesame oil and vegetable oil and set aside."},{"content":"Place garlic and ginger into mixing bowl and chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add rice wine vinegar and Thai chili sauce and cook <b>5 min\/212°F\/speed 2<b>."},{"content":"Add honey, salt and pepper. Mix <b>2 min\/speed 4<b> while slowly pouring reserved oil onto mixing bowl lid, letting it drizzle around measuring cup in a thin stream onto rotating blades to create an emulsion. Transfer to a bowl and refrigerate."},{"content":"Place water into mixing bowl. Transfer chicken and marinade onto a piece of parchment (approx. 25 in.). Fold paper loosely into a parcel. Place parcel into Varoma dish, seam side down, ensuring some holes remain unobstructed to allow even distribution of steam. Place Varoma into position, secure Varoma lid and steam <b>20 min\/Varoma\/speed 2<b>. Drain chicken and discard water. Place drained chicken into mixing bowl and shred <b>1 sec\/speed 4<b>. Transfer to a bowl and refrigerate to chill."},{"content":"Place a large salad bowl onto mixing bowl lid and weigh in cabbage blend. Add reserved chicken, green onions, red pepper, reserved salad dressing, almonds, mandarin oranges and chow mein noodles. Toss well to combine, garnish with sesame seeds and serve."}],"hintsAndTricks":["To make your own cabbage blend: place 8 oz napa cabbage, in pieces (2 in.) into mixing bowl and shred <b>3 sec\/speed 4<b>. Transfer to a bowl and repeat with another 8 oz napa cabbage, in pieces (2 in.). Transfer to bowl with reserved shredded cabbage and set aside. Place 8 oz purple cabbage, in pieces (2 in.), 5 green onions, in pieces (<b>1 in.)<b> and 3 oz carrots, in pieces (1 in.) into mixing bowl and shred <b>3 sec\/speed 5<b>. Transfer to bowl with napa cabbage and continue with recipe."],"basicInfo":["easy","20m","1h 30m","4 portions"]}