{"badges":["TM5","TM6"],"usefulItems":"cling film, rolling pin, baking paper, piping bag and Ø 10 mm nozzle, baking trays, refrigerator, oven","id":"r359477","imageLink":"https:\/\/3.bp.blogspot.com\/-E97CjlTVrR0\/XZWqDQMkaqI\/AAAAAAAAfSc\/cSz-Fv2QSVwct6B5DKjky7kKY1e3d5icgCLcBGAsYHQ\/s1600\/0_B4gruAas920pg4Wn.png","title":"Mini Strawberry and Elderflower Mille Feuille","publishedAt":"2018-08-13T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Puff Pastry"},{"content":"200 g unsalted butter, cold, diced"},{"content":"200 g plain flour, plus extra for dusting"},{"content":"90 g water, cold"},{"content":"½ tsp caster sugar"},{"isHeader":true,"content":"Assembly"},{"content":"300 g double cream"},{"content":"80 g icing sugar, plus extra for dusting"},{"content":"60 g elderflower cordial"},{"content":"300 g fresh strawberries, hulled, thinly sliced (5 mm)"}],"nutrition":{"protein":"5 g","fat":"55 g","uom":"per 1 portion","carbohydrates":"44 g","calories":"2892 kJ \/ 697 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Puff Pastry"},{"content":"Place butter, flour, water and sugar in mixing bowl then mix <b>20 sec\/speed 6<b>. Tip out dough, shape into a ball and flatten into a rough square. Wrap in cling film and chill in fridge for 20 minutes."},{"content":"On a lightly-floured surface, roll out chilled dough to a long rectangle 3 times as long as it is wide (approx. 60 cm x 20 cm). Fold bottom third up to cover middle third and top third down over this. Seal edges then give dough a quarter turn so that the fold is on the left. Repeat rolling and folding process twice. Return to fridge and leave to rest for 20 minutes. Meanwhile, line 2 baking trays (30 cm x 40 cm) with baking paper then cut a 5 cm x 10 cm rectangular template out of baking paper and set aside."},{"content":"Divide chilled dough into 6 equal portions. On a lightly-floured surface, roll each dough piece into a 3 mm thick rectangle (approx. 35 cm x 10 cm). Use prepared template to cut 3 rectangles from each dough piece then transfer to prepared trays. Place baking trays in fridge for a further 30 minutes. Meanwhile, preheat oven to 180°C."},{"content":"Place a sheet of baking paper and a baking tray on top of each baking tray to act as a weight. Bake for 20-25 minutes (180°C) until lightly golden. Set aside to cool completely (approx. 1 hour)."},{"isHeader":true,"content":"Assembly"},{"content":" <b>Insert butterfly whisk<b>. Place cream, sugar and elderflower cordial in mixing bowl then, without measuring cup, whip <b>without setting a time\/speed 3<b> until stiff peaks form, watching carefully to avoid over-whipping. <b>Remove butterfly whisk<b>. Transfer cream to a large piping bag fitted with a Ø 10 mm nozzle."},{"content":"Divide pastry rectangles into 6 portions (3 rectangles per portion). Pipe half the cream over 6 pastry layers, taking care to keep cream within edges of pastry. Top with half the sliced strawberries."},{"content":"Place second pastry layer on top. Pipe remaining cream over this layer and top with remaining strawberries. Place final piece of pastry on top and press down gently."},{"content":"Dust each generously with icing sugar then serve immediately (see tip)."}],"hintsAndTricks":["If preferred, make up to <b>step 4<b> and assemble mille feuille just before serving."],"basicInfo":["medium","1h","3h 30m","6 portions"]}