{"badges":["TM5","TM6"],"usefulItems":"baking paper, airtight jars or containers, large baking trays, large bowl, oven","id":"r363592","imageLink":"https:\/\/2.bp.blogspot.com\/-b0TwztKFP6w\/XZafb541qQI\/AAAAAAAAguU\/ebyyzZiUxmouqemSLgemt4pWmh5-l0wQQCLcBGAsYHQ\/s1600\/0_nLLmdajq2uvZmz-W.png","title":"Crunchy Granola","publishedAt":"2019-03-09T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"600 g rolled oats"},{"content":"60 g desiccated coconut"},{"content":"100 g wheat germ"},{"content":"60 g sunflower seeds"},{"content":"70 g sesame seeds"},{"content":"30 g pumpkin seeds"},{"content":"200 g whole nuts, mixed (e.g. hazelnuts, pecans, walnuts, cashews, pistachios, almonds, peanuts)"},{"content":"70 g linseeds"},{"content":"250 g raisins"},{"content":"180 g spelt flakes"},{"content":"200 g dried apricots, pitted"},{"content":"100 g honey"},{"content":"210 g coconut oil"},{"content":"60 g milk"},{"content":"100 g barley malt (see tip)"},{"content":"1 tsp fine sea salt"}],"nutrition":{"protein":"4.1 g","fat":"9.5 g","uom":"per 1 portion","carbohydrates":"16 g","calories":"697 kJ \/ 167 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 160°C and line 2 large baking trays with baking paper."},{"content":"Place a large bowl on mixing bowl lid and weigh in oats, coconut, wheat germ, sunflower seeds, sesame seeds, pumpkin seeds, mixed nuts, linseeds, raisins and spelt flakes then set aside."},{"content":"Place apricots in mixing bowl and chop <b>4 sec\/speed 6<b>. Transfer to bowl with dry ingredients."},{"content":"Place honey, oil, milk, barley malt and salt in mixing bowl then heat <b>5 min\/37°C\/speed 3.5<b>. Pour over dry ingredients in large bowl and stir well with spatula until completely covered."},{"content":"Divide granola into four batches by weighing back into mixing bowl, (approx. 600 g per batch). Spread out two batches of granola on prepared trays. Bake both trays at the same time for 20-21 minutes (160°C) in total, setting the oven timer for 7 minute intervals and stirring carefully and gently each time. Set aside and leave to cool completely. Repeat process with remaining two batches. Once cool, transfer to airtight jars or containers and store until needed."}],"hintsAndTricks":["Making homemade cereals and granolas means you can be confident of exactly what ingredients have gone into your breakfast. For more ideas to kick-start your day, search for breakfast bowls on Cookidoo.","Halve ingredients to make a smaller quantity.","Barley malt syrup can be found in health food stores. It may be substituted with molasses or honey.","Perfect served on its own or with milk, yogurt or fresh fruit.","Sprinkle over vanilla ice cream for a quick dessert.","Chop mixed nuts into bite-sized pieces before starting recipe, if preferred.","This recipe is very flexible, so feel free to adapt it depending on the ingredients you have to hand."],"basicInfo":["medium","1h","2h","50 portions"]}