{"badges":["TM5","TM6"],"usefulItems":"baking paper, bowl, wooden skewer, wire rack, loaf tin (approx. 28 cm long), oven","id":"r384521","imageLink":"https:\/\/4.bp.blogspot.com\/-50q4-wZqHSI\/XZaoBv65a5I\/AAAAAAAAhGQ\/R-hRhOaz7Jg8pBwSv-wcs9SEthUw8btrQCLcBGAsYHQ\/s1600\/0_c2SA-NiLdXwK8y-b.png","title":"Zucchini pistachio loaf","publishedAt":"2019-05-06T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"60 g extra virgin olive oil, plus extra for greasing"},{"content":"30 g Parmesan cheese, cut into pieces"},{"content":"2 tbsp shelled unsalted pistachio nuts, chopped, plus extra for sprinkling"},{"content":"220 g almonds (activated, roasted or raw - see Tips)"},{"content":"350 g zucchini, trimmed and cut into pieces"},{"content":"4 eggs"},{"content":"70 g milk of choice (see Tips)"},{"content":"30 g chia seeds"},{"content":"150 g wholemeal spelt flour"},{"content":"2 tsp baking powder"},{"content":"½ tsp sea salt (optional - see Tips)"}],"nutrition":{"protein":"7.2 g","fat":"14.8 g","uom":"per 1 portion","carbohydrates":"7.9 g","calories":"828 kJ \/ 197.1 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 170°C. Grease and line a loaf tin (28 x 11 x 7 cm) with baking paper and set aside."},{"content":"Place Parmesan, pistachios and almonds into mixing bowl and chop <b>10 sec\/speed 7<b> or until finely chopped. Transfer into a bowl and set aside."},{"content":"Place zucchini into mixing bowl and chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add eggs and mix <b>5 sec\/\/speed 3<b>."},{"content":"Add all remaining ingredients, including reserved nut mixture and mix <b>15 sec\/\/speed 4<b> or until just combined. Transfer into prepared tin and sprinkle with extra chopped pistachios. Bake for 70 minutes (170 °C) or until a wooden skewer inserted into the middle of the loaf comes out clean. Allow to cool in loaf tin for 10 minutes, then transfer onto a wire rack to cool completely before serving."}],"hintsAndTricks":["<b>Baby's serve<b>: wait until your baby is managing some finger food (which may not happen until 8-9 months or older) before offering them this loaf, ensuring there are no large pieces of nut in the serving. Cut into strips or pieces that your baby can easily hold, spread with a little butter if liked.","<b>Toddler's serve<b>: serve as is, cut into smaller pieces, spread with a little butter if liked. Ensure that there are no large pieces of nut in the serving.","You can replace the almonds with hazelnuts in this recipe.","You can use raw, roasted or activated almonds in this recipe. Activated nuts have been soaked, which kick starts their germination process, and then dehydrated. In general, the benefit of using activated nuts is that activation helps to break down the naturally-occurring phytic acid and improves nutrient absorption and digestibility. However, the cooking of this loaf can affect the full activation benefits, so feel free to use whichever type of almonds you have on hand.","You can use cow's milk, soy or almond milk in this recipe.","Omit salt if serving to young children."],"basicInfo":["easy","10m","1h 30m","16 portions"]}