{"badges":["TM5","TM6"],"usefulItems":"parchment paper, fine mesh sieve","id":"r391013","imageLink":"https:\/\/2.bp.blogspot.com\/-RJWK0zgfDYk\/XZMusm5HDTI\/AAAAAAAAaIk\/2MNRLHVKTrswxwGMuUO-4o31mDR4RPxCwCLcBGAsYHQ\/s1600\/0_PBqUjkt4zL_LvshK.png","title":"Italian Wedding Soup","publishedAt":"2018-08-24T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Meatballs"},{"content":"2 oz Parmesan cheese, cubed, plus extra to garnish"},{"content":"1 oz bread crumbs"},{"content":"½ oz dried porcini mushrooms"},{"content":"4 oz yellow onion, in pieces"},{"content":"2 garlic cloves"},{"content":"16 oz ground beef, broken in pieces"},{"content":"1 tsp baking powder"},{"content":"½ tsp salt"},{"isHeader":true,"content":"Soup"},{"content":"4 oz yellow onion, in pieces"},{"content":"6 ½ oz fennel bulb, trimmed, cored, in pieces, plus fronds, to garnish"},{"content":"2 garlic cloves"},{"content":"½ oz dried porcini mushrooms"},{"content":"52 oz beef stock, low sodium"},{"content":"½ - 1 tsp salt, to taste"},{"content":"4 oz ditalini pasta"},{"content":"2 oz lacinato kale, de-stemmed, in pieces (1 in.)"}],"nutrition":{"protein":"27 g","fat":"13 g","uom":"per 1 portion","carbohydrates":"28 g","calories":"1393 kJ \/ 333 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Meatballs"},{"content":"Place Parmesan, bread crumbs and dried mushrooms into mixing bowl and chop <b>10 sec\/speed 10<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add onion and garlic and chop <b>3 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add ground beef, baking powder and salt and mix <b>8 sec\/speed 4<b>."},{"content":"Cut parchment to fit Varoma dish and tray (see Tip). Scrunch parchment into a ball, wet under running water and line Varoma dish and tray. Shape beef mixture into balls (approx. 1 oz ea.). Divide meatballs between Varoma dish and tray and set aside. Clean mixing bowl."},{"isHeader":true,"content":"Soup"},{"content":"Place onion, fennel, garlic and dried mushrooms into mixing bowl and chop <b>3 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add stock. Set Varoma with meatballs into position, secure Varoma lid and steam <b>30 min\/Varoma\/speed 2<b>, until meatballs are cooked through. Set Varoma aside and keep warm."},{"content":"Strain broth mixture through a fine mesh sieve. Discard solids. Place strained broth into mixing bowl and add salt, to taste. Add pasta and kale and cook <b>9 min\/212°F\/\/speed 1<b>."},{"content":"Divide soup and meatballs between bowls, garnish with fennel fronds and Parmesan cheese and serve hot."}],"hintsAndTricks":["To cut parchment to fit Varoma: tear off a piece of parchment paper wide enough to cover Varoma tray. Place Varoma tray on top of parchment and cut around the tray to form an oval shape. Ensure parchment does not cover side vents to allow circulation of steam."],"basicInfo":["easy","35m","1h 15m","6 portions"]}