{"badges":["TM5","TM6"],"usefulItems":"loose-based tartlet tins, silicone bread mat, rolling pin, pie weights, rice or dried beans, large baking tray, fine-mesh sieve, jug, baking paper, oven, refrigerator","id":"r397242","imageLink":"https:\/\/4.bp.blogspot.com\/-PllwIfEh1LU\/XZanK5y171I\/AAAAAAAAg7I\/Mu2EqLFOnwI6Dok7GdY00-bMXmHr9_KVwCLcBGAsYHQ\/s1600\/0_4a0kjDy7cY19T2CG.png","title":"Finger lime tarts","publishedAt":"2019-05-06T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Pastry"},{"content":"100 g butter, chilled and cut into pieces, plus extra for greasing"},{"content":"60 g hazelnuts"},{"content":"40 g quinoa flakes"},{"content":"80 g plain flour, plus extra for dusting"},{"content":"60 g wholemeal plain flour"},{"content":"1 egg"},{"content":"2 - 3 tsp cold water"},{"isHeader":true,"content":"Filling"},{"content":"3 - 4 limes, zest only, to taste"},{"content":"2 tbsp raw sugar"},{"content":"60 g honey (see Tips)"},{"content":"150 g freshly squeezed lime juice"},{"content":"2 tsp cornflour"},{"content":"150 g coconut milk"},{"content":"2 eggs"},{"content":"3 egg yolks"},{"content":"1 tsp finger lime powder (optional - see Tips)"},{"content":"finger limes, to serve (see Tips)"},{"content":"whipped cream, to serve"}],"nutrition":{"protein":"6.5 g","fat":"17.8 g","uom":"per 1 portion","carbohydrates":"21.5 g","calories":"1152.3 kJ \/ 274.4 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Pastry"},{"content":"Preheat oven to 160°C. Grease 10 loose-based tartlet tins (8 cm) and set aside."},{"content":"Place hazelnuts and quinoa flakes and mill <b>10 sec\/speed 7<b> or until finely chopped."},{"content":"Add flours and butter and mix <b>10 sec\/speed 5<b>, to a fine breadcrumb consistency."},{"content":"Add egg and water and knead <b>15 sec\/<b>, until mixture just comes together. Transfer onto a lightly floured silicone bread mat or work surface. Divide pastry into 10 equal portions. Roll out each portion into a thin circle (approx. 9 cm diameter, 2-3 mm thickness). Transfer pastry into prepared tins and gently press into sides of tins and repair any splits. Trim excess overhang and place pastry cases into refrigerator for 10 minutes. Clean and dry mixing bowl."},{"content":"Remove pastry cases from refrigerator. Line with baking paper and fill with pie weights, rice or dried beans. Place onto a large baking tray and bake for 10 minutes (160°C). Remove weights and baking paper, then bake for a further 5-7 minutes or until lightly golden. Set aside to cool completely."},{"isHeader":true,"content":"Filling"},{"content":"Place lime zest and sugar into mixing bowl and mill <b>15 sec\/speed 9<b>, to an almost powder consistency."},{"content":"Add honey, lime juice, cornflour, coconut milk, eggs, egg yolks and finger lime powder (optional) and mix <b>10 sec\/speed 6<b>."},{"content":"Using a fine-mesh sieve, strain mixture into a jug. Divide mixture evenly between cooled pastry cases and bake for 15-17 minutes (160°C) or until just set. Allow tartlets to cool completely in tins. Place into refrigerator until ready to serve. Top with fresh finger lime caviar and whipped cream just before serving."}],"hintsAndTricks":["<b>Baby's serve<b>: because these tarts include some added sugar and honey, you should wait until your child is over 12 months before serving.","<b>Toddler's serve<b>: serve as is as an occasional treat, cut up as needed, keeping serving sizes small.","For those with my <i>Sweet Nourish<\/i> book, these are a lovely fresh take on the lemon tart in that book, with a finger lime twist. If you can't source finger lime powder, just use the fresh finger lime on top - also known as lime caviar, it gives a lovely crunchy pop.","To save time, prepare the filling while the pastry cases are in the oven and store it in the refrigerator until you're ready to use it.","Honey is not suitable for children under 1 year of age."],"basicInfo":["medium","20m","2h 30m","10 portions"]}