{"badges":["TM5","TM6"],"usefulItems":"large bowl, baking paper, pastry brush, bowl, plastic wrap, silicone bread mat, loaf tin (20 cm), oven, refrigerator","id":"r397298","imageLink":"https:\/\/4.bp.blogspot.com\/-qlkuHSRhXo8\/XZWZ45oev0I\/AAAAAAAAeS4\/lLuXHMpcaaslOzBlxesZUKV3a5rq83IWgCLcBGAsYHQ\/s1600\/0_ne4IHhC_Xcp8hbvw.png","title":"Avocado whip on seedy spelt bread","publishedAt":"2019-05-06T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Avocado whip"},{"content":"3 sprigs fresh flat-leaf parsley, leaves only"},{"content":"80 g soft feta, cut into pieces"},{"content":"200 g avocado, flesh only"},{"content":"½ - 1 tbsp lemon juice, to taste"},{"content":"¼ tsp ground coriander"},{"content":"ground black pepper, to taste"},{"isHeader":true,"content":"Seedy spelt bread"},{"content":"20 g extra virgin olive oil, plus extra for greasing"},{"content":"280 g filtered water"},{"content":"1 tsp dried instant yeast"},{"content":"½ tsp sea salt"},{"content":"1 tsp coconut sugar"},{"content":"500 g white spelt flour, plus extra for dusting"},{"content":"2 tbsp hemp seeds (see Tips)"},{"content":"1 tbsp flaxseeds (linseeds), plus extra for sprinkling"},{"content":"2 tbsp pepitas, plus extra for sprinkling"},{"content":"milk of choice, for brushing  (see Tips)"},{"content":"micro herbs, for garnish (optional)"}],"nutrition":{"protein":"11 g","fat":"10.6 g","uom":"per 1 portion","carbohydrates":"25.1 g","calories":"1055.5 kJ \/ 251.3 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Avocado whip"},{"content":"Place parsley and feta into mixing bowl and chop <b>3 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add all remaining avocado whip ingredients and blend <b>20 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula."},{"content":" <b>Insert butterfly whisk<b>. Whip <b>30 sec\/speed 3.5<b> or until smooth. <b>Remove butterfly whisk<b>. Transfer into a bowl, cover with plastic wrap and place into refrigerator until ready to serve. Clean and dry mixing bowl."},{"isHeader":true,"content":"Seedy spelt bread"},{"content":"Grease a large bowl and set aside."},{"content":"Place water, yeast, oil, salt and sugar into mixing bowl and warm <b>2 min\/37°C\/speed 2<b>."},{"content":"Add flour, hemp seeds, flaxseeds (linseeds) and pepitas and mix <b>6 sec\/speed 3<b>, then knead <b>1 min 30 sec\/<b>. Transfer into prepared bowl, lightly coat top of dough with oil, cover bowl with plastic wrap and set aside in a warm place to prove until doubled in size (approx. 1 hour)."},{"content":"Preheat oven to 200°C. Grease and line a loaf tin (20 x 10 x 6 cm) with baking paper. Punch down dough, then transfer onto a silicone bread mat or floured work surface. Using your hands, lightly knead for approx. 1 minute, then shape into an oval, roughly the same length as the tin. Transfer into prepared loaf tin, cover with plastic wrap and set aside in a warm place to prove again until roughly doubled in size (approx. 30 minutes)."},{"content":"Brush top of bread with milk, using enough just to coat, then sprinkle with extra flaxseeds (linseeds) and pepitas. Bake for 35 minutes (200°C) or until cooked (loaf should sound hollow when tapped). Remove from tin and allow to cool."},{"content":"Spread 1-2 tablespoons of the Avocado whip over sliced bread and garnish with micro herbs (optional) to serve."}],"hintsAndTricks":["For a dairy free loaf, you can replace the milk with water or lightly beaten egg.","This recipe can also be prepared for the whole family (and as finger food for a younger child). Just be aware that feta is typically high in salt, so keep serving sizes small and chop any larger seeds for a younger child.","This bread is loveliest when fresh out of the oven (eaten the same day as baking) or toasted.","Hemp seeds are from the same species as cannabis, but they don't have any psychoactive effects. On the contrary, they're exceptionally nutritious and a rich source of protein, omega fats and various vitamins and minerals."],"basicInfo":["easy","25m","2h 30m","12 portions"]}