{"badges":["TM5","TM6"],"usefulItems":"baking sheet, pie pan (9 in.), vegetable peeler, rolling pin, oven, freezer","id":"r397227","imageLink":"https:\/\/4.bp.blogspot.com\/-Vy_1A1kuXec\/XZQGYDt79KI\/AAAAAAAAb9Y\/OFy9NCAR-KkCrc-KIRp0KLTd1ed6TPGAACLcBGAsYHQ\/s1600\/0_Ononmo6I2G6GXx7L.png","title":"Maple Sweet Potato Quiche","publishedAt":"2018-09-14T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"non-stick cooking spray"},{"content":"1 puff pastry, ready-made, thawed as per pkg. instructions"},{"content":"3 sweet potatoes, peeled (16-18 oz)"},{"content":"3 oz Monterey Jack cheese, cubed"},{"content":"10 sprigs thyme, leaves only, plus extra to garnish"},{"content":"1 sprig rosemary, leaves only"},{"content":"½ tsp salt"},{"content":"¼ tsp ground black pepper"},{"content":"1 pinch ground nutmeg"},{"content":"5 oz mascarpone"},{"content":"5 large eggs"},{"content":"2 oz maple syrup"},{"content":"olive oil spray, to spray rosettes"}],"nutrition":{"protein":"10 g","fat":"11 g","uom":"per 1 portion","carbohydrates":"21 g","calories":"912 kJ \/ 218 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 375°F. Lightly grease a pie pan (9 in.) with non-stick spray and set aside."},{"content":"Gently roll out puff pastry slightly larger than pie pan. Cut puff pastry (approx. 10 in. diameter) and place into prepared pan. Gently press dough into pan and up sides, trimming as needed. Place in freezer while preparing the filling."},{"content":"With a vegetable peeler, slice sweet potatoes into long thin strips, transfer to a bowl and set aside (see Tip)."},{"content":"Place cheese, thyme, rosemary, salt, pepper and nutmeg into mixing bowl and chop <b>5 sec\/speed 8<b>."},{"content":"Add mascarpone, eggs and maple syrup and mix <b>10 sec\/speed 3.5<b>. Pour mixture into prepared chilled crust."},{"content":"Lay 2-3 reserved sweet potato strips end to end, overlapping slightly. Roll the lined up potato strips into loose rosettes, slice bottoms of the rosettes so they stand upright in the pan and place into the egg mixture (see Tip). Fill the surface with rosettes. Carefully and sparingly, spray the rosettes with olive oil."},{"content":"Transfer to a baking sheet and bake 60-65 minutes (375°F), until baked through. Allow to cool 10 minutes before serving. Garnish with fresh thyme."}],"hintsAndTricks":["For easy rosette rolling: blanch sweet potato strips in boiling water for one minute and pat dry before rolling.","Choose long narrow sweet potatoes to achieve uniform rosettes.","Cover the quiche with foil during the last 10-20 minutes if it becomes too brown."],"basicInfo":["medium","40m","2h 10m","8 portions"]}