{"badges":["TM5","TM6"],"usefulItems":"baking paper, aluminium foil, paper towels, cling film, baking tray, large frying pan, refrigerator, hob","id":"r400912","imageLink":"https:\/\/3.bp.blogspot.com\/-7bCIfwNRWpg\/XZMu6nDSdsI\/AAAAAAAAaLQ\/g3UhwA9ifUwkwSYiGPIgy5D_6SDWADbaQCLcBGAsYHQ\/s1600\/0_Uylg0DsSODwvJFdO.png","title":"Crab Cakes","publishedAt":"2018-10-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"150 g bread, torn in pieces"},{"content":"30 g shallots, halved"},{"content":"30 g celery stalks, cut in pieces (5 mm)"},{"content":"5 sprigs fresh parsley, leaves only (approx. 5 g)"},{"content":"60 g red pepper, cut in pieces (5 mm)"},{"content":"2 Tbsp mayonnaise"},{"content":"2 large eggs"},{"content":"1 tsp Dijon mustard"},{"content":"1 tsp Worcestershire sauce"},{"content":"1 tsp Old Bay Seasoning (see tip)"},{"content":"¼ tsp fine sea salt"},{"content":"1 pinch ground black pepper, or to taste"},{"content":"450 - 500 g crab meat"},{"content":"vegetable oil, for frying"}],"nutrition":{"protein":"22 g","fat":"10 g","uom":"per 1 piece","carbohydrates":"16 g","calories":"701 kJ \/ 238 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Line a baking tray with baking paper or foil."},{"content":"Place bread in mixing bowl and grate <b>30 sec\/speed 9<b>. Transfer to a bowl and set aside."},{"content":"Place shallots, celery and parsley in mixing bowl then chop <b>5 sec\/speed 6<b>."},{"content":"Add red pepper and chop <b>6 sec\/speed 4<b>."},{"content":"Add mayonnaise, eggs, mustard, Worcestershire sauce, Old Bay Seasoning, salt and pepper then mix <b>8 sec\/speed 3<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add crab meat and 4 Tbsp reserved breadcrumbs then mix <b>5 sec\/\/speed <b>."},{"content":"Shape into 6 crab cakes. Place remaining breadcrumbs on a plate, lightly coat crab cakes with breadcrumbs and transfer to prepared baking tray. Cover with cling film and refrigerate for at least 1 hour."},{"content":"Heat oil in a large frying pan over a medium-high heat. When oil is hot, place crab cakes in pan (in batches if necessary) and fry until golden brown (approx. 3-5 minutes each side). Drain on paper towels then serve immediately."}],"hintsAndTricks":["Add <b>1-2 tsp<b> fresh coriander or dill leaves <b>(5-6 sprigs,<b> leaves only) to the mixture.","Crab cakes can be grilled instead of fried. Grill on a high temperature for <b>3-4 minutes<b> each side or until golden brown.","Serve crab cakes with sweet chilli dipping sauce, lemon wedges, or tartar sauce.","Sprinkle crab cakes with fresh coriander leaves, chopped chives or the green part of spring onions, sliced thinly.","If using shop-bought breadcrumbs or Panko, simply omit grating of bread and add with shallots .","To make your own Old Bay Seasoning, mix together <b>1 Tbsp<b> celery salt, <b>¼ tsp<b> paprika, <b>⅛ tsp<b> ground black pepper, <b>⅛ tsp<b> cayenne pepper, <b>1 pinch<b> mustard powder and <b>1 pinch<b> ground nutmeg."],"basicInfo":["easy","30m","1h 35m","6 pieces"]}