{"badges":["TM5","TM6"],"usefulItems":"baking sheet, parchment paper, candy thermometer, refrigerator","id":"r408834","imageLink":"https:\/\/3.bp.blogspot.com\/-fuVGC3oUonw\/XZWegAcu2vI\/AAAAAAAAe1I\/ljXz7rPS9ywmLNR-c2X2dzci6Yc4lb1kgCLcBGAsYHQ\/s1600\/0_aRFz9oHxvt2fkjcF.png","title":"Hazelnut Truffles","publishedAt":"2018-10-19T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"15 oz whole hazelnuts, divided"},{"content":"10 oz hazelnut wafer cookies"},{"content":"9 oz chocolate hazelnut spread"},{"content":"16 oz bittersweet chocolate, broken in pieces, divided"},{"content":"20 oz water"}],"nutrition":{"protein":"3 g","fat":"15 g","uom":"per 1 piece","carbohydrates":"16 g","calories":"845 kJ \/ 202 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Line a baking sheet with parchment and set aside."},{"content":"Place 10 oz hazelnuts and wafers into mixing bowl and chop <b>8 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add chocolate hazelnut spread and mix <b>20 sec\/speed 2<b>. Transfer to a bowl. Using a tablespoon, shape mixture into 40 balls. Place on prepared baking sheet and refrigerate until firm (approx. 20 min.). Clean and dry mixing bowl."},{"content":"Place 12 oz chocolate and 5 oz hazelnuts into mixing bowl and chop <b>6 sec\/speed 8<b>. Melt <b>6 min\/120°F\/speed 2<b>. Scrape down sides of mixing bowl with spatula. With a candy thermometer, ensure temperature is between 115°F-120°F. If necessary heat a further <b>2-5 min\/120°F\/speed 2<b>, until chocolate temperature is within range."},{"content":"Add remaining 4 oz chocolate and mix <b>2 min\/speed 2<b>. Stir chocolate with spatula to cool to 83°F. Use a candy thermometer to ensure temperature is within range. Transfer to a bowl."},{"content":"Place water into mixing bowl and heat <b>20 min\/205°F\/speed 2<b>. Meanwhile, stir reserved melted chocolate with spatula to cool to 83°F. Use a candy thermometer to ensure temperature is within range. Place the bowl of melted chocolate onto mixing bowl lid, over hot water and stir vigorously with spatula in 2-5 second bursts until temperature is between 88°F-91°F (see Tip)."},{"content":"Working quickly, use a fork to dip the reserved hazelnut balls into melted chocolate. Gently shake off excess and return to prepared baking sheet. Refrigerate 10 minutes until fully set before serving."}],"hintsAndTricks":["When dipping candies: use a candy thermometer to check temperature of melted chocolate is maintained at 88°F-91°F for proper setting. Place bowl with melted chocolate on mixing bowl lid and stir with spatula for 2-5 seconds, as needed, to keep chocolate tempered.","For best results: look for chocolate with high cocoa solids. Cocoa or some derivative, such as cocoa butter should be the primary ingredient. Quality chocolate will have a matte gloss finish and smooth texture that is free of discoloration. Dark chocolate should make a snapping sound when broken without crumbling while white and milk chocolate should bend rather than snap.","Before the chocolate sets, sprinkle truffles with chopped hazelnuts."],"basicInfo":["medium","1h","1h 30m","40 pieces"]}