{"badges":["TM5","TM6"],"usefulItems":"airtight jar, cling wrap, baking pan, kitchen towel, rolling pin, refrigerator, oven","id":"r415770","imageLink":"https:\/\/1.bp.blogspot.com\/-Z7Uss3C5wy8\/XZMvRuc3cOI\/AAAAAAAAaPw\/iIZ9RPj3JWgDryK6ThgBsgh96jFOvrtcgCLcBGAsYHQ\/s1600\/0_c709sdQ3Ym54garR.png","title":"Pesto with Pita Breads (Danny Bowien)","publishedAt":"2019-03-29T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Pesto"},{"content":"4 ½ oz Pecorino cheese, cubed"},{"content":"2 ½ oz Parmesan cheese, cubed"},{"content":"½ oz pine nuts"},{"content":"¼ tsp salt"},{"content":"1 garlic clove"},{"content":"4 oz fresh basil"},{"content":"10 oz extra virgin olive oil, divided"},{"isHeader":true,"content":"Starter"},{"content":"2 oz all-purpose flour"},{"content":"2 oz whole wheat flour"},{"content":"4 ½ oz water"},{"content":"&frac18; tsp active dry yeast"},{"isHeader":true,"content":"Pita Breads"},{"content":"7 ½ oz water"},{"content":"11 ½ oz all-purpose flour"},{"content":"3 ½ oz whole wheat flour"},{"content":"1 tsp sugar"},{"content":"1 tsp extra virgin olive oil"},{"content":"1 ½ tsp salt"},{"content":"Parmesan cheese, shaved, to garnish"},{"content":"fresh basil leaves, to garnish"}],"nutrition":{},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Pesto"},{"content":"Place Pecorino and Parmesan cheeses into mixing bowl and grate <b>10 sec\/speed 10<b>."},{"content":"Add pine nuts, salt, garlic, basil and 4 oz olive oil and chop <b>10 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add 6 oz olive oil and blend <b>10 sec\/speed 10<b>. Transfer into an airtight jar and store in the refrigerator."},{"isHeader":true,"content":"Starter"},{"content":"Place a bowl onto mixing bowl lid and weigh in all-purpose flour, whole wheat flour, water and yeast. Stir to combine. Cover and let stand at room temperature (10-12 hrs.). If not ready to use starter, refrigerate overnight and bring to room temperature before using."},{"isHeader":true,"content":"Pita Breads"},{"content":"Place reserved starter, water, all-purpose flour, whole wheat flour, sugar, olive oil and salt into mixing bowl and knead <b>3 min\/<b>. Transfer dough to a lightly oiled bowl, cover with cling wrap and let rise in a warm place until doubled in size (approx. 1-2 hrs.). Divide dough into 8 pieces, form into balls, cover with a kitchen towel and allow to rest for 15 minutes. With a rolling pin, roll each ball into a flat circle (approx. 6 in.), cover with a kitchen towel and allow to rest a further 15 minutes."},{"content":"Meanwhile, preheat oven and baking pan to 475°F."},{"content":"Place 2-4 dough circles onto preheated baking pan and bake for 6 minutes (475°F) until puffed up or pale golden. Repeat with remaining dough. Transfer hot pita breads onto a plate and cover immediately with a dry kitchen towel to keep them soft. Garnish Pesto with shaved Parmesan cheese and basil. Serve Pita Breads warm, spread or dipped in Pesto."}],"hintsAndTricks":["Thermomix Pita recipe adapted from Tartine Bakery.","For a crispier pita bottom, bake for 6 minutes (500°F) on an inverted cast iron pan.","Quick yeast method: replace starter with 1 tsp instant dried yeast and 11 oz water. Place dried yeast and water into mixing bowl and warm <b>30 sec\/100°F\/speed 2<b>.  Add 13.5 oz all-purpose flour, 4.5 oz whole wheat flour, 1 tsp sugar, 1 tsp olive oil and 1½ tsp salt and knead <b>3 min\/<b>. Allow dough to rise as per recipe.","Spread on warm fresh bread."],"basicInfo":["easy","15m","3h 5m","8 portions"]}