{"badges":["TM5","TM6"],"usefulItems":"cling wrap, round baking dish (10 in.), wire rack, refrigerator, oven","id":"r415767","imageLink":"https:\/\/1.bp.blogspot.com\/-PgWE2Tz4-3I\/XZWYxYlhEXI\/AAAAAAAAeDI\/hsnl5GbjOnUekHxukkM_Qo8Dnvr93FXsQCLcBGAsYHQ\/s1600\/0_K6Usir9xv4nzIW0p.png","title":"Cherry Clafoutis (Ludo Lefebvre)","publishedAt":"2019-03-29T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"2 oz unsalted butter, melted, plus extra to grease"},{"content":"16 oz whole milk"},{"content":"2 large eggs"},{"content":"2 egg yolks, from large eggs"},{"content":"4 oz sugar"},{"content":"1 tbsp Kirsch, to taste"},{"content":"1 tsp vanilla extract"},{"content":"1 pinch salt"},{"content":"3 ½ oz all-purpose flour, plus extra to dust"},{"content":"8 oz fresh cherries, pitted, de-stemmed (approx. 26 cherries)"},{"content":"confectioners sugar, to dust"}],"nutrition":{},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place butter into mixing bowl and melt <b>2 min\/160°F\/speed 1.5<b>."},{"content":"Add milk, eggs, egg yolks, sugar, Kirsch, vanilla, salt and flour and mix <b>20 sec\/speed 4<b>. Scrape down sides of mixing bowl with spatula and mix a further <b>10 sec\/speed 4<b>. Transfer to a bowl, cover with cling wrap and refrigerate for at least 2 hours (see Tip)."},{"content":"Preheat oven to 400°F. Generously grease bottom and sides of a round baking dish (10 in.), dust with flour and tap out excess."},{"content":"Pour batter into baking dish and place cherries into batter. The tops of the cherries should remain exposed after batter is added. Bake on center rack, 45-50 minutes (400°F) until puffed, lightly golden and center is set. Allow to cool on a wire rack."},{"content":"Dust with confectioners sugar and serve warm or at room temperature."}],"hintsAndTricks":["Batter can be made up to 2 days ahead and refrigerated.","To replace fresh cherries with frozen: thaw, drain juices and proceed with recipe.","Replace fresh cherries with pears, cored, sliced and diced (½ in.)."],"basicInfo":["easy","10m","3h 15m","8 portions"]}