{"badges":["TM5","TM6"],"usefulItems":"large bowl, serving jug, shallow freezer-proof containers, freezer, refrigerator","id":"r422546","imageLink":"https:\/\/4.bp.blogspot.com\/-uwSIlJv3JUE\/XZWYWoY4vnI\/AAAAAAAAd8s\/wit5qxerr-8s-fgFHZVZvNIxgPcVtVr2gCLcBGAsYHQ\/s1600\/0_855NQxYlx7-9LWyi.png","title":"Rice Pudding Ice Cream with Peach Coulis","publishedAt":"2019-01-14T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"400 g tinned rice pudding (1 tin)"},{"content":"2 egg whites, from medium eggs (see tip)"},{"content":"2 Tbsp caster sugar, plus 1 tsp optional"},{"content":"240 g tinned peach halves, drained, juice reserved (1 x 400 g tin)"}],"nutrition":{"protein":"6 g","fat":"1 g","uom":"per 1 portion","carbohydrates":"33 g","calories":"726 kJ \/ 171 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place tinned rice pudding in a large bowl."},{"content":" <b>Insert butterfly whisk<b>.  Place egg whites and sugar in mixing bowl then, without measuring cup, whisk <b>1 min 30 sec\/speed 4<b> or until stiff peaks form. <b>Remove butterfly whisk<b>. Gently fold into rice pudding to avoid knocking too much air out. Transfer to shallow freezer-proof containers, seal, and freeze for 4-5 hours until solid. Clean mixing bowl."},{"content":"Place peach halves and sugar (if using) in mixing bowl then blend <b>15 sec\/speed 7<b> until smooth. Scrape down sides and lid of mixing bowl."},{"content":"Add 40 g reserved peach juice and mix <b>5 sec\/speed 3<b>. Transfer to a serving jug and chill in fridge until required. Clean mixing bowl."},{"content":"Remove ice cream from freezer 15 minutes before serving."},{"content":"Turn out ice cream onto a board and cut into squares (3 cm). Place ice cream squares in mixing bowl and churn <b>30-45 sec\/speed 6<b> until smooth (see tip)."},{"content":"Serve ice cream with peach coulis poured over."}],"hintsAndTricks":["Not a true ice cream but a marvellous, easy and delicious dessert of frozen rice pudding with whipped egg whites.","Take care, this recipe contains raw eggs.","The ice cream can be returned to the freezer after churning to firm up. This will make it easier to scoop balls of ice cream into serving glasses."],"basicInfo":["easy","15m","4h 30m","4 portions"]}