{"badges":["TM5","TM6"],"usefulItems":"baking paper, aluminium foil","id":"r423879","imageLink":"https:\/\/4.bp.blogspot.com\/-Tl8b1XQYfGo\/XZMzicMlPdI\/AAAAAAAAayc\/eQXIxqvI_-4fAcW2jGHz8cWrS93dT3SvwCLcBGAsYHQ\/s1600\/0_eBvyfbyJrRFDhOW4.png","title":"Barley Nasi Goreng with Prawns","publishedAt":"2019-03-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Pearl Barley and Eggs"},{"content":"200 g pearl barley"},{"content":"800 g water"},{"content":"1 tsp groundnut oil"},{"content":"4 medium eggs"},{"content":"2 pinches fine sea salt"},{"content":"2 pinches ground black pepper"},{"isHeader":true,"content":"Nasi Goreng"},{"content":"2 garlic cloves"},{"content":"1 stalk fresh lemon grass, white part only, cut in pieces (1 cm)"},{"content":"4 sprigs fresh coriander, cut in pieces"},{"content":"120 g shallots, halved"},{"content":"5 g fresh root ginger, peeled, cut in round slices (2 mm)"},{"content":"15 g groundnut oil"},{"content":"200 g carrots, cut in pieces (2 cm)"},{"content":"200 g red cabbage, cut in pieces (3 cm)"},{"content":"200 g cooked, peeled prawns"},{"content":"20 g light soy sauce"},{"content":"½ tsp fine sea salt"},{"content":"¼ tsp ground black pepper"},{"content":"1 spring onion, finely chopped, for garnishing"},{"content":"2 Tbsp dried onion flakes, for garnishing"},{"content":"½ cucumber, halved lengthways then thinly sliced, for serving"},{"content":"2 tomatoes, cut in wedges, for serving"},{"content":"sriracha sauce, to taste (optional)"}],"nutrition":{"protein":"22 g","fat":"12 g","uom":"per 1 portion","carbohydrates":"52 g","calories":"1750 kJ \/ 416 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Pearl Barley and Eggs"},{"content":"Place barley and water in mixing bowl, boil <b>8 min\/100°C\/\/speed 1<b> then simmer <b>32 min\/98°C\/\/speed 1<b>. Meanwhile, line Varoma tray with enough baking paper to go 2 cm up the sides and grease with oil. Insert Varoma tray then break eggs onto it. Season with salt and pepper."},{"content":"Place covered Varoma into position (see tip) and steam <b>4 min\/Varoma\/\/speed 1<b>. Set covered Varoma aside then drain barley in simmering basket. Rinse briefly under cold running water then cover with foil to keep warm and set aside. Rinse mixing bowl."},{"isHeader":true,"content":"Nasi Goreng"},{"content":"Place garlic, lemon grass, coriander, shallots, ginger and oil in mixing bowl then chop <b>10 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula then chop again <b>10 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula then sauté <b>3 min\/100°C\/speed 1<b>."},{"content":"Add carrots and cabbage then chop <b>2-4 sec\/speed 4.5<b> until roughly chopped. Scrape down sides and lid of mixing bowl with spatula then sauté <b>3 min\/100°C\/\/speed 1<b>."},{"content":"Add prawns, soy sauce, reserved cooked barley, salt and pepper, stir in with spatula then cook <b>5 min\/100°C\/\/speed <b> (see tip). Divide between serving plates (see tip) and top each with a reserved steamed egg. Garnish with spring onion and dried onion flakes before serving warm with cucumber, tomato and sriracha sauce (if using)."}],"hintsAndTricks":["Whilst brown rice has more fibre than white rice, its GI is only slightly lower, both with a GI of <b>around 50.<b> This recipe substitutes the rice traditionally used in Nasi Goreng with pearl barley, which has much more fibre than white rice and has a GI approx. half that of rice.","In <b>step 2,<b> before placing Varoma into position, check the liquid in the barley. The starch can make the liquid become quite thick. If this happens, add <b>100-200 g<b> boiling water before steaming the eggs.","In <b>step 5,<b> heating time will depend on the size of prawns used. <b>5 minutes<b> will be enough for small prawns. If using larger prawns, prolong time as necessary until prawns are heated thoroughly.","For a nicer presentation, transfer nasi goreng to a bowl then invert onto a serving plate."],"basicInfo":["easy","30m","1h","4 portions"]}