{"badges":["TM6"],"usefulItems":"refrigerator","id":"r427794","imageLink":"https:\/\/4.bp.blogspot.com\/-AnZUqtRiYDY\/XZQHDTuZGnI\/AAAAAAAAcEs\/zBbULdSXhV0USiDMdr5tRxRA2tZm0EVKwCLcBGAsYHQ\/s1600\/0_bpHfFKGPYuw_M9Tb.png","title":"Chinese Pork with Vegetables","publishedAt":"2019-03-09T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"600 g pork fillet, sliced (0.5 cm x 1 cm x 5 cm)"},{"content":"50 g soy sauce"},{"content":"300 g dried rice noodles"},{"content":"50 g oil"},{"content":"2 garlic cloves"},{"content":"1 tsp fresh root ginger, freshly grated"},{"content":"150 g red onions, cut in wedges"},{"content":"150 g red peppers, sliced (0.5 cm x 5 cm)"},{"content":"150 g carrots, sliced (0.5 cm x 5 cm)"},{"content":"1280 g water"},{"content":"1 tsp Chinese five spice"},{"content":"1 tsp brown sugar"},{"content":"70 g oyster sauce"},{"content":"100 g mangetout, trimmed"},{"content":"150 g baby pak choi, roughly chopped"},{"content":"1 tsp fine sea salt"},{"content":"1 fresh red chilli, sliced diagonally"},{"content":"2 Tbsp roasted, unsalted cashew nuts"},{"content":"2 spring onions, sliced diagonally"}],"nutrition":{"protein":"30 g","fat":"10.6 g","uom":"per 1 portion","carbohydrates":"47 g","calories":"1735 kJ \/ 414.6 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place a bowl on mixing bowl lid, weigh in pork fillet and 30 g soy sauce. Remove bowl from lid, mix well with spatula then cover and set aside in fridge to marinate for 15-20 minutes."},{"content":"Place a large bowl on mixing bowl lid, weigh in rice noodles then set aside. Drain pork through simmering basket."},{"content":"Place 15 g oil and 300 g drained pork in mixing bowl then brown <b>High Temp.<b>. Transfer to a large bowl and set aside."},{"content":"Again place 15 g oil and remaining drained pork in mixing bowl.then brown <b>High Temp. <b>. Transfer to bowl with browned pork, set aside to keep warm."},{"content":"Place remaining 20 g oil and garlic in mixing bowl then chop <b>5 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add grated ginger, red onions, red peppers and carrots then sauté <b>High Temp.<b> ."},{"content":"Add 80 g water, Chinese five spice, sugar, remaining 20 g soy sauce, oyster sauce, mangetout and baby pak choi, mix well using spatula then cook <b>5 min\/120°C\/\/speed <b>. Transfer to bowl with browned pork, mix gently with spatula then set aside to keep warm."},{"content":"Place 1200 g water and 1 tsp salt in mixing bowl then boil <b>Kettle<b> . Pour over rice noodles in large bowl and allow to soak for the time indicated on packet. Drain through Varoma dish then transfer to a large serving bowl. Arrange reserved meat and vegetables over rice noodles and serve garnished with red chilli, roasted cashew nuts and spring onions."}],"hintsAndTricks":["Chinese flavours are a crowd pleaser for family and friends, and popular with all ages. Stir-fry this tasty and colourful pork dish in your Thermomix for a popular weekend lunch or a special dinner."],"basicInfo":["easy","45m","1h 20m","6 portions"]}