{"badges":["TM5","TM6"],"usefulItems":"pastry brush, paper towels, non-stick frying pan, rolling pin, hob","id":"r432806","imageLink":"https:\/\/3.bp.blogspot.com\/-ZF447lFTF2g\/XZQHmAj0f-I\/AAAAAAAAcJ4\/4wUwTTQjGoQT4E2UiobJXkiQ-Ojh9_hYgCLcBGAsYHQ\/s1600\/0_n0ObGJF4ka9P1OmT.png","title":"Lamb Loin Roll with Salsify and Sweet Potato","publishedAt":"2019-04-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Lamb Loin Roll"},{"content":"30 g olive oil"},{"content":"10 g Dijon mustard"},{"content":"1 garlic clove"},{"content":"1 sprig fresh thyme, leaves only"},{"content":"1 sprig fresh rosemary, leaves only"},{"content":"¼ tsp ground black pepper"},{"content":"1 ¾ tsp fine sea salt"},{"content":"4 lamb loins, boneless (approx. 120 g each)"},{"content":"500 g water"},{"content":"500 g sweet potatoes, diced (3 cm)"},{"content":"500 g black salsify, peeled, cut in pieces (3 cm) (see tip)"},{"content":"4 slices white sandwich bread (approx. 200 g)"},{"isHeader":true,"content":"Sauce and Finalisation"},{"content":"40 g unsalted butter, soft"},{"content":"40 g plain flour"},{"content":"50 g cream"},{"content":"50 g milk"},{"content":"1 meat stock cube (for 0.5 l), crumbled"},{"content":"¼ tsp fine sea salt"},{"content":"¼ tsp ground black pepper"},{"content":"oil, for frying"},{"content":"2 sprigs fresh thyme, for garnishing (optional)"}],"nutrition":{"protein":"34 g","fat":"44 g","uom":"per 1 portion","carbohydrates":"72 g","calories":"3682 kJ \/ 879 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Lamb Loin Roll"},{"content":"Place oil, mustard, garlic, thyme, rosemary, pepper and ¾ tsp salt in mixing bowl then chop <b>3 sec\/speed 5<b>. Transfer to a bowl."},{"content":"Brush lamb with herb oil then arrange on Varoma tray and set aside. Clean mixing bowl."},{"content":"Place water and 1 tsp salt in mixing bowl. Insert simmering basket and weigh in sweet potatoes. Place Varoma dish into position and weigh in salsify, ensuring some holes remain uncovered for steam to circulate. Insert Varoma tray, cover Varoma then steam <b>25 min\/Varoma\/speed 1<b>. Meanwhile, flatten bread with a rolling pin."},{"content":"Remove Varoma and carefully dab lamb dry with paper towels then brush again with reserved herb oil. Remove simmering basket with aid of spatula then transfer sweet potatoes to Varoma dish with salsify and cover to keep warm. Place one piece of lamb on each slice of bread then roll up. Empty mixing bowl, reserving steaming water."},{"isHeader":true,"content":"Sauce and Finalisation"},{"content":" <b>Insert butterfly whisk<b>. Place butter and flour in mixing bowl then heat <b>2 min\/100°C\/speed 2<b>."},{"content":"Add 400 g reserved steaming water (topped up with water if necessary), cream, milk, meat stock, salt and pepper then heat <b>5 min\/100°C\/speed 2<b>. Meanwhile, heat oil in a non-stick frying pan then place lamb rolls in pan, seam side down first, and fry until golden brown on all sides. Carefully <b>remove butterfly whisk<b>."},{"content":"Serve salsify, sweet potatoes and sauce with lamb rolls, each garnished with ½ sprig thyme (if using)."}],"hintsAndTricks":["Use rubber gloves to peel the salsify as it releases a milky juice that discolours the hands.","Place peeled salsify pieces in a bowl of water and lemon juice to stop them from browning.","If not available, substitute fresh salsify with drained tinned or jarred salsify. Alternatively, substitute with a different vegetable, such as parsnips or turnips."],"basicInfo":["advanced","20m","50m","4 portions"]}