{"badges":["TM5","TM6"],"usefulItems":"parchment paper, rolling pin, pastry brush, baking sheets (approx. 13 in. x 18 in.), oven","id":"r436980","imageLink":"https:\/\/3.bp.blogspot.com\/-eqdcUBqD1N4\/XZMvyY7QmcI\/AAAAAAAAaWI\/9drLG13Am5wpBXLFkfFqi05Cjq4ZkRrdACLcBGAsYHQ\/s1600\/0_pfkv4belurbZeUqK.png","title":"Vegan Parmesan Crackers","publishedAt":"2019-01-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"7 oz all-purpose flour, plus extra to dust"},{"content":"2 tbsp nutritional yeast, plus extra to spinkle for topping"},{"content":"1 tsp maple syrup"},{"content":"½ tsp salt"},{"content":"2 oz extra virgin olive oil, plus extra to brush"},{"content":"4 oz water"},{"content":"everything bagel seasoning, to sprinkle for topping"}],"nutrition":{"protein":"0 g","fat":"1 g","uom":"per 1 piece","carbohydrates":"2 g","calories":"67 kJ \/ 16 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 450°F. Line two baking sheets (approx. 13 in. x 18 in.) with parchment and set aside."},{"content":"Place flour, nutritional yeast, maple syrup, salt, olive oil and water into mixing bowl and knead <b>6 sec\/<b>. Transfer to a floured surface, knead into a ball and let rest 10 minutes."},{"content":"Dust work surface with flour and cut dough in half. Roll each piece of dough into a rectangle (12 in. x 18 in.) and using a lightly dusted rolling pin, transfer dough onto prepared baking sheets."},{"content":"Brush dough with olive oil and cut each rectangle into 40 pieces. Sprinkle dough with nutritional yeast and everything bagel seasoning. Press seasoning into dough and bake for 10-12 minutes (450°F) rotating pans halfway through baking. Serve immediately or store in an airtight container."}],"hintsAndTricks":["To make homemade everything bagel seasoning: place 2 tbsp sesame seeds, 2 tbsp poppy seeds, 1 tbsp dried minced onion, 2 tsp dried minced garlic and 1 tsp coarse kosher salt into mixing bowl and mix <b>5 sec\/\/speed 5.<b> Store in an airtight jar."],"basicInfo":["easy","10m","30m","80 pieces"]}