{"badges":["TM5","TM6"],"usefulItems":"baking sheet, parchment paper, large saucepot (approx. 4-5 qt.), cling wrap, slotted spoon, oven","id":"r461215","imageLink":"https:\/\/1.bp.blogspot.com\/-lYuHnSDaQXQ\/XZan2VhllJI\/AAAAAAAAhEk\/Pgh9dhwWZz05s9NSV7R4PFSkeIxAmfPLACLcBGAsYHQ\/s1600\/0_WL4NoSKdgdtRqA05.png","title":"Bavarian Pretzels","publishedAt":"2016-08-01T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"14 ½ oz milk"},{"content":"1 tbsp active dry yeast"},{"content":"21 ½ oz all-purpose flour"},{"content":"2 tsp salt"},{"content":"130 oz water (filling pot 4-5 in. deep)"},{"content":"6 tbsp baking soda"},{"content":"coarse salt, to taste"},{"content":"mustard, to serve"}],"nutrition":{"protein":"7 g","fat":"2 g","uom":"per 1","carbohydrates":"41 g","calories":"874 kJ \/ 209 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 375°F. Line a baking sheet with parchment and set aside."},{"content":"Place milk and yeast into mixing bowl and warm <b>2 min\/100°F\/speed 1<b>."},{"content":"Add flour and salt and knead <b>3 min\/<b>. Divide dough into 12 equal pieces. Roll each piece into a smooth ball and apply pressure from the center outwards to roll into 20 inch ropes. Form each rope into a U-shape and holding the ends of the rope, cross ends over each other then press the rope ends into the bottom of the U to form the pretzel. Cover with cling wrap and let rise for 15 minutes."},{"content":"In a large saucepot (approx. 4-5 qt), bring water to a rolling boil. Add baking soda. Wait until bubbling subsides."},{"content":"Place 2 to 3 pretzels into boiling water, without overcrowding. Let pretzels rise to the surface. Turn pretzels over allowing to boil for approximately 1 minute per side. Remove with a slotted spoon and transfer to prepared baking sheet. Sprinkle pretzels with coarse salt. Repeat with remaining pretzels."},{"content":"Bake for 15-18 minutes (375°F) or until golden brown. Serve warm with mustard."}],"hintsAndTricks":["To reheat: place each pretzel on a piece of foil large enough to completely wrap it. Add about 1 tbsp water per pretzel then wrap as tightly as possible. Set oven to 250°F and reheat approximately 20 minutes.","To freeze: place baked pretzels on a baking sheet and freeze for approximately an hour. Once the pretzels are frozen, store in a freezer bag or container until you are ready to heat &amp; eat. To reheat your pretzels – Preheat oven to 350°. Place pretzels on a baking sheet and bake for about 4-6 minutes."],"basicInfo":["easy","35m","55m","12 pieces"]}