{"badges":["TM5","TM6"],"usefulItems":"ThermoMat, plastic wrap, rolling pin, baking tray and paper, wire rack, airtight container, refrigerator, oven","id":"r66929","imageLink":"https:\/\/1.bp.blogspot.com\/-FO8P2TEaKGA\/XZXYZDUfbtI\/AAAAAAAAf-Y\/uDK0EYqoteQiPJ3Odz2EzvOPDCh-5qprQCLcBGAsYHQ\/s1600\/0_N5LNQagnemyp8lB0.png","title":"Quick puff pastry","publishedAt":"2014-09-05T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"200 g butter, cut into small pieces (1-2 cm), frozen"},{"content":"200 g plain flour, plus extra for flouring"},{"content":"90 g water, chilled"},{"content":"½ tsp salt"}],"nutrition":{"protein":"22 g","fat":"168 g","uom":"per 490 g","carbohydrates":"152 g","calories":"9300 kJ \/ 2223 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place butter, plain flour, chilled water and salt into mixing bowl and mix <b>20 sec\/speed 6<b>."},{"content":"Transfer pastry dough onto a ThermoMat or floured surface then work into a ball and flatten into a rough square. Wrap pastry square in plastic wrap and refrigerate for 20 minutes."},{"content":"Unwrap dough and place onto a ThermoMat or floured surface. Using a rolling pin, roll out dough into a long rectangle 3 times as long as it is wide (approx. 60 x 20 cm). Fold dough into thirds and give folded dough a quarter turn to the left. Repeat rolling and folding process twice, then return to refrigerator for 20 minutes or place in freezer for 5 minutes before using."},{"content":"Preheat oven to 200°C. Line a baking tray with baking paper and set aside."},{"content":"Roll dough into a rectangle (5 mm thick) and cut into required shape or shapes right before baking. Bake for 20 minutes (200°C) for one large piece of pastry, 12-15 minutes (200°C) for smaller pastries, or as per other recipes. Allow to cool on a wire rack before storing in an airtight container or serving."}],"hintsAndTricks":["This pastry serves as a base for cakes, pastries, cream puffs and fruit tarts.","The success of this recipe depends on keeping the pastry dough chilled so the layers of butter do not melt. A cold work surface (marble or stone) and a cool room temperature are helpful. If at any time during the process the dough feels warm, place into the freezer for 5 minutes before rolling out again.","If you don't have a ThermoMat, prevent dough from sticking to your work surface by using a light dusting of flour, or roll dough out between two sheets of baking paper.","Raw puff pastry dough freezes very well. Defrost in the refrigerator before using. Partially rolling out the dough before freezing allows pastry to defrost faster.","Once baked, pastry keeps well for up to 15 days stored in an airtight container in a cool dry place.","Substitute water with chilled white wine."],"basicInfo":["medium","20m","1h 20m","490 g"]}