{"badges":["TM5","TM6"],"usefulItems":"large bowl, plastic wrap or kitchen towel, ThermoMat, baking tray and paper, wire rack, pastry brush, oven, oven","id":"r67752","imageLink":"https:\/\/1.bp.blogspot.com\/-pbRGkXWqnCw\/XZXYiGTyomI\/AAAAAAAAf_Q\/Gc86G9oEkms0l3uwYj1r0Ry93osiY3TswCLcBGAsYHQ\/s1600\/0_Oj-07qzeA5rP2BCm.png","title":"Milk bread","publishedAt":"2014-09-05T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"300 g full cream milk"},{"content":"50 g butter, cut into pieces, plus extra for greasing"},{"content":"20 g fresh yeast, crumbled"},{"content":"60 g sugar"},{"content":"550 g baker's flour"},{"content":"1 ½ tsp salt"},{"content":"1 egg, lightly beaten, for brushing"}],"nutrition":{"protein":"3 g","fat":"2 g","uom":"per 1 slice","carbohydrates":"16 g","calories":"391 kJ \/ 93 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place full cream milk, butter, yeast and sugar into mixing bowl and heat <b>3 min\/37°C\/speed 2<b>. Meanwhile, lightly grease a large bowl and set aside."},{"content":"Add baker's flour and salt and knead <b>3 min\/<b>. The dough will be slightly sticky. If the dough is very wet, add 1 tbsp extra flour and knead a further <b>30 sec\/<b>, if necessary. Place dough into prepared bowl, cover with plastic wrap or a damp kitchen towel and leave to prove in a warm place until doubled in size (approx. 1 hour)."},{"content":"Line a baking tray with baking paper and set aside. Transfer dough onto a ThermoMat or lightly floured work surface. Divide dough into 3 pieces and roll each piece into a long thin 'rope' (approx. 45 cm). Join the 3 'ropes' at one end, plait, and join again at the other end. Place plaited dough onto prepared baking tray, cover with plastic wrap or a damp kitchen towel and leave to prove again in a warm place until doubled in size (approx. 30 minutes). Meanwhile, preheat oven to 180°C."},{"content":"Once dough has proved, brush with beaten egg and bake for 25-30 minutes (180°C) or until bread sounds hollow when tapped on the underside. Allow to cool on a wire rack then slice and serve."}],"hintsAndTricks":["Sprinkle with flaked almonds or pearl sugar after brushing with egg.","One minute before the end of step 2, add 80 g raisins.","Form dough into small men, using raisins for eyes and buttons."],"basicInfo":["medium","20m","2h 20m","30 slices"]}