{"badges":["TM5","TM6"],"usefulItems":"ThermoMat, aluminium foil, serving platter","id":"r68550","imageLink":"https:\/\/4.bp.blogspot.com\/-UaJOrY55iwo\/XZQuh7Af6_I\/AAAAAAAAcUQ\/d4kVxsQBFLkTXPjOSdAxKjidIjvBXYpxQCLcBGAsYHQ\/s1600\/0_1nhkIbD9wJDdlSWZ.png","title":"Meatloaf with mushroom sauce","publishedAt":"2014-09-05T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Meatloaf"},{"content":"60 g Parmesan cheese, crust removed, cut into pieces (3 cm)"},{"content":"4 sprigs fresh flat-leaf parsley, leaves only"},{"content":"1 garlic clove"},{"content":"1 sprig fresh rosemary, leaves only"},{"content":"500 g topside beef, slightly frozen, cut into pieces (3 cm)"},{"content":"2 eggs"},{"content":"50 g fresh breadcrumbs"},{"content":"1 pinch salt, to taste"},{"content":"1 pinch ground black pepper, to taste"},{"content":"8 - 10 slices prosciutto"},{"content":"2 slices double smoked ham, cut into halves"},{"content":"90 g mozzarella cheese, cut into cubes (2 cm)"},{"content":"500 - 800 g mixed vegetables, (e.g. celery, potato, carrot), cut into slices as needed, for serving"},{"isHeader":true,"content":"Mushroom sauce"},{"content":"1 spring onion\/shallot, trimmed, cut into pieces"},{"content":"30 g olive oil"},{"content":"200 g fresh mushrooms, roughly cut into slices"},{"content":"4 sprigs fresh thyme, leaves only"},{"content":"100 g white wine"},{"content":"380 g water"},{"content":"1 tsp vegetable stock paste"},{"content":"50 g pouring (whipping) cream"},{"content":"1 tbsp cornflour (mixed with 1 tbsp water)"},{"content":"1 pinch ground black pepper, to taste"},{"content":"1 tsp dry Marsala wine              (optional)"}],"nutrition":{"protein":"48 g","fat":"34 g","uom":"per 1 portion","carbohydrates":"17 g","calories":"2485 kJ \/ 592 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Meatloaf"},{"content":"Place Parmesan cheese and fresh flat-leaf parsley into mixing bowl and chop <b>10 sec\/speed 10<b>. Transfer into a bowl and set aside."},{"content":"Place garlic clove and rosemary into mixing bowl and chop <b>3 sec\/speed 7<b>.<b> Scrape down sides of mixing bowl with spatula."},{"content":"Add beef and chop <b>Turbo\/0.5 sec\/8 times<b>."},{"content":"Add eggs, breadcrumbs, salt, pepper and reserved Parmesan and parsley and chop <b>Turbo\/0.5 sec\/4 times<b>, then mix <b>20 sec\/speed 5<b> to incorporate."},{"content":"Lay out ThermoMat or a long sheet of aluminium foil onto a work surface and lay prosciutto lengthways onto it. Place mixture on top of prosciutto and shape mince mixture into a large rectangle (approx. 3 cm thick). Place ham and cheese cubes along the longest edge and roll mince into a log to enclose. Gently remove the ThermoMat or foil from underneath and ensure the prosciutto is wrapped securely around the outside of the meatloaf."},{"content":"Lightly oil Varoma tray and place meatloaf into the centre. Distribute mixed vegetables of choice loosely around meatloaf and in Varoma dish, ensuring there is no overcrowding. Set Varoma aside."},{"isHeader":true,"content":"Mushroom sauce"},{"content":"Place spring onion\/shallot into mixing bowl and chop <b>3 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add olive oil and sauté <b>3 min\/120°C\/speed 1<b>."},{"content":"Add mushrooms and thyme and sauté <b>5 min\/120°C\/\/speed <b>.<b> "},{"content":"Add white wine, water and vegetable stock paste. Place Varoma tray with meatloaf into position and cook <b> <b>40 min\/Varoma\/\/speed 1<b>.<b> Test to ensure meat is cooked through by slicing open and ensuring the colour is uniform, or continue to cook to your preference."},{"content":"Once meatloaf is cooked, set Varoma aside. Add cream, cornflour, pepper and Marsala (optional) to your sauce and cook <b>2 min\/80°C\/\/speed 1<b>."},{"content":"Place meatloaf onto a large platter with steamed vegetables and pour sauce over the top or serve on the side."}],"hintsAndTricks":["See Vegetable stock paste recipe to make it fresh in your Thermomix.","This is a fantastic family meal that is sure to change your perception of 'meatloaf'. Incorporate fillings of choice into this versatile meatloaf recipe.","Substitute the beef in this recipe with lamb, pork or chicken for a variation in flavour.","<b>Picnic meatloaf:<b> Use traditional sandwich fillings such as boiled eggs and sun-dried tomatoes to substitute the ham and cheese filling. Hard-boil your eggs as step 1, then proceed as per recipe above. You may want to refrigerate your meatloaf to a terrine-type texture and then slice just before serving at your picnic."],"basicInfo":["medium","10m","1h 15m","6 portions"]}