{"badges":["TM5","TM6"],"usefulItems":"serving bowl, refrigerator","id":"r70861","imageLink":"https:\/\/4.bp.blogspot.com\/-uaCa_5k1MU0\/XZadtMD0r4I\/AAAAAAAAgeo\/tM9ZVMxnK2IO4FToWbyCWjIztO9vd3JVgCLcBGAsYHQ\/s1600\/0_H5ABtPFlRPlhNl09.png","title":"Capsicum and sun-dried tomato dip","publishedAt":"2015-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"30 g Parmesan cheese, crust removed and cut into pieces (3 cm)"},{"content":"1 garlic clove"},{"content":"100 g sun-dried tomatoes or semi sun-dried tomatoes, drained"},{"content":"½ red capsicum, deseeded and cut into quarters"},{"content":"120 g unsalted cashew nuts"},{"content":"20 g olive oil"},{"content":"10 g white vinegar"}],"nutrition":{"protein":"2.9 g","fat":"6.3 g","uom":"per 50 g","carbohydrates":"3.9 g","calories":"363 kJ \/ 86 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place Parmesan and garlic into mixing bowl and grate <b>10 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add all remaining ingredients and chop <b>Turbo\/1 sec\/5-7 times<b>, or until a rough yet evenly chopped consistency is achieved."},{"content":"Serve immediately or refrigerate until ready to use."}],"hintsAndTricks":["Serve capsicum and sun-dried tomato dip with crackers and vegetable crudités of choice or spread over toasted slices of focaccia or ciabatta.","This dip freezes well. Transfer into a freezable container and place into the freezer until use. Allow to thaw before serving.","This dip makes a great alternative to pizza sauce.","If you prefer sheep's milk to cow's milk, substitute the Parmesan cheese in this recipe with sheep's milk Pecorino cheese instead.","<b>Nut free dip:<b> replace cashews with sunflower seeds and proceed as per recipe.","<b>Cashew free dip:<b> replace cashews with macadamia nuts and proceed as per recipe.","<b>Rocket dip:<b> add 30 g rocket leaves in step 2 with all remaining ingredients and proceed as per recipe."],"basicInfo":["easy","5m","5m","735 g"]}