{"badges":["TM31","TM5","TM6"],"usefulItems":"thermal serving bowl or other large bowl, serving jug","id":"r71138","imageLink":"https:\/\/1.bp.blogspot.com\/-0OAl8wmeYhM\/XZQwXwgYq8I\/AAAAAAAAclU\/kofCRlVIss8jQWwP-VWFoY9Fb6Sx0raMwCLcBGAsYHQ\/s1600\/0_YyuIdyMEGjQqcV8I.png","title":"Layered chicken dinner","publishedAt":"2014-07-22T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Chicken"},{"content":"1 whole chicken (1.2 - 1.4 kg)"},{"content":"1 lemon, zested and zest reserved for later"},{"content":"2 garlic cloves"},{"content":"2 sprigs fresh rosemary (approx. 10 cm each), leaves only"},{"content":"4 sprigs fresh flat-leaf parsley, leaves only"},{"content":"1 tsp ground paprika"},{"content":"1 tbsp sea salt"},{"isHeader":true,"content":"Pumpkin soup"},{"content":"120 g leek, white part only, trimmed and cut into quarters"},{"content":"2 garlic cloves"},{"content":"30 g olive oil"},{"content":"700 g butternut pumpkin, deseeded, peeled and cut into pieces (5 cm)"},{"content":"950 g water"},{"content":"230 g new baby potatoes (approx. 5), skins on, cut into eighths"},{"content":"170 g carrots (approx. 2), cut into pieces (2-3 cm)"},{"isHeader":true,"content":"Gravy"},{"content":"1 tbsp olive oil"},{"content":"300 g eschalots (approx. 8), peeled and cut into halves"},{"content":"50 g unsalted butter, cut into pieces"},{"content":"2 sprigs fresh rosemary (approx. 10 cm each), leaves only"},{"content":"120 g red wine"},{"content":"1 - 2 tsp Chicken stock paste (see Tips)"},{"content":"250 g water"},{"content":"1 tsp cornflour"},{"content":"½ tsp ground black pepper, to taste"},{"content":"100 g broccoli, cut into large florets"},{"content":"20 fresh green beans, (approx. 100 g) trimmed"}],"nutrition":{"protein":"47.5 g","fat":"44 g","uom":"per 1 portion","carbohydrates":"17.3 g","calories":"2862.6 kJ \/ 681.6 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Chicken"},{"content":"Place whole chicken into Varoma dish and fill chicken cavity with whole peeled lemon, garlic and rosemary. Set Varoma aside."},{"content":"Place reserved lemon zest and parsley into mixing bowl and chop <b>20 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add paprika and salt and mill <b>10 sec\/speed 9<b>. Rub mixture over chicken skin and set Varoma aside."},{"isHeader":true,"content":"Pumpkin soup"},{"content":"Without rinsing mixing bowl, place leek and garlic into mixing bowl and chop <b>3 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add oil and sauté <b>3 min\/120°C\/speed 1<b>."},{"content":"Add pumpkin and water to mixing bowl. Place Varoma with chicken into position, secure Varoma lid and steam <b>55 min\/Varoma\/speed 1<b>."},{"content":"Weigh potatoes and carrots into Varoma dish, arranging them around the whole chicken. Secure Varoma lid, then steam <b>15 min\/Varoma\/speed 1<b>. Check to see if chicken is cooked. If not, prolong cooking time as necessary. You may want to set vegetables aside before proceeding. Once chicken is cooked, remove Varoma and transfer chicken, potatoes and carrots into a thermal serving bowl or other large bowl and cover to keep warm."},{"content":" <b>Insert measuring cup<b> then blend <b>30 sec\/speed 5<b>, <b>increasing speed gradually to speed 9.<b> Transfer pumpkin soup into a separate thermal serving bowl or other large bowl and cover to keep warm. Clean and dry mixing bowl."},{"isHeader":true,"content":"Gravy"},{"content":"Place oil, eschalots and butter into mixing bowl and sauté <b>7 min\/120°C\/speed 1<b>, placing simmering basket instead of measuring cup onto mixing bowl lid."},{"content":"Add rosemary, wine, stock paste and water and cook <b>8 min\/Varoma\/speed 1<b>, placing simmering basket instead of measuring cup onto mixing bowl lid."},{"content":"Add cornflour and pepper to mixing bowl. Place Varoma dish into position and weigh broccoli and green beans into it. Secure Varoma lid, then steam <b>8 min\/Varoma\/speed 1<b>."},{"content":"Remove Varoma and transfer broccoli and green beans into thermal serving bowl or other large bowl and cover to keep warm. Strain gravy through simmering basket into a serving jug. Discard solids."},{"content":"Serve soup for entrée, followed by chicken, vegetables and gravy."}],"hintsAndTricks":["Depending on the size of your chicken, you may have to adjust cooking times slightly.","Change the vegetables in this recipe to suit your tastes and adjust cooking times for softer or firmer vegetables depending on what you prefer."],"basicInfo":["medium","30m","1h 45m","6 portions"]}