{"badges":["TM31","TM5","TM6"],"usefulItems":"medium-sized non-stick frying pan, ladle, bowl, refrigerator, stove top","id":"r71116","imageLink":"https:\/\/2.bp.blogspot.com\/-d5_yCZBxD6M\/XZaf3lOBerI\/AAAAAAAAgy8\/K6hl2IeTUSAPtk7soobvWhZ9e3oiG70ZwCLcBGAsYHQ\/s1600\/0_xdI_gGibSk2m9xqw.png","title":"Wholefood pancakes with vanilla and cinnamon poached apples","publishedAt":"2014-07-22T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Vanilla and cinnamon poached apples"},{"content":"1000 g water"},{"content":"3 cinnamon quills"},{"content":"2 vanilla bean pods, split lengthways, (seeds and pods)"},{"content":"250 g coconut sugar"},{"content":"400 g green apples, peeled, cores removed and cut into eighths"},{"isHeader":true,"content":"Wholefood pancakes"},{"content":"100 g brown rice"},{"content":"100 g buckwheat groats"},{"content":"2 bananas, peeled and chopped (approx. 190 g)"},{"content":"1 egg"},{"content":"300 g milk of choice (e.g. cow's milk, rice milk)"},{"content":"1 tsp baking powder"},{"content":"butter or oil, for frying"}],"nutrition":{"protein":"2.6 g","fat":"1.9 g","uom":"per 1 piece","carbohydrates":"31.2 g","calories":"643.8 kJ \/ 153.3 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Vanilla and cinnamon poached apples"},{"content":"Place all poached apple ingredients, including vanilla pods and seeds, into mixing bowl and cook <b>10 min\/100°C\/\/speed <b>."},{"content":"Mix contents of mixing bowl well with spatula, then cook for a further <b>10 min\/100°C\/\/speed <b>. Transfer into a bowl and set aside. Clean and dry mixing bowl."},{"isHeader":true,"content":"Wholefood pancakes"},{"content":"Place rice and buckwheat into mixing bowl and mill <b>1 min\/speed 9<b>."},{"content":"Add bananas and egg and mix <b>14 sec\/speed 4<b>."},{"content":"Add milk and baking powder and mix <b>30 sec\/speed 4<b>."},{"content":"Scrape down sides of mixing bowl with spatula, then mix for a further <b>6 sec\/speed 6<b>. Transfer batter into a bowl and place in refrigerator for 30 minutes."},{"content":"Remove pancake batter from refrigerator and mix with spatula. Place a medium-sized non-stick frying pan over medium-high heat and add a little butter or oil. Pour in a ladle of pancake mixture (approx. ¼ cup). Cook for 3 minutes, or until bubbles form on top of pancake then turn and cook for a further 3 minutes or until browned. Set pancake aside and cover to keep warm."},{"content":"Repeat with remaining batter to make approx. 16 pancakes, mixing the batter occasionally with spatula to keep batter smooth."},{"content":"Remove vanilla bean pods and cinnamon quills from reserved poached apples. Serve pancakes hot topped with poached apples."}],"hintsAndTricks":["For a decadent dessert, serve pancakes with blueberries and fresh cream or raspberries and vanilla bean ice cream.","For a lactose free version, ensure you use grapeseed oil rather than butter for frying and a dairy free milk, such as nut or coconut milk."],"basicInfo":["medium","35m","1h 25m","16 pieces"]}