{"badges":["TM5","TM6"],"usefulItems":"serving jug, baking paper, serving bowl, thermal serving bowl or other large bowl","id":"r78754","imageLink":"https:\/\/1.bp.blogspot.com\/-hTL5a__Y0lw\/XZQwPur-CPI\/AAAAAAAAckM\/CubBXV4VYaY_AWjlldOGdSDYiq3abD59ACLcBGAsYHQ\/s1600\/0_W-tjm8z3edzuPTft.png","title":"Moroccan chicken and couscous salad with sweet potato soup","publishedAt":"2015-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Capsicum and sun-dried tomato dip dressing"},{"content":"30 g Parmesan cheese, crust removed and cut into pieces (3 cm)"},{"content":"1 garlic clove"},{"content":"100 g sun-dried tomatoes or semi sun-dried tomatoes, drained"},{"content":"½ red capsicum, deseeded and cut into quarters"},{"content":"120 g raw cashew nuts"},{"content":"70 g olive oil"},{"content":"20 g white vinegar"},{"content":"100 g lemon juice (approx. 2-3 lemons)"},{"isHeader":true,"content":"Moroccan chicken salad and sweet potato soup"},{"content":"400 g pumpkin, peeled and cut into cubes (1 cm)"},{"content":"520 g chicken breast fillets, cut into cubes (2 cm)"},{"content":"160 g couscous, rinsed and drained"},{"content":"4 sprigs fresh coriander, leaves only"},{"content":"520 g sweet potatoes, peeled and cut into pieces (4-5 cm)"},{"content":"130 g dried red lentils"},{"content":"1250 g water"},{"content":"2 tbsp Vegetable stock paste (see Tips)"},{"content":"&frac18; tsp sea salt, to taste"},{"content":"&frac18; tsp ground black pepper, to taste"},{"content":"150 - 200 g fresh baby spinach leaves"},{"content":"50 g dried cranberries or raisins (approx. 2 tbsp)"},{"content":"8 dried apricots, cut into pieces"},{"content":"6 sprigs fresh mint or fresh coriander, leaves only, finely chopped"},{"content":"3 spring onions\/shallots, finely sliced"},{"content":"400 g canned chickpeas or canned kidney beans, rinsed and drained"},{"content":"7 fresh basil leaves, finely torn, for garnishing"}],"nutrition":{"protein":"66.5 g","fat":"64 g","uom":"per 1 portion","carbohydrates":"115 g","calories":"5687 kJ \/ 1354 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Capsicum and sun-dried tomato dip dressing"},{"content":"Place Parmesan and garlic into mixing bowl and grate <b>10 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add sun-dried tomatoes, capsicum, cashew nuts, 20 g of the oil and 10 g of the vinegar and chop <b>Turbo\/1 sec\/5 times<b>, or until a rough yet evenly chopped consistency is achieved. Scrape down sides of mixing bowl with spatula."},{"content":"Add lemon juice, remaining 50 g of the oil and 10 g of the vinegar and mix <b>5 sec\/speed 6<b>. Transfer dressing into a jug and set aside. Clean and dry mixing bowl."},{"isHeader":true,"content":"Moroccan chicken salad and sweet potato soup"},{"content":"Place Varoma dish into position then weigh pumpkin and chicken into it. Insert Varoma tray, then line with a piece of wet, well-wrung baking paper. Weigh couscous onto Varoma tray, then spread couscous evenly over tray with spatula. Set Varoma aside."},{"content":"Place coriander into mixing bowl and chop <b>2 sec\/speed 7<b>."},{"content":"Add sweet potato, red lentils, water, stock paste, salt and pepper into mixing bowl. Place a serving bowl onto mixing bowl lid and weigh spinach and dried cranberries or raisins into it. Set serving bowl aside. Place Varoma into position, secure Varoma lid and cook <b>17 min\/Varoma\/speed 1<b>."},{"content":"Arrange apricots, mint or coriander, spring onions\/shallots and chickpeas or kidney beans into serving bowl."},{"content":"Lightly stir pumpkin and chicken with spatula to ensure even cooking, then secure Varoma lid and cook for a further <b>7-8 min\/Varoma\/speed 1<b>, or until chicken is cooked through. Remove Varoma and transfer chicken, pumpkin and couscous into serving bowl with other salad ingredients. Pour over reserved sun-dried tomato dressing and combine."},{"content":" <b>Insert measuring cup<b> and blend <b>30 sec\/speed 4<b>-7, increasing speed gradually from speed 4 to speed 7.<b> Transfer soup into a thermal serving bowl or other large bowl and adjust seasoning to taste. Garnish soup with basil leaves and serve hot, followed by the salad."}],"hintsAndTricks":["Please refer to <i>The Basic Cookbook<\/i> for the Vegetable stock paste recipe."],"basicInfo":["easy","15m","40m","6 portions"]}