{"badges":["TM5","TM6"],"usefulItems":"nut milk bag or muslin cloth, frying pan, egg rings, paper towel, bowl, thermal serving bowl or other large bowl, turner\/fish slice, stove top","id":"r78745","imageLink":"https:\/\/3.bp.blogspot.com\/-6Nb6LLxeB9o\/XZadfhM0HjI\/AAAAAAAAgcY\/qO9k77ETzSEd7MT47-lic0SyDKJ9laXrwCLcBGAsYHQ\/s1600\/0_D54MKupsxFJgSupN.png","title":"Hash browns","publishedAt":"2015-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"1000 g potatoes, peeled and cut into halves"},{"content":"1 brown onion, cut into halves (approx.150 g)"},{"content":"1 garlic clove (optional)"},{"content":"60 g plain flour"},{"content":"2 eggs"},{"content":"1 tsp sea salt, plus extra to taste"},{"content":"1 pinch ground black pepper, plus extra to taste"},{"content":"grapeseed oil, for frying and greasing"}],"nutrition":{"protein":"3 g","fat":"3.3 g","uom":"per 1 portion","carbohydrates":"11.5 g","calories":"384 kJ \/ 91 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place potatoes into mixing bowl and chop <b>3-5 sec\/speed 5<b>, until an evenly chopped chunky consistency is achieved. Transfer chopped potato into a nut milk bag, muslin cloth or simmering basket and squeeze potato firmly to remove any excess liquid. Transfer into a bowl and set aside."},{"content":"Place onion and garlic (optional) into mixing bowl and chop <b>3 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add plain flour, eggs, salt, pepper and reserved chopped potato and combine <b>20 sec\/\/speed 4<b>."},{"content":"Heat a little oil in a frying pan over a medium-high heat. Grease 4 egg rings with grapeseed oil and place into frying pan. Pour potato mixture into egg rings, filling each egg ring ¾ of the way."},{"content":"Fry on both sides until golden brown and cooked through (approx. 3½ minutes on each side). Transfer into a thermal serving bowl or other large bowl, lined with paper towel to blot excess oil. Repeat with remaining batter, re-greasing egg rings with oil between each batch. Season to taste with salt and pepper and serve hot."}],"hintsAndTricks":["Serve your hash browns as part of a 'big breakfast' or with sour cream on the side, garnished with finely sliced spring onion\/shallots."],"basicInfo":["medium","40m","40m","15 portions"]}