{"badges":["TM5","TM6"],"usefulItems":"slice tin (15 x 25 cm), baking paper, ceramic or glass bowl, plastic wrap, baking trays, large bowl, square cake tin (18 cm), bowl, oven, refrigerator","id":"r78976","imageLink":"https:\/\/2.bp.blogspot.com\/-hHdmH5vaexg\/XZancVrt6sI\/AAAAAAAAg_E\/FP6ZsfHB3bIYRyEfsiHmzHmcXqx6GQOrQCLcBGAsYHQ\/s1600\/0_GbCtPsUlbFcK84vq.png","title":"Rocky road with vanilla bean marshmallow","publishedAt":"2015-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Vanilla bean marshmallow"},{"content":"butter, for greasing"},{"content":"30 g gelatine powder"},{"content":"280 g water"},{"content":"330 g white sugar"},{"content":"1 tsp vanilla bean paste"},{"isHeader":true,"content":"Rocky road"},{"content":"100 g slivered almonds"},{"content":"30 g desiccated coconut"},{"content":"150 g Turkish delight, cut into pieces (2 cm)"},{"content":"500 g dark chocolate or milk chocolate, broken into pieces"}],"nutrition":{"protein":"6 g","fat":"19 g","uom":"per 1 portion","carbohydrates":"63 g","calories":"1867 kJ \/ 444 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Vanilla bean marshmallow"},{"content":"Grease and line a slice tin (15 x 25 cm) with baking paper, allowing a 2 cm overhang at each end and set aside."},{"content":"Place a ceramic or glass bowl onto mixing bowl lid, then weigh gelatine and 140 g of the water into it. Combine gelatine and water, then set aside to soak."},{"content":"Place sugar into mixing bowl and mill <b>5 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add remaining 140 g of water and heat <b>15 min\/100°C\/speed 2<b>."},{"content":"Add reserved gelatine mixture and heat <b>2 min\/100°C\/speed 2<b>. Allow mixture to cool in mixing bowl until the temperature falls below 50°C (approx. 30 minutes)."},{"content":" <b>Insert butterfly whisk<b> and beat <b>7 min\/speed 3.5<b>."},{"content":"Add vanilla and combine <b>10 sec\/speed 3<b>. <b>Remove butterfly whisk.<b> Pour into prepared baking tin, cover with plastic wrap and set aside until set (approx. 1 hour). Once set, cut into small pieces (2 cm) and set aside."},{"isHeader":true,"content":"Rocky road"},{"content":"Preheat oven to 180°C. Line 2 baking trays with baking paper. Place a bowl onto mixing bowl lid and weigh almonds into it, then evenly spread slivered almonds onto 1 baking tray. Place a bowl onto mixing bowl lid and weigh coconut into it, then evenly spread desiccated coconut onto the other tray."},{"content":"Bake almonds for 6 minutes (180°C) and coconut for 2 minutes (180°C) or until lightly browned. Remove trays from oven and set both aside to cool."},{"content":"Place a large bowl onto mixing bowl lid and weigh 100 g of the reserved marshmallows, cut into pieces (2 cm) into it. Add reserved cooled coconut and combine. Remove any excess coconut from the bowl and set aside. Add reserved toasted slivered almonds and Turkish delight pieces to bowl with marshmallows, combine and set aside."},{"content":"Line a square baking tin (18 cm) with baking paper, allowing a 2 cm overhang at each end and set aside."},{"content":"Place chocolate into mixing bowl and grate <b>5 sec\/speed 8<b>."},{"content":"Scrape down sides of mixing bowl with spatula, then melt <b>3 min\/60°C\/speed 1<b>."},{"content":"Scrape down sides of mixing bowl with spatula again and melt for a further <b>2-4 min\/60°C\/speed 1<b>, or until chocolate is fully melted."},{"content":"Pour melted chocolate into the large bowl with all other ingredients and combine well using spatula."},{"content":"Pour rocky road into prepared baking tin, then place into refrigerator to set."},{"content":"Once set, cut into pieces and serve."}],"hintsAndTricks":["Roll remaining marshmallow pieces in remaining coconut or cornflour before placing into a sealable container to store."],"basicInfo":["medium","30m","2h 45m","16 portions"]}