{"badges":["TM31","TM5","TM6"],"usefulItems":"deep-sided baking dish (32 x 23 x 6 cm), large bowl, oven","id":"r79762","imageLink":"https:\/\/2.bp.blogspot.com\/-ywZd1ATGUyI\/XZWZnd1ZJUI\/AAAAAAAAePs\/6WtQKrKdZW4iJD0GhudExnFLzOH8sdXswCLcBGAsYHQ\/s1600\/0_hH5Kbnj9-Pu4bLKB.png","title":"Feta, spinach and potato frittata","publishedAt":"2015-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"olive oil, for greasing"},{"content":"½ red onion (approx. 130 g), cut into halves"},{"content":"100 g cheddar cheese, cut into pieces (3 cm)"},{"content":"200 g feta cheese, cut into pieces (3 cm)"},{"content":"10 eggs"},{"content":"100 g fresh baby spinach leaves"},{"content":"800 g water"},{"content":"350 g pumpkin, peeled and cut into cubes (2 cm)"},{"content":"350 g sweet potato, peeled and cut into cubes (2 cm)"},{"content":"300 g potato, peeled and cut into cubes (2 cm)"}],"nutrition":{"protein":"19.8 g","fat":"17.4 g","uom":"per 1 portion","carbohydrates":"16.5 g","calories":"1291 kJ \/ 307 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 200°C. Grease a deep-sided baking dish (32 x 23 x 6 cm) and set aside."},{"content":"Place onion into mixing bowl and chop <b>3 sec\/speed 5<b>. Transfer into a large bowl and set aside."},{"content":"Place cheddar into mixing bowl and chop <b>5 sec\/speed 5<b>."},{"content":"Add feta and chop <b>3 sec\/speed 5<b>. Transfer into large bowl with the onion and set aside."},{"content":"Place eggs and spinach into mixing bowl and mix <b>5 sec\/speed 5<b>. Transfer into large bowl with the cheeses and onion and set aside. Rinse mixing bowl."},{"content":"Place water into mixing bowl, place Varoma dish into position and weigh pumpkin into it. Insert Varoma tray and weigh sweet potato and potato pieces onto it. Secure Varoma lid and cook <b>10 min\/Varoma\/speed 1<b>. Toss all vegetables in Varoma dish and tray with spatula to ensure even cooking, then secure Varoma lid and cook for a further <b>10 min\/Varoma\/speed 1<b>."},{"content":"Transfer cooked vegetables into the large bowl with the cheese, egg and spinach mixture and combine well with spatula. Transfer into prepared baking dish and bake for 20-30 minutes (200°C), until lightly golden brown. Slice and serve warm, or allow to cool and place into refrigerator until ready to serve."}],"basicInfo":["easy","20m","1h","8 portions"]}