{"badges":["TM5","TM6"],"usefulItems":"heat-resistant cling film, refrigerator","id":"r80478","imageLink":"https:\/\/4.bp.blogspot.com\/-CPmraJBpjH0\/XZMuteYNumI\/AAAAAAAAaIw\/7xuusStW3Wov88mr7mwiRfrr2h-9SvxKwCLcBGAsYHQ\/s1600\/0_PJZQqzmeqUnpXuV0.png","title":"Chicken galantine with dill yoghurt","publishedAt":"2017-07-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Chicken galantine"},{"content":"150 g mixed peppers (e.g. red, green, yellow), cut in pieces"},{"content":"300 g chicken breast, skinless, boneless, cut in pieces (3-4 cm)"},{"content":"300 g chicken leg meat, skinless, boneless (from approx. 500 g chicken legs), cut in pieces"},{"content":"1 pinch ground black pepper"},{"content":"2 tsp vegetable salt, homemade,"},{"content":"500 g water"},{"isHeader":true,"content":"Dill yoghurt sauce"},{"content":"10 - 15 sprigs fresh dill, leaves only"},{"content":"1 garlic clove"},{"content":"300 g plain yoghurt"},{"content":"50 g mayonnaise"},{"content":"2 pinches salt"}],"nutrition":{"protein":"4 g","fat":"2 g","uom":"per 1 slice","carbohydrates":"1 g","calories":"140 kJ \/ 34 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Chicken galantine"},{"content":"Place mixed peppers in mixing bowl and chop <b>3 sec\/speed 5<b>. Drain chopped peppers through simmering basket, transfer them to a medium bowl and set aside."},{"content":"Place chicken breasts in mixing bowl and mince <b>10 sec\/speed 7<b>. Transfer to bowl with chopped peppers and set aside."},{"content":"Place chicken leg meat in mixing bowl and mince <b>10 sec\/speed 7<b>."},{"content":"Add black pepper, vegetable salt, reserved minced chicken breasts and chopped peppers to mixing bowl and mix <b>10 sec\/speed 3<b>."},{"content":"Divide mixture onto 2 large pieces of heat-resistant cling film (30 cm x 60 cm each), wrap and form each into a sausage shape. Close ends of cling film tightly and place galantine rolls in Varoma dish."},{"content":"Place water in mixing bowl, set Varoma in position and steam <b>30 min\/Varoma\/speed 1<b>. Set Varoma aside, clean and dry mixing bowl. Allow galantine rolls to cool for 30 minutes, then refrigerate for 2 hours."},{"isHeader":true,"content":"Dill yoghurt sauce"},{"content":"Place dill and garlic clove in mixing bowl and chop <b>4 sec\/speed 7<b>."},{"content":"Add plain yoghurt, mayonnaise and salt and mix <b>10 sec\/speed 4<b>. Transfer sauce to a bowl. Unwrap galantine rolls, cut in slices (1 cm) and serve cold with sauce."}],"hintsAndTricks":["Serve this colourful chicken galantine with its zesty sauce as a starter with salad, at a picnic, at a buffet, or in a sandwich. Making your own cold cuts means you know exactly what you are feeding your family and friends, and you can also leave out or add ingredients to your liking.","Cut chicken galantine in very thin slices and enjoy it on bread with some of the sauce."],"basicInfo":["medium","25m","3h 25m","40 slices"]}