{"badges":["TM5","TM6"],"usefulItems":"baking paper, baking tray (20 x 30 cm), ceramic or glass bowl, plastic wrap, paper towel, thermal serving bowl or other large bowl, turner \/ fish slice, medium-sized non-stick frying pan, oven, stove top","id":"r82195","imageLink":"https:\/\/2.bp.blogspot.com\/-DUehJFc9xrU\/XZMwPckGRHI\/AAAAAAAAabQ\/v-XvK4q7YhU5LT8abanWfAtL22RHnALawCLcBGAsYHQ\/s1600\/0_zIT1zWHphaD_nSDj.png","title":"Meatballs with Romesco sauce","publishedAt":"2015-05-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Romesco sauce"},{"content":"1 red capsicum, deseeded and cut into quarters"},{"content":"1 fresh tomato, cut into halves"},{"content":"½ red onion, unpeeled"},{"content":"2 garlic cloves, unpeeled"},{"content":"50 g blanched almonds"},{"content":"1 slice day old bread, torn into pieces"},{"content":"1 tbsp sherry"},{"content":"¼ tsp ground smoked paprika"},{"content":"50 g olive oil"},{"content":"1 tbsp red wine vinegar"},{"content":"2 pinches sea salt, to taste"},{"content":"2 pinches ground black pepper, to taste"},{"content":"2 tsp dried chilli flakes"},{"isHeader":true,"content":"Meatballs"},{"content":"500 g topside beef, cut into pieces (3 cm) and slightly frozen"},{"content":"250 g chorizo sausage, casing removed and cut into pieces"},{"content":"½ red onion (approx. 100 g)"},{"content":"2 garlic cloves"},{"content":"3 sprigs fresh flat-leaf parsley, leaves only"},{"content":"1 slice day old bread, torn into pieces"},{"content":"¼ tsp ground nutmeg"},{"content":"¼ tsp ground fennel seeds"},{"content":"¼ tsp ground smoked paprika"},{"content":"¼ tsp sea salt"},{"content":"¼ tsp ground black pepper"},{"content":"1 egg"},{"content":"1 tbsp olive oil, for greasing"}],"nutrition":{"protein":"17 g","fat":"21.4 g","uom":"per 1 portion","carbohydrates":"4.3 g","calories":"1163 kJ \/ 277 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Romesco sauce"},{"content":"Preheat oven to 200°C. Line a baking tray with baking paper. Place capsicum, tomato, red onion and garlic onto it and roast for 20-25 minutes (200°C) or until vegetables are softened and lightly blackened."},{"content":"Transfer roasted vegetables immediately into a ceramic or glass bowl and cover tightly with plastic wrap. Leave to stand for 10 minutes. The steam created in the bowl will loosen the vegetable skins making them easier to peel."},{"content":"Remove roasted vegetables from bowl and transfer onto paper towel to drain. Gently peel skin from vegetables and discard skins. Transfer peeled vegetables back onto plate and set aside."},{"content":"Place blanched almonds into mixing bowl and roast <b>8 min\/Varoma\/speed 1<b>. Set aside in mixing bowl to cool (approx. 5 minutes)."},{"content":"Add all remaining Romesco sauce ingredients, including reserved peeled vegetables, and blend <b>30 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula, then blend a further <b>30 sec\/speed 5<b>, or until smooth. Transfer sauce into a thermal serving bowl or other large bowl until ready to use."},{"isHeader":true,"content":"Meatballs"},{"content":"Place beef into mixing bowl and mince <b>10-15 sec\/speed 7<b>, until a mince consistency is achieved. Transfer into a bowl and set aside."},{"content":"Place chorizo, red onion, garlic, parsley and bread into mixing bowl and chop <b>Turbo\/1 sec\/6-7 times<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add nutmeg, fennel, paprika, salt, pepper, egg and reserved mince and blend <b>10 sec\/speed 7<b>. Roll mixture into walnut-sized meatballs, to make approx. 30, and set aside."},{"content":"Place a medium-sized non-stick frying pan over medium-high heat and add olive oil. Cook meatballs in batches for 10-12 minutes, or until golden and cooked through, turning occasionally."},{"content":"Transfer meatballs onto a plate lined with paper towel to drain excess oil, then serve with reserved Romesco sauce."}],"hintsAndTricks":["Try making some Guacamole or Herb and garlic dip to serve with your meatballs as an alternative to the Romesco sauce (see <em>The Basic Cookbook<\/em>)."],"basicInfo":["easy","20m","1h 40m","10 portions"]}