{"badges":["TM5","TM6"],"usefulItems":"baking paper, large jug, shallow baking tin (25 x 16 cm), refrigerator","id":"r82486","imageLink":"https:\/\/3.bp.blogspot.com\/-vLLJpxyNaIk\/XZMwF0XjV_I\/AAAAAAAAaZg\/-EsXGAk76Qgtu0Y6g_EJGa9zS5GLBzrpQCLcBGAsYHQ\/s1600\/0_vaBLBT0K_r7vjFpO.png","title":"Apple and ginger paste","publishedAt":"2015-08-07T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"80 - 100 g fresh ginger, peeled and cut into pieces"},{"content":"1 pear (approx. 170 g), unpeeled, cut into quarters and core removed"},{"content":"5 Granny Smith apples (approx. 550 g), unpeeled, cut into quarters and cores removed"},{"content":"1 lemon, zest only, no white pith"},{"content":"40 g lemon juice (approx. 1 lemon)"},{"content":"120 g water"},{"content":"600 - 700 g white sugar (weight is approximate)"}],"nutrition":{"protein":"0.08 g","fat":"0.01 g","uom":"per 1 portion","carbohydrates":"22 g","calories":"365 kJ \/ 87 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Line a shallow baking tin (25 x 16 cm) with baking paper and set aside."},{"content":"Place ginger into mixing bowl and chop <b>3 sec\/speed 7<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add pear, apples, lemon zest, lemon juice and water and chop <b>10 sec\/speed 5<b>, then cook <b>30 min\/100°C\/speed 1<b>. Transfer into a jug."},{"content":"Weigh apple and ginger mixture back into mixing bowl, noting the final weight (mixture should weigh approx. 800-900 g). Add ¾ of the total mixture weight in sugar (approx. 600-700 g) and purée <b>15 sec\/speed 8<b>."},{"content":"Cook <b>99 min\/100°C\/speed 3<b>, placing simmering basket instead of measuring cup onto mixing bowl lid, or until set (see Tips)."},{"content":"Pour into prepared baking tin and allow to cool (2 hours), then place in refrigerator to set for minimum 2 hours."},{"content":"Once set, serve immediately or store in refrigerator until ready to serve."}],"hintsAndTricks":["<b>Setting point test:<b> place a saucer into the freezer (5-10 minutes). Place 1 tsp paste onto the chilled saucer. When paste on saucer is cool, push it with your finger. If the paste wrinkles, it is ready. If not, continue to cook for 10 minutes or until required consistency is achieved.","The pectin in the fruit is what assists your paste to set firm. It is best to use slightly under-ripe fruit in this recipe, as this has higher pectin levels than ripe fruit.","Serve apple and ginger paste with cheese and crackers or give as an edible gift to friends and family.","You can cut your Apple and ginger paste into a circular shape or smaller rectangular pieces, using a cookie cutter or clean, sharp knife."],"basicInfo":["easy","15m","6h 15m","40 portions"]}