{"badges":["TM5","TM6"],"usefulItems":"rolling pin, cookie cutter (Ø 7 cm), cling film, 2 baking trays and baking paper, wire rack, air-tight container, refrigerator, oven","id":"r83792","imageLink":"https:\/\/3.bp.blogspot.com\/-g1gVPFoIDv8\/XZaomoG4d5I\/AAAAAAAAhLs\/ayHg0eqZkxssqyKZo9Q0jSkHSfeAW409wCLcBGAsYHQ\/s1600\/0_tME5nOTf4m09FAnR.png","title":"Oatcakes","publishedAt":"2015-12-17T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"250 g jumbo oats"},{"content":"100 g pinhead oats"},{"content":"100 g spelt flour, plus extra for dusting"},{"content":"50 g wholemeal flour"},{"content":"250 g unsalted butter, cold, diced"},{"content":"20 g water"},{"content":"½ tsp fine sea salt"},{"content":"1 large egg"}],"nutrition":{"protein":"2.6 g","fat":"8.7 g","uom":"per 1 portion","carbohydrates":"11 g","calories":"554 kJ \/ 132 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place 200 g oats in mixing bowl and grind <b>4 sec\/speed 10<b>."},{"content":"Add remaining 50 g oats, pinhead oats, spelt flour, wholemeal flour, butter, water, salt and egg then mix <b>15 sec\/speed 4<b>. Scrape down sides  of bowl with spatula then mix <b>10 sec\/speed 4<b>. Tip out and bring together into a ball, wrap in cling film and chill in fridge for 30 minutes. Meanwhile, preheat oven to 180°C and line two baking trays with baking paper."},{"content":"On a lightly floured surface, divide dough in two and roll each out to a thickness of 4-5 mm. Using a cutter (Ø 7 cm), cut out rounds, then place on prepared baking trays."},{"content":"Bake for 8 minutes (180°C) then carefully flip the oatcakes over and bake for a further 8 minutes (180°C). Leave on baking trays for 2 minutes before transferring to a wire rack to cool, during which time the biscuits will harden. Eat immediately or store in an airtight container for up to 1 week."}],"hintsAndTricks":["Add 1 Tbsp finely chopped rosemary needles to dough in step 2.","Scatter ground Parmesan cheese over oatcakes before baking.","This Scottish staple is such a popular supermarket shelf product that it rarely occurs to us to make our own. But it’s surprisingly simple, and is another recipe where you can come up with any number of variations, adding seeds, cheese or herbs."],"basicInfo":["easy","15m","1h","28 pieces"]}