{"badges":["TM5","TM6"],"usefulItems":"cling film, rolling pin or pasta machine, pastry wheel or cutter, pastry brush, saucepan, slotted spoon, refrigerator, hob","id":"r85241","imageLink":"https:\/\/4.bp.blogspot.com\/-KadY54ibYC8\/XZQFVKVDe0I\/AAAAAAAAbxo\/lqsR6NdK3TcCOZMDdjoBaGOSBSmMY7vxACLcBGAsYHQ\/s1600\/0_1P2SQkKRbZ91utsU.png","title":"Prawn and Asparagus Basil Ravioli","publishedAt":"2015-05-13T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Basil Pasta Dough"},{"content":"30 g fresh basil leaves"},{"content":"3 large eggs"},{"content":"330 g pasta flour (00 flour)"},{"content":"1 Tbsp olive oil"},{"content":"1 tsp fine sea salt"},{"isHeader":true,"content":"Ravioli Filling"},{"content":"60 g Parmesan cheese, cut in pieces"},{"content":"10 - 15 g bread"},{"content":"25 g butter, plus extra for sautéing"},{"content":"120 g onions, quartered"},{"content":"100 g asparagus, woody ends discarded"},{"content":"30 g peeled, raw prawns"},{"content":"1 egg yolk"},{"content":"¼ tsp ground black pepper"},{"isHeader":true,"content":"Cooking"},{"content":"water, for cooking pasta"},{"content":"1 tsp fine sea salt"}],"nutrition":{"protein":"26 g","fat":"21.3 g","uom":"per 1 portion","carbohydrates":"59.6 g","calories":"2234 kJ \/ 534 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Basil Pasta Dough"},{"content":"Place basil leaves in mixing bowl and chop <b>3 sec\/speed 8<b>. Scrape down sides of mixing bowl with spatula and chop again <b>3 sec\/speed 8<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add eggs, flour, oil and salt then mix <b>30 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula and knead <b>4 min\/<b>. Tip out dough, bring together into a ball then wrap in cling film and leave to rest in fridge for 1 hour. Meanwhile, rinse and dry mixing bowl and make filling."},{"isHeader":true,"content":"Ravioli Filling"},{"content":"Place Parmesan in mixing bowl and grate <b>10 sec\/speed 10<b>. Transfer to a bowl. Remove 1 Tbsp grated Parmesan to another bowl then set both bowls aside."},{"content":"Place bread in mixing bowl and chop <b>10 sec\/speed 9<b>. Transfer to bowl with larger amount of Parmesan and set aside."},{"content":"Place butter, onions and asparagus in mixing bowl then chop <b>8 sec\/speed 5<b>. Cook <b>10 min\/100°C\/speed 1<b>."},{"content":"Add prawns and mix <b>2 sec\/speed 7<b>."},{"content":"Add egg yolk, pepper, reserved Parmesan-breadcrumb mixture, leaving smaller amount of Parmesan for garnish then mix <b>20 sec\/\/speed 2.5<b>. Transfer to a bowl, cover with cling film and place in fridge."},{"isHeader":true,"content":"Assembly"},{"content":"Divide rested pasta dough into two pieces, then pass each piece through a pasta machine several times, gradually reducing the thickness until you reach the thinnest setting. Alternatively roll dough out on a floured surface using a rolling pin until as thin as possible (1 mm)."},{"content":"Fold over in half lengthwise, then unfold. In centre of the bottom half, below crease line, dot heaped teaspoons of filling at approx. 8 cm intervals."},{"content":"Brush round each mound of filling with a wet pastry brush, then fold top half of dough over filling and press down lightly with your fingers in between each mound to squeeze out excess air. Using a fluted pastry wheel or cutter, cut out ravioli in between each dollop of stuffing to make squares (approx. 6 cm) then set aside until ready to cook."},{"isHeader":true,"content":"Cooking"},{"content":"Bring a large pan of salted water to the boil. Gently lower ravioli in and cook for 5-6 minutes then remove with a slotted spoon. Serve hot with reserved grated Parmesan."}],"hintsAndTricks":["Homemade ravioli is a real treat and this version, with an elegant filling of prawns and asparagus, creates an impressive starter or main course. Works well served with a dressed rocket salad."],"basicInfo":["medium","1h","2h 30m","4 portions"]}