{"badges":["TM31","TM5","TM6"],"usefulItems":"roasting tin, cling film, piping bag, pastry brush, large bowl, oven","id":"r88369","imageLink":"https:\/\/3.bp.blogspot.com\/-TT4cM88YZr0\/XZWrIBzKepI\/AAAAAAAAfic\/AhxAWRUvIVYI8kEqhd-mou6jGqI5rgTKgCLcBGAsYHQ\/s1600\/0_caSJgqilowoIgdGs.png","title":"Hot Cross Buns","publishedAt":"2016-02-29T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Dough"},{"content":"60 g unsalted butter, diced, plus extra for greasing"},{"content":"300 g milk"},{"content":"600 g strong white bread flour, plus extra for dusting"},{"content":"50 g sugar"},{"content":"2 tsp dried instant yeast"},{"content":"2 tsp ground cinnamon"},{"content":"1 tsp ground mixed spice"},{"content":"½ tsp ground nutmeg"},{"content":"1 tsp fine sea salt"},{"content":"1 large egg"},{"content":"70 g raisins"},{"content":"70 g sultanas"},{"content":"40 g chopped mixed peel"},{"isHeader":true,"content":"Paste"},{"content":"40 g strong white bread flour"},{"content":"20 g granulated sugar"},{"content":"50 g water"},{"isHeader":true,"content":"Glaze"},{"content":"25 g light brown sugar"},{"content":"45 g milk"},{"content":"1 Tbsp orange marmalade"}],"nutrition":{"protein":"7 g","fat":"5 g","uom":"per 1 piece","carbohydrates":"43 g","calories":"998 kJ \/ 238 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Dough"},{"content":"Grease a large bowl and roasting tin."},{"content":"Place butter and milk in mixing bowl then heat <b>2 min\/40°C\/speed 1.5<b>."},{"content":"Add flour, sugar, yeast, cinnamon, mixed spice, nutmeg, salt and egg. Mix <b>20 sec\/speed 4<b> then knead <b>3 min\/<b>."},{"content":"Add raisins, sultanas and mixed peel then knead <b>1 min\/<b>. Tip out onto a lightly-floured surface and finish incorporating fruit and peel into dough by hand until evenly distributed. Transfer to prepared bowl, cover with cling film and leave in a warm place to rise until doubled in size (2-3 hours)."},{"content":"Gently knock back dough, divide into 16 equal-sized pieces and shape into balls, then place in prepared roasting tin, 2 cm apart. Cover with greased cling film and leave to rise again until doubled in size (approx. 1 hour). Meanwhile, prepare paste."},{"isHeader":true,"content":"Paste"},{"content":"Place a bowl on mixing bowl lid and weigh in flour, sugar and water. Mix by hand until smooth then transfer to a small piping bag (see tip)."},{"content":"Preheat oven to 210°C. When buns are risen, snip corner off piping bag and pipe crosses on top of each bun. Bake for 20 minutes (210°C). Meanwhile, clean mixing bowl and prepare glaze."},{"isHeader":true,"content":"Glaze"},{"content":"Place sugar, milk and marmalade in mixing bowl then mix <b>1 min\/80°C\/speed 5<b>. As soon as buns are removed from oven, brush tops with glaze. Leave to cool in tin then serve slightly warm or cool."}],"hintsAndTricks":["These fruity, sticky delights will be enjoyed by all at Easter. For more Easter inspiration, take a look at Cookidoo and let Thermomix help you prepare for even the largest family get-together.","If you do not have a piping bag, you can use a freezer bag with the corner snipped off.","Serve with lots of butter. Also delicious toasted the next day."],"basicInfo":["medium","30m","3h 50m","16 pieces"]}