{"badges":["TM5","TM6"],"usefulItems":"baking tray (20 x 30 cm), baking paper, sealable storage jar or container, baking tray (30 x 40 cm), serving platter, refrigerator, oven","id":"r89824","imageLink":"https:\/\/2.bp.blogspot.com\/-gepYHGTokro\/XZWZteQsrgI\/AAAAAAAAeRQ\/DvH6P7xb3oY9T9RxQDoNbxBKnNDjxMv_wCLcBGAsYHQ\/s1600\/0_k5bpz9cIu_NNn7rD.png","title":"Smashed roasted potatoes with rosemary salt","publishedAt":"2015-12-14T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Rosemary salt"},{"content":"10 sprigs fresh rosemary, leaves only"},{"content":"250 g sea salt"},{"isHeader":true,"content":"Potatoes"},{"content":"700 g water"},{"content":"1000 g small potatoes"},{"content":"1 - 2 tbsp olive oil, plus extra to serve"},{"content":"2 sprigs fresh rosemary, leaves only"}],"nutrition":{"protein":"4 g","fat":"6 g","uom":"per 1 portion","carbohydrates":"21 g","calories":"676 kJ \/ 161 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Rosemary salt"},{"content":"Line a baking tray (20 x 30 cm) with baking paper and set aside."},{"content":"Place rosemary into mixing bowl and mill <b>1 min\/speed 9<b>."},{"content":"Add salt into mixing bowl and chop <b>2 sec\/speed 7<b>. Transfer salt onto prepared baking tray and spread out evenly, then leave to dry out overnight. Transfer salt into a sealable jar or container to store and use as needed."},{"isHeader":true,"content":"Potatoes"},{"content":"Line a baking tray (30 x 40 cm) with baking paper and set aside."},{"content":"Place water into mixing bowl. Place Varoma into position, then weigh potatoes into it. Secure Varoma lid and steam <b>25-30 min\/Varoma\/speed 1<b>, or until potatoes are cooked (see tips)."},{"content":"Preheat oven to 200°C. Transfer potatoes onto prepared baking tray, then place into refrigerator to cool and dry out for 30 minutes."},{"content":"Using a fork, flatten the potatoes onto baking tray slightly. Drizzle with olive oil, then sprinkle with 1 teaspoon of the reserved rosemary salt and fresh rosemary leaves. Roast for 25-30 minutes (200°C) or until brown and crispy."},{"content":"Transfer potatoes onto a serving platter. Drizzle with a little extra olive oil, sprinkle with extra rosemary salt and serve immediately."}],"hintsAndTricks":["In step 5, potatoes should be cooked through but still firm enough that a knife can pass easily through without mashing.","Rosemary salt can be made in advance and stored in a cool, dry place in a sealable storage container until needed."],"basicInfo":["easy","15m","25h 30m","6 portions"]}