{"badges":["TM5","TM6"],"usefulItems":"pastry brush, rolling pin, 2 baking trays (40 x 35 cm), baking paper, ceramic or glass bowl, silicone bread mat, plastic wrap, sealable container, wire rack, oven","id":"r90083","imageLink":"https:\/\/2.bp.blogspot.com\/-Ey_7FbUKjH8\/XZavGQU54hI\/AAAAAAAAhrU\/VaLmi6kbyOgAbpGJR7jMNBvYHRKcVhF7wCLcBGAsYHQ\/s1600\/0_gmtKJf_Ho4OE5X7E.png","title":"Olive and fennel grissini","publishedAt":"2015-12-14T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Olive and fennel"},{"content":"1 tsp fennel seeds"},{"content":"150 g pitted Kalamata olives, drained"},{"isHeader":true,"content":"Grissini"},{"content":"500 g baker's flour, plus extra for dusting"},{"content":"1 pinch caster sugar"},{"content":"20 g fresh yeast"},{"content":"2 tsp sea salt, plus extra for sprinkling"},{"content":"70 g poppy seeds"},{"content":"50 g sesame seeds"},{"content":"80 g extra virgin olive oil, plus extra for brushing and greasing"},{"content":"300 g water, warm"}],"nutrition":{"protein":"3.5 g","fat":"7.5 g","uom":"per 1 piece","carbohydrates":"15.6 g","calories":"617 kJ \/ 147 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Olive and fennel"},{"content":"Place fennels seeds into mixing bowl and mill <b>10 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula, then repeat milling <b>10 sec\/speed 9<b>, or until a fine consistency is achieved."},{"content":"Add olives and chop <b>5 sec\/speed 6<b>. Scrape down sides of mixing bowl with spatula, then repeat chopping <b>5 sec\/speed 6<b>, until a coarse paste consistency is achieved. Transfer into a bowl and set aside. Clean and dry mixing bowl."},{"isHeader":true,"content":"Grissini"},{"content":"Place all grissini ingredients into mixing bowl and mix <b>6 sec\/speed 6<b>, then knead <b>2 min\/<b>."},{"content":"Transfer dough onto a heavily floured silicone bread mat or work surface and work into a ball. Wrap dough in silicone bread mat or place into a lightly greased ceramic or glass bowl and cover with plastic wrap. Leave to prove in a warm place until doubled in size (approx. 1 hour)."},{"content":"Preheat oven to 180°C. Line 2 baking trays (40 x 35 cm) with baking paper and set aside."},{"content":"Transfer proved dough onto a silicone bread mat or lightly floured work surface, then gently flatten dough and roll into a rectangle (approx. 50 x 30 cm)."},{"content":"Spread reserved olive and fennel paste over dough, then season to preference with extra salt."},{"content":"Fold dough in half along the vertical axis to form a 25 x 30 cm rectangle, enclosing the paste. Cut the folded dough horizontally into 3 evenly-sized pieces, then cut each piece horizontally into 8 evenly-sized strips. Stretch each strip to approx. 35 cm in length, then twist several times."},{"content":"Place twists onto prepared baking trays and brush with extra olive oil. Bake for 20-25 minutes (180°C) or until golden, then transfer to a wire rack to cool. Depending on the size of your baking trays, you may need to bake grissini in batches."},{"content":"Turn off your oven, then when all grissini have finished baking, transfer back onto baking trays and place back into the oven to dry out and cool completely for a few hours or overnight. Serve immediately or transfer into a sealable container until ready to use."}],"hintsAndTricks":["Grissini make a fantastic addition to a festive nibbles platter or cheese board. Try serving with the <em>Baked artichoke dip<\/em>."],"basicInfo":["medium","30m","25h 30m","24 pieces"]}