{"badges":["TM5","TM6"],"usefulItems":"large salad bowl, refrigerator","id":"r90173","imageLink":"https:\/\/4.bp.blogspot.com\/-NkLroESOcU0\/XZMt-tm6XFI\/AAAAAAAAZ_s\/pJsCPEdZrtojo7vGG0wnkEu94WO8v5YUwCLcBGAsYHQ\/s1600\/0_5PDIe_ydTMeUtQBN.png","title":"Russian beetroot salad","publishedAt":"2017-07-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"150 g pickled gherkins, cut in pieces (3-4 cm)"},{"content":"150 g carrots, cut in pieces (3-4 cm)"},{"content":"350 g raw beetroot, cut in pieces (3-4 cm)"},{"content":"500 g water"},{"content":"250 g potatoes, cut in small pieces (approx. 1 cm)"},{"content":"100 g frozen green peas"},{"content":"100 g canned sauerkraut              (optional)"},{"content":"50 g spring onions, finely sliced"},{"content":"2 - 3 sprigs fresh dill, plus extra to garnish"},{"content":"60 g oil"},{"content":"20 g white wine vinegar              (optional)"},{"content":"1 tsp salt"}],"nutrition":{"protein":"3 g","fat":"8 g","uom":"per 1 portion","carbohydrates":"13 g","calories":"583 kJ \/ 139 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place gherkins in mixing bowl and chop <b>4 sec\/speed 4<b>. Transfer to a large salad bowl and set aside."},{"content":"Place carrots in mixing bowl and chop <b>5 sec\/speed 4.5<b> (pieces should be no larger than 1 cm). Transfer to Varoma tray and set aside."},{"content":"Place beetroot in mixing bowl and chop <b>5 sec\/speed 4.5<b>. Transfer to simmering basket."},{"content":"Place water in mixing bowl and insert simmering basket. Set Varoma dish in position and add potatoes and frozen peas to it. Insert Varoma tray and close with Varoma lid, then steam <b>27 min\/Varoma\/speed 1<b>."},{"content":"Remove Varoma and set Varoma dish and tray aside separately to cool (approx. 20 minutes). Remove simmering basket using spatula and set aside on a deep plate to drain and cool (see tip). Meanwhile, discard cooking water, place salad bowl with gherkins on mixing bowl lid and weigh in sauerkraut and sliced spring onions."},{"content":"Add vegetables from Varoma and simmering basket to salad bowl and set serving bowl aside."},{"content":"Place dill, oil, vinegar and salt in mixing bowl and mix <b>30 sec\/speed 6<b>. Transfer to salad bowl, stir to coat all vegetables with dressing, adjust seasoning to taste and serve garnished with extra chopped fresh dill, or chill to serve later."}],"hintsAndTricks":["Made with beets and vinaigrette, this recipe is traditional yet nonetheless a departure from the well-known creamy version of “Russian salad” (see variations). Cooking several ingredients at the same time using the different levels of the Thermomix is a great time-saver and makes this festive salad a dish that can be enjoyed even on a weekday.","In <b>step 5,<b> if you are in a hurry to cool the vegetables, run cold water over each vegetable separately while they are still in the Varoma dish, Varoma tray and simmering basket.","For a traditional Russian flavour, omit the vinegar.","For a creamy pink version of the salad, instead of making the vinaigrette in <b>step 7,<b> dress the cooled vegetables with sour cream or mayonnaise (quantity to taste), stir gently to combine, season to taste and garnish with chopped dill.","Replace frozen green peas with canned green peas, well drained. Omit steaming in <b>step 4<b> and add peas to the salad in <b>step 5.<b>"],"basicInfo":["easy","20m","1h 10m","8 portions"]}