{"badges":["TM5","TM6"],"usefulItems":"large salad bowl","id":"r90165","imageLink":"https:\/\/2.bp.blogspot.com\/-U876sZ8qf-k\/XZMudMNx2II\/AAAAAAAAaFc\/sNN9pSAySDUAZ5Hbe3_tp4o5IsjnO9XSgCLcBGAsYHQ\/s1600\/0_IOVi48_l8kRYJnwy.png","title":"Salmon, quinoa, feta and mixed vegetable salad","publishedAt":"2017-07-18T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"½ lemon, preferably organic, zest only"},{"content":"10 - 12 sprigs mixed fresh herbs (e.g. parsley, basil, chives), leaves only"},{"content":"1 garlic clove"},{"content":"½ fresh chilli"},{"content":"60 g olive oil"},{"content":"1200 g water"},{"content":"1 ½ tsp salt"},{"content":"100 g quinoa"},{"content":"600 g fresh salmon fillets, skinless (2 cm thick)"},{"content":"160 g peppers, cut in pieces"},{"content":"50 g red onions, cut in pieces"},{"content":"120 g cucumber, cut in pieces"},{"content":"150 g feta cheese, cut in pieces"},{"content":"1 tsp Dijon mustard"},{"content":"1 tbsp vinegar"},{"content":"2 pinches ground black pepper"},{"content":"300 g plum tomatoes, cut in pieces (2 cm)"},{"content":"1 avocado, flesh only (150-200 g), sliced"},{"content":"100 g kale, thinly sliced,"},{"content":"1 tbsp pumpkin seeds              (optional)"},{"content":"2 tbsp dried cranberries              (optional)"}],"nutrition":{"protein":"29 g","fat":"37 g","uom":"per 1 portion","carbohydrates":"19 g","calories":"2238 kJ \/ 534 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place lemon zest and 2-3 sprigs mixed fresh herbs, leaves only, in mixing bowl and chop <b>7 sec\/speed 9<b>. Transfer to a bowl and set aside."},{"content":"Place garlic clove, chilli and 30 g olive oil in mixing bowl, chop <b>3 sec\/speed 7<b>, then sauté without measuring cup <b>2 min\/120°C\/speed 1<b>. Transfer to bowl containing lemon-parsley mixture and set aside."},{"content":"Without rinsing mixing bowl, place water and 1 tsp salt in it. Insert simmering basket, add quinoa to it and stir using spatula to wet all the grains. Set Varoma dish and tray in position. Place salmon fillets on Varoma tray. Sprinkle fillets with reserved lemon-parsley-garlic mixture, close Varoma and cook <b>20 min\/Varoma\/speed 1<b>. Carefully open Varoma to check that salmon is cooked. If necessary, cook a further <b>2-5 min\/Varoma\/speed 1<b>. Set Varoma aside uncovered and allow salmon to cool. Remove simmering basket using spatula, transfer quinoa to a large salad bowl and allow to cool. Clean and dry mixing bowl."},{"content":"Place peppers, onions, cucumber, 100 g feta cheese, remaining fresh herbs, Dijon mustard, vinegar, remaining 30 g oil, ½ tsp salt and ground black pepper in mixing bowl and chop <b>5 sec\/speed 4<b>. Scrape down sides of mixing bowl using spatula."},{"content":"Add tomatoes and avocado and combine <b>10 sec\/\/speed 2<b>. Transfer to salad bowl containing cooked quinoa. Using spatula, break steamed salmon into chunks, then add to salad. Add sliced kale and gently toss to combine. Sprinkle with pumpkin seeds, dried cranberries and remaining 50 g feta. Serve cold."}],"hintsAndTricks":["A fantastic complete meal, packed with nutrients and the flavours of summer. Be a good friend by taking this salad to a party or picnic for the enjoyment and the good of everyone who tastes it."],"basicInfo":["medium","30m","50m","6 portions"]}