{"badges":["TM5","TM6"],"usefulItems":"ceramic or glass bowl, plastic wrap, baking tray (20 x 30 cm), baking paper, silicone bread mat, rolling pin, kitchen towel, pastry brush, aluminium foil, oven","id":"r91083","imageLink":"https:\/\/3.bp.blogspot.com\/-eF_b9WnPpcY\/XZan-GjoiTI\/AAAAAAAAhFs\/rqYAu9edaaEkbsw9v2Qt72udcorEQ4DUgCLcBGAsYHQ\/s1600\/0_aWf-5EbMkIu4DPw_.png","title":"Christmas stollen","publishedAt":"2015-12-14T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Stollen"},{"content":"80 g mixed dried fruit"},{"content":"40 g raisins"},{"content":"40 g currants"},{"content":"80 g rum"},{"content":"½ lemon, zest only, no white pith"},{"content":"80 g butter, softened"},{"content":"70 g caster sugar"},{"content":"90 g full cream milk"},{"content":"60 g water"},{"content":"1 egg"},{"content":"1 egg yolk"},{"content":"30 g fresh yeast"},{"content":"1 tsp natural almond extract"},{"content":"550 g plain flour, plus 2 tbsp extra to dredge fruit"},{"content":"20 g flaked almonds"},{"isHeader":true,"content":"Glaze"},{"content":"180 g icing sugar"},{"content":"20 - 40 g lemon juice"}],"nutrition":{"protein":"7.3 g","fat":"8.5 g","uom":"per 1 slice","carbohydrates":"67 g","calories":"1625 kJ \/ 387 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Stollen"},{"content":"Place a ceramic or glass bowl onto mixing bowl lid, then weigh mixed dried fruit, raisins, currants and 60 g of the rum or brandy into it. Set fruit aside to soak for a minimum 1 hour or overnight."},{"content":"Place lemon zest into mixing bowl and grate <b>10 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula, then repeat grating <b>10 sec\/speed 9<b>. Transfer into ceramic or glass bowl with the dried fruit."},{"content":"Place 60 g of the butter into mixing bowl and melt <b>2 min\/50°C\/speed 2<b>."},{"content":"Add sugar, milk and water and heat <b>2 min\/60°C\/speed 2<b>."},{"content":"Add egg, egg yolk, yeast, almond extract, flour and remaining 20 g of the rum or brandy and mix <b>6 sec\/speed 6<b>, then knead <b>1 min 30 sec\/<b>."},{"content":"Add a little extra flour if dough appears too sticky. Transfer dough into a well-floured ceramic or glass bowl and cover with plastic wrap. Leave to prove in a warm place until doubled in size (approx. 1 hour). Clean and dry mixing bowl."},{"content":"Line a baking tray (20 x 30 cm) with baking paper and set aside."},{"content":"Add flaked almonds to ceramic or glass bowl with the fruit, then drain off rum or brandy. Sprinkle 2 tbsp extra plain flour over fruit and stir to combine with spatula. This allows the flour to dredge the fruit (take up excess liquid)."},{"content":"Transfer proved dough onto a silicone bread mat or floured work surface and briefly knead in dredged fruit mixture."},{"content":"Roll dough into an oval (28 x 10 cm), then take one side of the oval and fold over so that it extends just past the middle. Take the other side of the oval and fold so it overlaps the first."},{"content":"Place dough onto prepared baking tray, then cover with a kitchen towel and leave to prove in a warm place until doubled in size (approx. 1 hour)."},{"content":"Preheat oven to 180°C. Place remaining 20 g of the butter into mixing bowl and melt <b>1 min\/50°C\/speed 1<b>. Brush melted butter over proved stollen on baking tray. Clean and dry mixing bowl."},{"content":"Bake for 10 minutes (180°C), then reduce oven temperature to 160°C and bake for a further 20-30 minutes (160°C), until Stollen sounds hollow when tapped on the underside. Cover with aluminium foil if the Stollen is browning too quickly. Set aside to cool completely."},{"isHeader":true,"content":"Glaze"},{"content":"Place icing sugar into mixing bowl and mill <b>10 sec\/speed 10<b>."},{"content":"Add lemon juice and cook <b>1 min\/100°C\/speed 1<b>. Scrape down sides of mixing bowl with spatula, then mix <b>10 sec\/speed 2<b>. Pour sugar glaze over the top of cooled Stollen, then slice and serve."}],"basicInfo":["easy","20m","2h 20m","12 slices"]}