{"badges":["TM5","TM6"],"usefulItems":"large serving bowl","id":"r91195","imageLink":"https:\/\/2.bp.blogspot.com\/-sBMTFS7AcEI\/XZMyCmRgjfI\/AAAAAAAAafw\/a5SpPKQLf1cLYKKM2njEKIGnopc_pJLVQCLcBGAsYHQ\/s1600\/0_30Xy98zggG3cCzDY.png","title":"Pasta Salad with Trout and Vegetables","publishedAt":"2017-03-24T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"36 oz water"},{"content":"7 oz white wine"},{"content":"3 ½ oz freshly squeezed orange juice,"},{"content":"1 ½ tsp salt"},{"content":"14 oz skinless trout fillets,"},{"content":"7 oz frozen green peas"},{"content":"8 ½ oz fidelini (thin short dried pasta for soups) (e.g. mezze, penne rigate), 10 minutes cooking time"},{"content":"1 oz extra virgin olive oil, plus 1 tbsp"},{"content":"1 garlic clove"},{"content":"1 oz capers, rinsed"},{"content":"3 oz pitted black olives,"},{"content":"13 oz cherry tomatoes, quartered or halved"},{"content":"1 pinch ground black pepper              (optional)"},{"content":"½ oz lemon juice              (optional)"}],"nutrition":{"protein":"21 g","fat":"12 g","uom":"per 1 portion","carbohydrates":"35 g","calories":"1463 kJ \/ 349 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place water, wine, orange juice and salt into mixing bowl. Place trout into Varoma dish and frozen green peas onto Varoma tray. Place Varoma into position, secure Varoma lid and steam <b>12 min\/Varoma\/speed 1<b>. Set Varoma aside."},{"content":"Add pasta through hole in mixing bowl lid, return Varoma to position, secure Varoma lid and cook <b>10 min\/Varoma\/\/speed 1<b>. Set Varoma aside and drain pasta through simmering basket, briefly rinse pasta under cold water to stop cooking. Place pasta into a serving bowl and stir in 1 tbsp olive oil."},{"content":"Without cleaning mixing bowl, place garlic clove and 1 oz olive oil into mixing bowl and sauté <b>3 min\/250°F\/speed 1<b>. Remove garlic clove if desired."},{"content":"Add steamed trout fillets, steamed peas, capers and black olives and cook <b>3 min\/212°F\/\/speed 1<b>. Transfer onto pasta, add cherry tomatoes and combine. Season to taste with black pepper and lemon juice and serve at room temperature or chilled."}],"hintsAndTricks":["If frozen green peas are not available, they can be replaced with canned green peas, drained: add them into the serving bowl with pasta and 1 tbsp olive oil.","Garnish with chopped parsley, to taste.","Trout can also be replaced with swordfish fillets. Depending on the quality and type of fish, steaming time can be adjusted as needed.","For larger fish pieces: don’t add fish into the mixing bowl. Instead, cut fish into pieces and gently combine into the salad with the spatula.","For stronger garlic flavor: rather than removing the garlic clove, chop it <b>5 sec\/speed 6<b> before sautéing."],"basicInfo":["easy","20m","45m","6 portions"]}