{"badges":["TM5","TM6"],"usefulItems":"airtight jars or containers, blanket, refrigerator","id":"r91190","imageLink":"https:\/\/2.bp.blogspot.com\/-CYEqY8ceWXU\/XZaqsiwxIfI\/AAAAAAAAhfs\/GYlAzpFGbRIgQeoMLmYv80GNAqYotqYeACLcBGAsYHQ\/s1600\/0_jNlFNlsDV-Lw6Rrl.png","title":"Plain Yogurt","publishedAt":"2017-03-24T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"35 oz whole milk"},{"content":"4 ½ oz plain yogurt, min. 1.8% fat"},{"content":"2 oz powdered milk              (optional)"}],"nutrition":{"protein":"5 g","fat":"5 g","uom":"per 1 jar","carbohydrates":"7 g","calories":"370 kJ \/ 89 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place milk, yogurt and powdered milk into mixing bowl and warm <b>6 min\/120°F\/speed 3<b>. Transfer yogurt mixture into 8 airtight jars or small containers and wrap immediately in a blanket to keep warm. Leave jars well wrapped for 11-13 hours in a warm place (see Tip), without moving them during this incubation period. Chill in refrigerator for at least 3 hours before serving."}],"hintsAndTricks":["Keeping the yogurt warm and undisturbed during incubation is essential to achieving the right texture. To increase insulation you can place wrapped jars in a picnic cooler. A hot water bottle can be used to pre warm the cooler before adding the wrapped yogurt.","The cooler the room temperature, the longer the yogurt should be left to incubate. In very warm environments, 8-10 hours may be sufficient.","The longer the incubation time, the more acidic the yogurt.","For best results, make sure all utensils are very clean before making yogurt.","Avoid using low-fat milk or low-fat yogurt for this recipe.","Powdered milk helps the yogurt to set.","If using raw milk, heat milk <b>10 min\/195°F\/speed 2<b>,<b> and allow the milk to cool to room temperature before starting the recipe.","The heating and cooling process described for raw milk can also be used with pasteurized milk to produce a thicker consistency","Remember to reserve some plain yogurt as a starting culture for the next batch.","For sweetened yogurt, add <b>3 tbsp sugar<b> along with the other ingredients.","For creamy yogurt, add 3.5 oz cream along with the other ingredients."],"basicInfo":["easy","10m","14h","8 jars"]}