{"badges":["TM5","TM6"],"usefulItems":"parchment paper, baking sheet (approx. 16 in. x 14 in.), baking pan, cling wrap or damp kitchen towel, oven","id":"r91216","imageLink":"https:\/\/4.bp.blogspot.com\/-_END0C1hWGw\/XZau-3YtuEI\/AAAAAAAAhpo\/R5T-3pGx9To6DOrJDJ8611CKQcvsJJ56QCLcBGAsYHQ\/s1600\/0_R0B1pGyDvUkAPoY-.png","title":"Baguette","publishedAt":"2017-03-24T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"12 oz water"},{"content":"½ oz fresh yeast, crumbled"},{"content":"oil, to grease"},{"content":"18 oz bread flour, plus extra to dust"},{"content":"1 ½ tsp salt"},{"content":"3 ½ oz hot water"}],"nutrition":{"protein":"2 g","fat":"0 g","uom":"per 1 slice","carbohydrates":"13 g","calories":"268 kJ \/ 64 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place water and yeast into mixing bowl and warm <b>2 min\/100°F\/speed 2<b>. Meanwhile, lightly grease a large bowl and set aside."},{"content":"Add flour and salt and knead <b>2 min\/<b>. Transfer dough into prepared bowl. Cover bowl with cling wrap or a damp kitchen towel and let rise until doubled in size (approx. 1½ hr.)."},{"content":"On a lightly floured surface, use a large knife to separate dough into three equal pieces. Gently flatten and roll each piece loosely into a log shape and set aside on a lightly floured surface. Dust rolls lightly with flour, cover loosely with cling wrap or a damp kitchen towel and allow to rest for 20 minutes."},{"content":"Again, gently flatten each piece of dough into a rectangle, taking care to preserve the air bubbles trapped within. Roll dough again into a log shape. Pinch seam of roll with your fingers to seal. Elongate roll into a baguette shape, rolling back and forth exerting gentle pressure from the middle of the baguette to its ends. Place baguettes seam-side down onto parchment paper, pulling up paper between each to create low separating walls. This will help baguettes to hold their shape and will prevent them from sticking to each other as they rise. Cover baguettes loosely with cling wrap or a damp kitchen towel (tea towel) and let rise for a further 45 minutes."},{"content":"Twenty minutes before end of rising time, place 1 baking sheet (approx. 16 in. x 14 in.) and 1 baking pan into lower part of oven, the pan on the lowest rung, the sheet on a rung above. Preheat oven to 480°F."},{"content":"Prepare approximately 3.5 oz very hot water in a cup and set aside. Slash baguettes with a very sharp knife, making three overlapping slashes along the length of each bread. Slide parchment together with baguettes onto the top preheated baking sheet. Quickly but also <b>carefully<b> pour the reserved hot water onto the lower baking pan to create steam and immediately close oven door to trap the steam. Bake for 20 minutes (480°F), or until dark golden brown. If baguettes seem quite brown before end of baking time, reduce oven temperature to 450°F. Allow baguettes to cool for 20 minutes before slicing."}],"hintsAndTricks":["To test if baguettes are ready to bake: gently press dough with your fingertip. The indentation left by your finger should slowly disappear. If the dough springs up quickly then it has not risen sufficiently. If the indentation remains, the dough has over-proofed. The baguettes won’t rise as much in the oven but they will still taste good.","Creating the burst of steam at the beginning of baking gives the baguettes their crisp, golden crust. Be very careful not to splash yourself or any glass elements in your oven. You may omit the steam if desired.","Baguettes are always best eaten freshly baked.","Baguettes develop more flavor if you chill the dough overnight in the refrigerator. After the dough's first rise, gently fold dough over itself to deflate it, cover the bowl with cling wrap and store in the refrigerator. The next day proceed with recipe. The baguettes may need <b>10-20 minutes<b> longer to rise before baking.","If living at high altitude let dough rise longer than recipe suggests. A mesh pop up food cover can be placed over bread dough for the second rise. Place hot, wet tea towels laid over top and sides of mesh food cover to stop dough from drying out while rising."],"basicInfo":["advanced","30m","3h 45m","30 slices"]}