{"badges":["TM5","TM6"],"id":"r91203","imageLink":"https:\/\/2.bp.blogspot.com\/-1-FXisd8d_k\/XZVP21J7gLI\/AAAAAAAAc9c\/GeBZ604Wk4A_GfeE8g2QGSZAgYA9f_VNQCLcBGAsYHQ\/s1600\/0_GRdJZnJd00bJzWhR.png","title":"Cod with Citrus Butter","publishedAt":"2017-03-24T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"1 orange, thin peel only, no pith, plus juice (approx. 2.5 oz)"},{"content":"1 lemon, thin peel only, no pith, plus juice (approx. 2.5 oz)"},{"content":"1 tsp anise seeds"},{"content":"½ tsp salt, to taste"},{"content":"½ tsp ground black pepper, to taste"},{"content":"25 oz water,"},{"content":"14 oz potatoes, cut into pieces"},{"content":"4 cod fillets, (4-7 oz each, max of 28 oz)"},{"content":"3 oz unsalted butter, plus extra to grease"},{"content":"14 oz zucchini, sliced (¼ in.)"},{"content":"3 sprigs fresh parsley, leaves only, chopped"}],"nutrition":{"protein":"32 g","fat":"20 g","uom":"per 1 portion","carbohydrates":"21 g","calories":"1716 kJ \/ 411 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place orange peel, lemon peel, anise seeds, salt and pepper into mixing bowl and zest <b>15 sec\/speed 9<b>. Scrape down sides of mixing bowl with spatula and zest a further <b>15 sec\/speed 9<b>. Transfer to a large bowl and set aside."},{"content":"Place water into mixing bowl, insert simmering basket and weigh in potatoes."},{"content":"Lightly grease Varoma tray. Season both sides of cod fillets with ¼ of the reserved chopped zest. Place fish onto Varoma tray, set Varoma dish  into position and insert Varoma tray, secure Varoma lid and steam <b>15 min\/Varoma\/speed 1<b>."},{"content":"Remove Varoma tray. Weigh zucchini into Varoma dish. Insert Varoma tray, turn fish over, secure Varoma lid and steam a further <b>10 min\/Varoma\/speed 1<b>."},{"content":"Remove Varoma. Remove simmering basket with spatula. Transfer steamed zucchini, fish and potatoes onto a large dish, set aside and keep warm. Empty mixing bowl."},{"content":"Place butter and remaining citrus zest into mixing bowl and heat <b>4 min\/140°F\/speed 1<b>."},{"content":"Add orange and lemon juice into mixing bowl and mix <b>30 sec\/speed 3<b>. Place cod, zucchini and potatoes onto plates. Pour warm citrus butter over meal, sprinkle with parsley and serve immediately."}],"basicInfo":["easy","25m","50m","4 portions"]}