{"badges":["TM5","TM6"],"usefulItems":"cling wrap, rolling pin, parchment paper, baking weights (e.g. dried beans), pie pan (approx. 10 in.), wire rack, refrigerator, oven, freezer","id":"r91304","imageLink":"https:\/\/4.bp.blogspot.com\/-siix8zk2M4c\/XZWrkqzBNGI\/AAAAAAAAfpQ\/ZF2xA_SSrKcZiYp1Up6ZM6HB_vq2v2DgwCLcBGAsYHQ\/s1600\/0_pWUE_r6OdFC3P7pz.png","title":"Lemon Meringue Pie","publishedAt":"2017-03-24T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"isHeader":true,"content":"Pastry"},{"content":"3 ½ oz sugar"},{"content":"1 oz almonds"},{"content":"7 oz unsalted butter, cut into pieces, plus extra to grease"},{"content":"12 oz all-purpose flour"},{"content":"1 large egg"},{"content":"1 pinch salt"},{"content":"1 ½ tsp homemade vanilla sugar"},{"isHeader":true,"content":"Lemon Filling"},{"content":"5 ½ oz sugar"},{"content":"3 - 5 lemons, preferably organic, zest (1 lemon) and (4.5 oz) juice"},{"content":"1 large egg"},{"content":"4 egg yolks, from large eggs"},{"content":"3 ½ oz unsalted butter, cut into pieces"},{"isHeader":true,"content":"Meringue Topping"},{"content":"5 ½ oz sugar"},{"content":"4 egg whites, from large eggs"},{"content":"1 pinch salt"}],"nutrition":{"protein":"8 g","fat":"26 g","uom":"per 1 slice","carbohydrates":"62 g","calories":"2178 kJ \/ 520 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"isHeader":true,"content":"Pastry"},{"content":"Place sugar into mixing bowl and grind <b>15 sec\/speed 10<b>."},{"content":"Add almonds and grind <b>10 sec\/speed 10<b>."},{"content":"Add 7 oz butter, flour, egg, salt and vanilla sugar and mix with aid of spatula <b>25-30 sec\/speed 5<b>. Remove pastry dough from mixing bowl, form into a flattened ball and wrap in cling wrap. Refrigerate for 1 hour."},{"content":"Preheat oven to 350°F. Grease a pie pan (approx. 10 in.) and set aside."},{"content":"Roll out half the pie dough (reserve the rest for another recipe or freeze) between 2 sheets of parchment to a thickness of ¼ inch, working quickly and handling the dough as little as possible to keep it chilled and easy to work with. Line prepared pie pan with dough and prick dough with a fork to avoid air bubbles. Line dough with parchment and baking weights and blind bake for 15 minutes (350°F). Remove parchment and weights and bake 5-10 minutes or until golden brown."},{"isHeader":true,"content":"Lemon Filling"},{"content":"Reduce oven temperature to 325°F."},{"content":"Place sugar and zest of 1 lemon into mixing bowl and grind <b>20 sec\/speed 10<b>."},{"content":"Add egg, egg yolks and 4.5 oz lemon juice and heat <b>12 min\/160°F\/speed 3<b>."},{"content":"Add butter and mix <b>10 sec\/speed 4<b>. Pour mixture into par-baked pie shell and distribute evenly with spatula. Bake for 10 minutes (325°F). Meanwhile clean and dry mixing bowl thoroughly and proceed with next step."},{"isHeader":true,"content":"Meringue Topping"},{"content":"Place sugar into mixing bowl and grind <b>10 sec\/speed 10<b>."},{"content":" <b>Insert butterfly whisk.<b> Add egg whites and salt and whisk <b>5 min\/120°F\/speed 3.5<b> or until stiff. <b>Remove butterfly whisk<b> and spread meringue over hot lemon pie, creating swirls with a spoon or fork and making sure meringue touches all edges of the pastry, leaving no gap between filling and pie crust."},{"content":"Bake for 10 minutes (325°F), or until meringue is lightly browned. Turn off oven and leave door ajar for 30 minutes to 1 hour to allow pie to cool gradually. Allow to cool a further 30 minutes on a cooling rack at room temperature. Serve either at room temperature or chilled."}],"hintsAndTricks":["For a nut-free pastry, omit almonds and use <b>13 oz flour<b> instead of <b>12 oz<b>.","If dough becomes warm and difficult to work with, place rolled out dough, still covered with sheets of parchment or cling wrap, into refrigerator until dough is firm enough to handle.","Instead of rolling out dough with a rolling pin, shape it into a log. Wrap log in cling wrap and refrigerate until firm enough to slice. For round cookies: cut log into slices (¼ in. thick) and bake as directed by the recipe. For a pie crust: make a flatter log. Line the pie pan with long dough slices (¼ in. thick), overlapping them slightly and press dough with fingers to fill in any cracks. Bake as directed by the recipe.","Spreading the meringue over the hot filling and allowing it to cool gradually in the turned-off oven helps prevent the meringue from shrinking as it cools.","For a crisp pie crust: make sure pie crust is baked thoroughly (golden brown) before filling.","Use extra pastry for another pie crust or for cookies <b>(bake 10–12 minutes<b> at 350°F, or until golden).","<b>Lemon Pie:<b> For a simple lemon pie, add an egg white to the filling when adding egg and egg yolks and omit the meringue topping."],"basicInfo":["advanced","25m","2h 30m","8 slices"]}