{"badges":["TM5","TM6"],"usefulItems":"cling film, large bowl, palette knife, crumpet rings, pastry brush, frying pan, wire rack, hob","id":"r94179","imageLink":"https:\/\/1.bp.blogspot.com\/-VZ8DsiVQq1I\/XZXX_sstIEI\/AAAAAAAAf6M\/dt9EmfTdZGQvliAmmvt6HRbF37b7KAJegCLcBGAsYHQ\/s1600\/0_EptLj6UwzrmVHzvI.png","title":"Crumpets","publishedAt":"2015-12-17T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"1 Tbsp dried instant yeast"},{"content":"100 g water"},{"content":"200 g milk"},{"content":"150 g strong white bread flour"},{"content":"100 g plain flour"},{"content":"1 tsp fine sea salt"},{"content":"½ tsp bicarbonate of soda"},{"content":"50 g water, warm"},{"content":"20 g butter, melted, for frying"}],"nutrition":{"protein":"3.3 g","fat":"2 g","uom":"per 1 piece","carbohydrates":"16.3 g","calories":"402 kJ \/ 96 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Place yeast and water in mixing bowl then heat <b>2 min\/37°C\/speed 2<b>."},{"content":"Add milk, bread flour, plain flour and salt then mix <b>20 sec\/speed 3<b>. Scrape down sides of mixing bowl with spatula then mix again <b>10 sec\/speed 5<b>. Transfer to a large bowl, cover with cling film and set aside in a warm place for 1½ - 2 hours to allow the batter to turn into a mass of bubbles."},{"content":"When risen, add bicarbonate of soda to a small bowl then place bowl on mixing bowl lid and weigh in warm water. Mix together then stir into batter. Cover with cling film and leave in a warm place for a further 30 minutes."},{"content":"Heat a frying pan over a low heat. Brush base of frying pan and insides of four crumpet rings with melted butter. Set rings flat on base of frying pan then gently pour batter into each ring until half full, being careful not to deflate any of the air bubbles. Cook gently until tops are almost dry and covered with holes (approx. 10 minutes). Flip crumpets over and cook for 2 minutes until lightly golden and cooked through."},{"content":"Cool crumpets on a wire rack while continuing to cook remaining mixture. Toast to serve."}],"hintsAndTricks":["There are few snacks more comforting than a hot, buttered crumpet. These soft, fluffy griddled treats with their distinctive bubbly, hole-filled surface soak up whatever topping you choose. We’ve served them with strawberry and raspberry jam."],"basicInfo":["medium","30m","3h","12 pieces"]}