{"badges":["TM5","TM6"],"usefulItems":"casserole dish (28 x 21 cm), bowl, 1 plate, oven","id":"r99023","imageLink":"https:\/\/3.bp.blogspot.com\/-LuDq4s6ft-4\/XZQujaIUFoI\/AAAAAAAAcUg\/0Vtw-dtrq4ckakt1hU_KE6o6q25jIT4XQCLcBGAsYHQ\/s1600\/0_25BM3CSXX_ctIytt.png","title":"Stuffed tomatoes","publishedAt":"2015-08-24T00:00:00Z","ingredients":[{"isHeader":true,"content":"Ingredients"},{"content":"olive oil, for greasing"},{"content":"6 large fresh tomatoes (similar size - see tips)"},{"content":"1 tsp sea salt, plus extra for sprinkling"},{"content":"150 g brown onion, cut into halves"},{"content":"6 sprigs fresh flat-leaf parsley, leaves only"},{"content":"150 g pork loin steak, cut into cubes (2-3 cm)"},{"content":"200 g beef mince"},{"content":"½ tsp ground black pepper"},{"content":"2 tsp dried oregano"}],"nutrition":{"protein":"16.3 g","fat":"6.8 g","uom":"per 1 portion","carbohydrates":"5.7 g","calories":"657 kJ \/ 156 kcal"},"preparations":[{"isHeader":true,"content":"Preparation"},{"content":"Preheat oven to 200°C. Lightly oil a casserole dish (28 x 21 cm) and set aside."},{"content":"Cut the base off the tomatoes slightly so they sit flat, then cut the tops off the tomatoes and reserve the tops to use as lids."},{"content":"Remove the pulp and juice from inside the tomatoes and transfer into a bowl, then set aside. Sprinkle the insides of tomatoes with salt and turn each tomato upside down on a plate to allow excess juice to drain out."},{"content":"Place onion into mixing bowl and chop <b>5 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add parsley, pork and beef and mix <b>8 sec\/speed 5<b>. Scrape down sides of mixing bowl with spatula."},{"content":"Add pepper, oregano, 1 teaspoon of salt and 200 g of the reserved tomato pulp and juice and mix <b>8 sec\/speed 5<b>. Discard any remaining pulp and juice."},{"content":"Stuff reserved tomatoes with pork and beef mixture, then top with tomato lids and place into prepared casserole dish. Bake for 40 mintes (200°C), or until tomatoes are tender and the stuffing is cooked through. Serve hot."}],"hintsAndTricks":["Stuffed tomatoes are a classic French family cuisine.","Ensure you cook the tomatoes with their lids in place to prevent them from drying out.","For a more substantial dish, serve stuffed tomatoes with fresh pasta or rice.","8 tomatoes will be needed to be purchased if large tomatoes are not available."],"basicInfo":["easy","10m","50m","6 portions"]}